[{"questionId":1,"questionType":"Chronology","answer":"B) 4 -> 1 -> 2 -> 3","explanation":"Mercantilism was the economic system that dominated Europe from the 16th to the 18th century. It was characterized by the accumulation of wealth through trade, the establishment of colonies, and the protection of domestic industries. Feudalism was the dominant economic system in medieval Europe, where land ownership was the primary source of wealth and power. Capitalism emerged in the 18th century as a response to the limitations of mercantilism, and it is based on private ownership of the means of production, free markets, and the pursuit of profit. Socialism emerged in the 19th century as a response to the inequalities and injustices of capitalism, and it is based on the collective ownership of the means of production, the distribution of wealth according to need, and the elimination of exploitation."},{"questionId":2,"questionType":"MCQ","answer":"C) The Legal Services Authorities Act, 1987","explanation":"The Legal Services Authorities Act (1987) has established a nation-wide network to provide free and competent legal aid to the poor and to organise lok adalat for promoting equal justice."},{"questionId":3,"questionType":"Chronology","answer":"B) 1 -> 2 -> 3 -> 4","explanation":"The Battle of Plassey was fought in 1757, which marked the beginning of British rule in India. The Revolt of 1857, also known as the First War of Independence, took place in 1857 and was a significant event in India's struggle for independence. The Partition of Bengal was announced in 1905 by Lord Curzon, which was met with widespread protests and boycotts by Indians. Finally, India gained its independence from British rule on August 15, 1947, after years of struggle and non-violent resistance led by Mahatma Gandhi and other freedom fighters."},{"questionId":4,"questionType":"Statements","answer":"A) A and B","explanation":"Statement A is correct as the state legislature may authorise a panchayat to levy, collect and appropriate taxes, duties, tolls and fees. Statement B is correct as the governor of a state shall constitute a finance commission to review the financial position of the panchayats after every five years. Statement C is incorrect as the Finance Commission shall make recommendations regarding the distribution between the state and the panchayats of the net proceeds of the taxes, duties, tolls and fees levied by the state and allocation of shares amongst the panchayats at all levels, determination of taxes, duties, tolls and fees that may be assigned to the panchayats, and the grants-in-aid to the panchayats from the consolidated fund of the state. Statement D is incorrect as the Central Finance Commission shall suggest measures needed to augment the consolidated fund of a state to supplement the resources of the panchayats in the states (on the basis of the recommendations made by the finance commission of the state)."},{"questionId":5,"questionType":"List","answer":"B)","explanation":["Rani Laxmi Bai -> Sepoy Mutiny","Mangal Pandey -> Revolt of 1857","Tatya Tope -> Sepoy Mutiny","Bhagat Singh -> Hindustan Socialist Republican Association"]},{"questionId":6,"questionType":"MCQ","answer":"C) They create a sense of discipline and commitment among citizens","explanation":"Fundamental duties serve as a source of inspiration for the citizens and promote a sense of discipline and commitment among them. They create a feeling that the citizens are not mere spectators but active participants in the realization of national goals."},{"questionId":7,"questionType":"Statements","answer":"D) All are true","explanation":"Statement A is correct as the Act of 1786 was enacted to give Lord Cornwallis overriding power over his council in special cases and make him the Commander-in-Chief. Statement B is correct as the Charter Act of 1793 extended the overriding power given to Lord Cornwallis over his council to all future Governor-Generals and Governors of Presidencies. Statement C is correct as the Charter Act of 1793 gave the Governor-General more powers and control over the governments of the subordinate Presidencies of Bombay and Madras."},{"questionId":8,"questionType":"Statements","answer":"A) A and B","explanation":"As the chief law officer of the government in the state, the duties of the advocate general include giving advice to the government of the state upon legal matters referred to him by the governor and discharging the functions conferred on him by the Constitution or any other law. The statement C is incorrect as the advocate general can perform other duties of a legal character assigned to him by the governor. The statement D is incorrect as the advocate general is entitled to appear before any court of law within the state."},{"questionId":9,"questionType":"Chronology","answer":"B) 3 -> 1 -> 4 -> 2","explanation":"The Partition of Bengal was announced by Lord Curzon, the then Viceroy of India, on July 19, 1905. The Swadeshi Movement was launched in 1905 to oppose the partition of Bengal and promote Indian goods. The Indian National Congress was formed in 1885 to voice the demands of the Indian people and to work towards their political, social and economic betterment. The Non-Cooperation Movement was launched by Mahatma Gandhi in 1920 to demand complete independence from British rule and to boycott British goods and institutions. The chronological order of these events is Partition of Bengal -> Formation of Indian National Congress -> Non-Cooperation Movement -> Swadeshi Movement."},{"questionId":10,"questionType":"List","answer":"A)","explanation":["Classical Economics -> Believes in free markets and minimal government intervention","Keynesian Economics -> Believes in government intervention to stimulate demand during recessions","Monetarism -> Believes in controlling the money supply to stabilize the economy","Supply-side Economics -> Believes in reducing taxes and regulations to increase production and supply."]},{"questionId":11,"questionType":"Statements","answer":"D) A, B and E","explanation":"Statement A is correct as the SPSC conducts examinations for appointments to state services. Statement B is correct as the SPSC is consulted on matters related to recruitment, promotions and transfers. Statement E is correct as the SPSC presents an annual report to the Governor on its performance. Statement C is also correct as the SPSC handles disciplinary matters affecting civil servants. Statement D is incorrect as the additional functions relating to the services of the state can be conferred on SPSC by the state legislature and not by the SPSC itself."},{"questionId":12,"questionType":"List","answer":"A)","explanation":["Ganga -> Flows through North India and is considered sacred by Hindus","Yamuna -> A tributary of Ganga and originates from Yamunotri glacier","Brahmaputra -> Flows through North-East India and is known as the Tsangpo in Tibet","Godavari -> Second longest river in India and flows through South India"]},{"questionId":13,"questionType":"Statements","answer":"C) A, B and C","explanation":"Statement A is correct as the 61st Constitutional Amendment Act of 1988 reduced the voting age from 21 years to 18 years for the Lok Sabha as well as assembly elections. Statement B is correct as a provision was made in 1988 that officers and staff engaged in preparation, revision and correction of electoral rolls for elections are deemed to be on deputation to the Election Commission. Statement C is correct as the number of electors required to sign as proposers in nomination papers for elections to the Rajya Sabha and state legislative council was increased to 10 per cent of the electors of the constituency or ten such electors, whichever is less, in 1988. Statement D is incorrect as the provision for the use of Electronic Voting Machines (EVMs) in elections was introduced in 1998."},{"questionId":14,"questionType":"List","answer":"C)","explanation":["Convention on Biological Diversity -> Aims to conserve and sustainably use biodiversity","United Nations Framework Convention on Climate Change -> Aims to stabilize greenhouse gas concentrations in the atmosphere","Stockholm Convention on Persistent Organic Pollutants -> Aims to protect human health and environment from hazardous chemicals","Rotterdam Convention on the Prior Informed Consent Procedure for Certain Hazardous Chemicals and Pesticides in International Trade -> Aims to promote shared responsibility and cooperative efforts in the international trade of hazardous chemicals."]},{"questionId":15,"questionType":"MCQ","answer":"A) Excellence in Training in the Fields of Crime Investigation, Prosecution and Vigilance Functioning","explanation":"The vision of the CBI Academy is “Excellence in Training in the Fields of Crime Investigation, Prosecution and Vigilance Functioning”."},{"questionId":16,"questionType":"MCQ","answer":"A) If he is satisfied that the financial stability or credit of India or any part of its territory is threatened","explanation":"Article 360 empowers the president to proclaim a Financial Emergency if he is satisfied that a situation has arisen due to which the financial stability or credit of India or any part of its territory is threatened."},{"questionId":17,"questionType":"List","answer":"B)","explanation":["Keynesian Economics -> Believes in government intervention to stimulate economic growth","Monetarism -> Believes in controlling the money supply to stabilize the economy","Classical Economics -> Believes in free market and minimal government intervention","Austrian Economics -> Believes in the importance of individual freedom and property rights."]},{"questionId":18,"questionType":"MCQ","answer":"C) Monitoring and evaluation of policies","explanation":"The various functions performed by the NITI Aayog can be divided into four main heads: 1. Design policy and programme framework. 2. Foster co-operative federalism. 3. Monitoring and evaluation. 4. Think-tank, and Knowledge and Innovation Hub."},{"questionId":19,"questionType":"List","answer":"B)","explanation":["John Locke -> Two Treatises of Government","Jean-Jacques Rousseau -> The Social Contract","Thomas Hobbes -> Leviathan","Montesquieu -> The Spirit of the Laws"]},{"questionId":20,"questionType":"MCQ","answer":"C) The Legal Services Authorities Act, 1987","explanation":"The Legal Services Authorities Act (1987) has established a nation-wide network to provide free and competent legal aid to the poor and to organise lok adalat for promoting equal justice."},{"questionId":21,"questionType":"List","answer":"C)","explanation":["Stockholm Convention on Persistent Organic Pollutants -> Aims to protect human health and the environment from chemicals that remain intact in the environment for long periods","United Nations Framework Convention on Climate Change -> Aims to stabilize greenhouse gas concentrations in the atmosphere at a level that would prevent dangerous anthropogenic interference with the climate system","Convention on Biological Diversity -> Aims to conserve biological diversity, promote sustainable use of its components, and ensure fair and equitable sharing of benefits arising from the use of genetic resources","Rotterdam Convention on the Prior Informed Consent Procedure for Certain Hazardous Chemicals and Pesticides in International Trade -> Aims to promote shared responsibility and cooperative efforts among Parties in the international trade of certain hazardous chemicals in order to protect human health and the environment from potential harm."]},{"questionId":22,"questionType":"MCQ","answer":"C) It has stabilized as a working federal polity","explanation":"The observations made by the Commission on the working of the Constitution from 1950 to 2000 state that India’s democratic base has stabilized as a working federal polity."},{"questionId":23,"questionType":"Chronology","answer":"B) 1 -> 3 -> 2 -> 4","explanation":"The history of the Indian Constitution-making process is a long and complex one. The Government of India Act 1935 was an important step towards the eventual formation of the Indian Constitution. The Act provided for the establishment of a federal system of government in India and laid down the framework for the future Constitution. The Nehru Report, submitted in 1928, proposed a dominion status for India within the British Empire and was an important precursor to the eventual Constitution. The Constituent Assembly of India was formed in 1946 and was tasked with the responsibility of drafting the Constitution. The Cabinet Mission Plan, which was proposed in 1946, aimed to resolve the constitutional deadlock between the Congress and the Muslim League and paved the way for the eventual formation of the Indian Constitution."},{"questionId":24,"questionType":"Statements","answer":"B) B and D","explanation":"Statement B is correct as India's political status was that of a dominion in the British Commonwealth of Nations from August 15, 1947 to January 26, 1950. Statement D is correct as India became a member of the UNO in 1945."},{"questionId":25,"questionType":"Chronology","answer":"B) 4 -> 1 -> 3 -> 2","explanation":"The Brundtland Report, also known as Our Common Future, was published in 1987 by the United Nations World Commission on Environment and Development. It introduced the concept of sustainable development and emphasized the need for economic growth to be environmentally sustainable. The Stockholm Conference was held in 1972 and was the first international conference on the environment. It led to the establishment of the United Nations Environment Programme (UNEP). The Rio Declaration was adopted at the United Nations Conference on Environment and Development (UNCED) in 1992, also known as the Earth Summit. It outlined 27 principles for sustainable development. The Earth Summit also resulted in the adoption of Agenda 21, a comprehensive plan of action to be taken globally, nationally, and locally by organizations of the United Nations System, Governments, and Major Groups in every area in which human impacts on the environment."},{"questionId":26,"questionType":"Statements","answer":"A) A only","explanation":"An appeal can be made to the Supreme Court against the judgment of a high court in a constitutional case if the high court certifies that the case involves a substantial question of law that requires the interpretation of the Constitution. In civil cases, an appeal lies to the Supreme Court from any judgment of a high court if the high court certifies that the case involves a substantial question of law of general importance and that the question needs to be decided by the Supreme Court. In criminal cases, an appeal lies to the Supreme Court if the high court has reversed an order of acquittal of an accused person and sentenced him to death, or has taken before itself any case from any subordinate court and convicted the accused person and sentenced him to death, or certifies that the case is a fit one for appeal to the Supreme Court."},{"questionId":27,"questionType":"Statements","answer":"B) A and E","explanation":"Statement A is correct as the CAG can be removed by the President only in accordance with the procedure mentioned in the Constitution. Statement B is incorrect as the CAG is not eligible for further office, either under the Government of India or of any state, after he ceases to hold his office. Statement C is correct as the salary and other service conditions of the CAG are determined by the Parliament. Statement D is incorrect as the administrative expenses of the office of the CAG, including all salaries, allowances and pensions of persons serving in that office are charged upon the Consolidated Fund of India. Thus, they are not subject to the vote of Parliament. Statement E is correct as no minister can represent the CAG in Parliament (both Houses) and no minister can be called upon to take any responsibility for any actions done by him."},{"questionId":28,"questionType":"List","answer":"C)","explanation":["Champaran Satyagraha -> A protest against the forced cultivation of indigo by British landlords","Quit India Movement -> A mass civil disobedience movement launched by Mahatma Gandhi","Dandi March -> A 24-day march to protest against the British Salt Tax","Simon Commission -> A commission set up by the British Government to investigate the political situation in India."]},{"questionId":29,"questionType":"MCQ","answer":"A) Give his assent to the bill, return the bill (if it is not a money bill) for reconsideration of Parliament, or withhold his assent to the bill","explanation":"When a bill is sent to the President after it has been passed by the Parliament, he can give his assent to the bill, or withhold his assent to the bill, or return the bill (if it is not a money bill) for reconsideration of Parliament."},{"questionId":30,"questionType":"List","answer":"A)","explanation":["Classical Economics -> Believes in free markets and minimal government intervention","Keynesian Economics -> Believes in government intervention to stimulate demand during recessions","Monetarism -> Believes in controlling the money supply to stabilize the economy","Supply-side Economics -> Believes in reducing taxes and regulations to increase production and supply."]},{"questionId":31,"questionType":"Chronology","answer":"C) 2 -> 1 -> 4 -> 3","explanation":"The Green Revolution was a significant increase in agricultural productivity in India that began in the 1960s. It was achieved by introducing high-yielding varieties of seeds, intensive irrigation, and modern agricultural techniques. The next significant economic policy implemented by the Indian government was the LPG (Liberalization, Privatization, Globalization) policy in the early 1990s. This policy aimed to liberalize the Indian economy and reduce government control over the private sector. The next significant policy was the nationalization of banks in 1969, which aimed to make banking services available to all sections of society. Finally, the Make in India policy was launched in 2014 to encourage domestic and foreign companies to manufacture their products in India and promote the country as a manufacturing hub."},{"questionId":32,"questionType":"MCQ","answer":"B) He cannot advise or hold a brief against the Government of India","explanation":"The Attorney General of India is restricted from advising or holding a brief against the Government of India, among other limitations."},{"questionId":33,"questionType":"MCQ","answer":"C) A non-constitutional and non-statutory body established by an executive resolution in 2015","explanation":"The NITI Aayog was established on January 1, 2015, as the successor to the Planning Commission. However, it is neither a constitutional body nor a statutory body, but a non-constitutional and non-statutory body established by an executive resolution of the Government of India."},{"questionId":34,"questionType":"MCQ","answer":"B) He cannot advise or hold a brief against the Government of India","explanation":"The Attorney General of India is restricted from advising or holding a brief against the Government of India, among other limitations."},{"questionId":35,"questionType":"Statements","answer":"D) All of the above","explanation":"India's foreign policy is determined by a number of factors such as geography, history, tradition, social structure, political organization, international milieu, economic position, military strength, public opinion and leadership. India's foreign policy is based on various principles such as promotion of world peace, anti-colonialism, anti-racism, non-alignment and Panchsheel. These principles are aimed at promoting international peace and security, opposing colonialism and imperialism, opposing racialism, maintaining friendly relations with all countries and promoting peaceful co-existence."},{"questionId":36,"questionType":"Chronology","answer":"B) 3 -> 1 -> 4 -> 2","explanation":"The Swadeshi Movement was launched in 1905 in protest against the partition of Bengal by the British. The Non-Cooperation Movement was launched in 1920 by Mahatma Gandhi as a response to the Jallianwala Bagh massacre and the Rowlatt Act. The Civil Disobedience Movement was launched in 1930 by Mahatma Gandhi as a protest against the Salt Law imposed by the British. The Quit India Movement was launched in 1942 by the Indian National Congress under the leadership of Mahatma Gandhi, demanding an end to British rule in India. The chronological order of these events is Swadeshi Movement > Non-Cooperation Movement > Civil Disobedience Movement > Quit India Movement."},{"questionId":37,"questionType":"List","answer":"C)","explanation":["Capitalism -> Private ownership of means of production","Socialism -> Collective ownership of means of production","Communism -> State ownership of means of production","Fascism -> Extreme nationalism and authoritarianism."]},{"questionId":38,"questionType":"MCQ","answer":"A) Give his assent to the bill, return the bill (if it is not a money bill) for reconsideration of Parliament, or withhold his assent to the bill","explanation":"When a bill is sent to the President after it has been passed by the Parliament, he can give his assent to the bill, or withhold his assent to the bill, or return the bill (if it is not a money bill) for reconsideration of Parliament."},{"questionId":39,"questionType":"List","answer":"A)","explanation":["Ganga -> Flows through North India and is considered sacred by Hindus","Yamuna -> A tributary of Ganga and originates from Yamunotri glacier","Brahmaputra -> Flows through North-East India and is known as the Tsangpo in Tibet","Godavari -> Second longest river in India and flows through South India"]},{"questionId":40,"questionType":"Chronology","answer":"B) 4 -> 1 -> 2 -> 3","explanation":"Mercantilism was the economic system that dominated Europe from the 16th to the 18th century. It was characterized by the accumulation of wealth through trade, the establishment of colonies, and the protection of domestic industries. Feudalism was the dominant economic system in medieval Europe, where land ownership was the primary source of wealth and power. Capitalism emerged in the 18th century as a response to the limitations of mercantilism, and it is based on private ownership of the means of production, free markets, and the pursuit of profit. Socialism emerged in the 19th century as a response to the inequalities and injustices of capitalism, and it is based on the collective ownership of the means of production, the distribution of wealth according to need, and the elimination of exploitation."},{"questionId":41,"questionType":"Statements","answer":"D) C","explanation":"The motion on Draft Constitution was declared as passed on November 26, 1949, and received the signatures of the members and the president."},{"questionId":42,"questionType":"MCQ","answer":"D) Nagaland, Meghalaya, Mizoram, and certain other areas","explanation":"The act does not apply to the states of Nagaland, Meghalaya and Mizoram and certain other areas. These areas include, (a) the scheduled areas and the tribal areas in the states5 ; (b) the hill areas of Manipur for which district councils exist; and (c) Darjeeling district of West Bengal for which Darjeeling Gorkha Hill Council exists."},{"questionId":43,"questionType":"MCQ","answer":"B) Because the Parliament lacks the necessary expertise to scrutinize all legislative measures and other matters","explanation":"The functions of the Parliament are varied, complex and voluminous. Moreover, it has neither the adequate time nor necessary expertise to make a detailed scrutiny of all legislative measures and other matters."},{"questionId":44,"questionType":"MCQ","answer":"A) Give his assent to the bill, return the bill (if it is not a money bill) for reconsideration of Parliament, or withhold his assent to the bill","explanation":"When a bill is sent to the President after it has been passed by the Parliament, he can give his assent to the bill, or withhold his assent to the bill, or return the bill (if it is not a money bill) for reconsideration of Parliament."},{"questionId":45,"questionType":"List","answer":"B)","explanation":["Keynesian Economics -> Believes in government intervention to stimulate economic growth","Monetarism -> Believes in controlling the money supply to stabilize the economy","Classical Economics -> Believes in free market and minimal government intervention","Austrian Economics -> Believes in the importance of individual freedom and property rights."]},{"questionId":46,"questionType":"List","answer":"B)","explanation":["Geomorphic Processes -> Description","Erosion -> Process of transporting sediment from one location to another","Weathering -> Process of breaking down rocks into smaller pieces","Deposition -> Process of adding sediment to a landform","Volcanism -> Process of molten rock, ash, and gas being expelled from a volcano."]},{"questionId":47,"questionType":"MCQ","answer":"A) Secularism","explanation":"The Indian Constitution embodies the positive concept of secularism ie, all religions in our country (irrespective of their strength) have the same status and support from the state."},{"questionId":48,"questionType":"List","answer":"B)","explanation":["Lucknow Pact -> Demand for Dominion Status","August Offer -> Offer of Dominion Status","Cripps Mission -> Proposed constitutional reforms and Indian independence after World War II","Quit India Movement -> Call for immediate and unconditional withdrawal of British from India."]},{"questionId":49,"questionType":"List","answer":"B)","explanation":["Russian Revolution -> Overthrow of Tsar Nicholas II and establishment of Soviet Union","French Revolution -> Overthrow of the Bourbon monarchy and establishment of a republic","Chinese Revolution -> Overthrow of the Qing Dynasty","Cuban Revolution -> Led by Fidel Castro and Che Guevara."]},{"questionId":50,"questionType":"List","answer":"B)","explanation":["International Environmental Conventions -> Description","Convention on Biological Diversity -> Aims to conserve biodiversity, promote sustainable use of its components, and ensure the fair and equitable sharing of benefits","United Nations Framework Convention on Climate Change -> Aims to stabilize greenhouse gas concentrations in the atmosphere at a level that would prevent dangerous anthropogenic interference with the climate system","Stockholm Convention on Persistent Organic Pollutants -> Aims to protect human health and the environment from the effects of persistent organic pollutants","Basel Convention on the Control of Transboundary Movements of Hazardous Wastes and their Disposal -> Regulates the transboundary movements of hazardous waste and their disposal."]},{"questionId":51,"questionType":"List","answer":"C)","explanation":["Classical Economics -> Believes in free markets and limited government intervention","Keynesian Economics -> Believes in government intervention to stabilize the economy","Monetarism -> Believes that controlling the money supply is the key to economic stability","Supply-side Economics -> Believes that lowering taxes and regulations will stimulate economic growth."]},{"questionId":52,"questionType":"Statements","answer":"D) A, B and E","explanation":"Statement A is correct as the SPSC conducts examinations for appointments to state services. Statement B is correct as the SPSC is consulted on matters related to recruitment, promotions and transfers. Statement E is correct as the SPSC presents an annual report to the Governor on its performance. Statement C is also correct as the SPSC handles disciplinary matters affecting civil servants. Statement D is incorrect as the additional functions relating to the services of the state can be conferred on SPSC by the state legislature and not by the SPSC itself."},{"questionId":53,"questionType":"MCQ","answer":"C) It is too legalistic and complicated","explanation":"H.K. Maheswari observed that the Indian Constitution tends to make people more litigious and less truthful due to its legal language and phraseology, making it a complex document and a 'lawyer's paradise'."},{"questionId":54,"questionType":"Statements","answer":"B) A and C","explanation":"Statement A is correct as coalition government means an alliance of distinct political parties. Statement B is incorrect as coalition government is formed when no single political party can muster a majority of votes. Statement C is correct as coalition government is a phenomenon of a multi-party government where a number of minority parties join hands for the purpose of running the government."},{"questionId":55,"questionType":"MCQ","answer":"A) Dinesh Goswami","explanation":"The National Front Government headed by V.P. Singh appointed a committee on electoral reforms under the chairmanship of Dinesh Goswami, the then Law Minister."},{"questionId":56,"questionType":"MCQ","answer":"A) If he is satisfied that the financial stability or credit of India or any part of its territory is threatened","explanation":"Article 360 empowers the president to proclaim a Financial Emergency if he is satisfied that a situation has arisen due to which the financial stability or credit of India or any part of its territory is threatened."},{"questionId":57,"questionType":"Chronology","answer":"B) 1 -> 4 -> 2 -> 3","explanation":"The Green Revolution in India is an agricultural revolution that started in the early 1960s. It was a significant step towards making India self-sufficient in food production. The nationalization of banks in India took place in 1969, which aimed to bring the banking sector under government control. The liberalization of Indian economy started in 1991, which was a significant step towards opening up the Indian market to foreign investment and reducing government control over the economy. The introduction of GST in India took place in 2017, which aimed to bring a uniform taxation system across the country and eliminate the cascading effect of taxes. Hence, the correct chronological order of these events is 1 -> 4 -> 2 -> 3."},{"questionId":58,"questionType":"MCQ","answer":"C) An annual assessment by an independent body","explanation":"To bring greater accountability, all fiscal legislations should provide for an annual assessment by an independent body and the reports of these bodies should be laid in both Houses of Parliament/state legislature."},{"questionId":59,"questionType":"List","answer":"C)","explanation":["Keynesian Economics -> Believes in government intervention to stabilize the economy","Classical Economics -> Believes in laissez-faire policies and free market","Monetarism -> Believes in controlling the money supply to stabilize the economy","Supply-side Economics -> Believes in cutting taxes and regulations to stimulate economic growth."]},{"questionId":60,"questionType":"Chronology","answer":"C) 2 -> 1 -> 3 -> 4","explanation":"The Silent Valley Movement took place in 1973 in Kerala, against the government's decision to build a hydroelectric dam across the Kunthipuzha river. The Chipko Movement began in 1973 in Uttarakhand, when local women hugged trees to prevent them from being cut down. The Narmada Bachao Andolan was launched in 1985 to protest against the construction of the Sardar Sarovar Dam on the Narmada river. The Bhopal Gas Tragedy occurred in 1984 when a gas leak from a Union Carbide plant resulted in over 500,000 people being exposed to toxic gases, causing thousands of deaths and illnesses. Thus, the correct chronological order is 2 -> 1 -> 3 -> 4."},{"questionId":61,"questionType":"Chronology","answer":"C) 2 -> 1 -> 4 -> 3","explanation":"The Green Revolution was a significant increase in agricultural productivity in India that began in the 1960s. It was achieved by introducing high-yielding varieties of seeds, intensive irrigation, and modern agricultural techniques. The next significant economic policy implemented by the Indian government was the LPG (Liberalization, Privatization, Globalization) policy in the early 1990s. This policy aimed to liberalize the Indian economy and reduce government control over the private sector. The next significant policy was the nationalization of banks in 1969, which aimed to make banking services available to all sections of society. Finally, the Make in India policy was launched in 2014 to encourage domestic and foreign companies to manufacture their products in India and promote the country as a manufacturing hub."},{"questionId":62,"questionType":"MCQ","answer":"A) India has an integrated judicial system while the US has a double system of courts","explanation":"The Indian Constitution has established an integrated judicial system with the Supreme Court at the top and the state high courts below it. This single system of courts enforces both the Central laws as well as the state laws. In US, on the other hand, there is a double system of courts whereby the federal laws are enforced by the federal judiciary and the state laws by the state judiciary."},{"questionId":63,"questionType":"MCQ","answer":"B) Because the Parliament lacks the necessary expertise to scrutinize all legislative measures and other matters","explanation":"The functions of the Parliament are varied, complex and voluminous. Moreover, it has neither the adequate time nor necessary expertise to make a detailed scrutiny of all legislative measures and other matters."},{"questionId":64,"questionType":"List","answer":"C)","explanation":["World Trade Organization -> Promotes international trade and resolves trade disputes","International Monetary Fund -> Facilitates international monetary cooperation and exchange rate stability","World Bank -> Provides loans and grants for development projects in developing countries","United Nations -> Promotes international cooperation and peacekeeping"]},{"questionId":65,"questionType":"MCQ","answer":"A) To select the group which is to form the government and leave it to the people to decide at the next general election","explanation":"The first function of Parliament can be said to be to select the group which is to form the government, support and sustain it in power so long as it enjoys its confidence, and to expel it when it ceases to do so, and leave it to the people to decide at the next general election."},{"questionId":66,"questionType":"Statements","answer":"B) A and C","explanation":"Statement A is correct as the Constitution of India has several salient features that distinguish it from the Constitutions of other countries. Statement B is incorrect as a number of original features of the Constitution (as adopted in 1949) have undergone a substantial change, on account of several amendments. Statement C is correct as the Kesavananda Bharati case of 1973 established that the basic structure of the Constitution cannot be altered by the constituent power of Parliament under Article 368."},{"questionId":67,"questionType":"List","answer":"B)","explanation":["Holocene -> 11,700 years ago-present","Cretaceous -> 145-66 million years ago","Permian -> 299-251 million years ago","Cambrian -> 542-488 million years ago."]},{"questionId":68,"questionType":"Statements","answer":"D) All of the above","explanation":"As per the provisions mentioned in the paragraph, the Election Commission introduced the following provisions for the Lok Sabha and Assembly elections: A) Exemption of travelling expenditure incurred by the campaigning leaders of a political party from being included in the election expenses of the candidate. B) Free supply of copies of electoral rolls and other prescribed material to the candidates of recognised political parties. C) Political parties entitled to accept any amount of contribution from any person or company other than a government company. D) Allocation of equitable sharing of time on the cable television network and other electronic media during elections to display or propagate any matter or to address public. E) Introduction of Braille signage features on Electronic Voting Machines for visually impaired voters."},{"questionId":69,"questionType":"Statements","answer":"A) A and B","explanation":"Statement A is correct as the Election Commission of India is an independent body established by the Indian Constitution. Statement B is correct as the Election Commission ensures free and fair elections to the Parliament, the state legislatures, the office of President of India and the office of Vice-president of India."},{"questionId":70,"questionType":"Statements","answer":"A) A and B","explanation":"Statement A is correct as the Parliament and the State Legislatures have failed to acquire adequate representative character, as per the given paragraph. Statement B is correct as the increasing instability of the elected governments is attributable to opportunistic politics and unprincipled defections, as mentioned in the given paragraph. Statement C is partially correct as the state of the Indian economy is disturbing and is gradually sinking into a debt-trap, but it is not directly related to the working of the institutions of parliamentary democracy. Statement D is partially correct as the quality of education and the higher research need urgent repair, but it is not directly related to the working of the institutions of parliamentary democracy."},{"questionId":71,"questionType":"Statements","answer":"B) A, B and D","explanation":"Statement A is correct as Registration of electors Rules, 1960 provide for the preparation and publication of electoral rolls. Statement B is correct as Conduct of Elections Rules, 1961 facilitates conduct of fair and free elections to the Parliament and State Legislatures. Statement C is incorrect as it relates to Presidential and Vice-Presidential Elections Rules, 1974. Statement D is correct as Members of Lok Sabha (Declaration of Assets and Liabilities) Rules, 2004 relate to elections in India."},{"questionId":72,"questionType":"List","answer":"B)","explanation":["Lucknow Pact -> Demand for Dominion Status","August Offer -> Offer of Dominion Status","Cripps Mission -> Proposed constitutional reforms and Indian independence after World War II","Quit India Movement -> Call for immediate and unconditional withdrawal of British from India."]},{"questionId":73,"questionType":"List","answer":"C)","explanation":["Fluvial Erosion -> Erosion by flowing water","Aeolian Erosion -> Erosion by wind action","Glacial Erosion -> Erosion by glacier movement","Karst Erosion -> Erosion by dissolution of soluble rocks."]},{"questionId":74,"questionType":"Statements","answer":"B) A and C","explanation":"Statement A is correct as the Constitution of India has several salient features that distinguish it from the Constitutions of other countries. Statement B is incorrect as a number of original features of the Constitution (as adopted in 1949) have undergone a substantial change, on account of several amendments. Statement C is correct as the Kesavananda Bharati case of 1973 established that the basic structure of the Constitution cannot be altered by the constituent power of Parliament under Article 368."},{"questionId":75,"questionType":"List","answer":"C)","explanation":["Montreal Protocol -> Aims to protect human health and the environment from ozone depletion","Convention on Biological Diversity -> Aims to conserve and sustainably use biodiversity","United Nations Framework Convention on Climate Change -> Aims to stabilize greenhouse gas concentrations in the atmosphere","Stockholm Convention on Persistent Organic Pollutants -> Aims to protect human health and the environment from hazardous chemicals."]},{"questionId":76,"questionType":"List","answer":"C)","explanation":["Montreal Protocol -> Aims to protect human health and the environment from ozone depletion","Convention on Biological Diversity -> Aims to conserve and sustainably use biodiversity","United Nations Framework Convention on Climate Change -> Aims to stabilize greenhouse gas concentrations in the atmosphere","Stockholm Convention on Persistent Organic Pollutants -> Aims to protect human health and the environment from hazardous chemicals."]},{"questionId":77,"questionType":"Statements","answer":"C) C and D","explanation":"Statement A is incorrect as the CVC is a multi-member body consisting of a Central Vigilance Commissioner (chairperson) and not more than two vigilance commissioners. Statement B is incorrect as they are appointed by the president on the recommendation of a three-member committee consisting of the prime minister as its head, the Union minister of home affairs and the Leader of the Opposition in the Lok Sabha. Statement C is correct as they hold office for a term of four years or until they attain the age of sixty-five years, whichever is earlier. Statement D is correct as the president can remove the Central Vigilance Commissioner or any vigilance commissioner on the ground of proved misbehaviour or incapacity."},{"questionId":78,"questionType":"Statements","answer":"B) B and D","explanation":"Statement B is correct as the Fundamental Duties of citizens were added in the Indian Constitution in 1976. Statement D is correct as the Constitution of erstwhile USSR gave equal importance to fundamental rights and duties of citizens. Statement A is incorrect as the original constitution contained only fundamental rights and not fundamental duties. Statement C is incorrect as the Constitutions of major democratic countries like USA, Canada, France, Germany, and Australia do not specifically contain a list of duties of citizens."},{"questionId":79,"questionType":"MCQ","answer":"A) Secularism","explanation":"The Indian Constitution embodies the positive concept of secularism ie, all religions in our country (irrespective of their strength) have the same status and support from the state."},{"questionId":80,"questionType":"MCQ","answer":"C) Integrated Personnel System, Unified Personnel System, Separate Personnel System","explanation":"The three types of municipal personnel systems in India are Separate Personnel System, Unified Personnel System, and Integrated Personnel System."},{"questionId":81,"questionType":"Statements","answer":"A) A and B","explanation":"Statement A is correct as the state legislature may authorise a panchayat to levy, collect and appropriate taxes, duties, tolls and fees. Statement B is correct as the governor of a state shall constitute a finance commission to review the financial position of the panchayats after every five years. Statement C is incorrect as the Finance Commission shall make recommendations regarding the distribution between the state and the panchayats of the net proceeds of the taxes, duties, tolls and fees levied by the state and allocation of shares amongst the panchayats at all levels, determination of taxes, duties, tolls and fees that may be assigned to the panchayats, and the grants-in-aid to the panchayats from the consolidated fund of the state. Statement D is incorrect as the Central Finance Commission shall suggest measures needed to augment the consolidated fund of a state to supplement the resources of the panchayats in the states (on the basis of the recommendations made by the finance commission of the state)."},{"questionId":82,"questionType":"Statements","answer":"B) A and C","explanation":"Statement A is correct as Article 23 prohibits traffic in human beings, begar (forced labour) and other similar forms of forced labour. Statement B is partially correct as the Bonded Labour System (Abolition) Act, 1976; the Minimum Wages Act, 1948; the Contract Labour Act, 1970 and the Equal Remuneration Act, 1976 were made to abolish forced labour. Statement C is correct as Article 24 prohibits the employment of children below the age of 14 years in any factory, mine or other hazardous activities like construction work or railway."},{"questionId":83,"questionType":"Statements","answer":"D) A, B and E","explanation":"Statement A is correct as the SPSC conducts examinations for appointments to state services. Statement B is correct as the SPSC is consulted on matters related to recruitment, promotions and transfers. Statement E is correct as the SPSC presents an annual report to the Governor on its performance. Statement C is also correct as the SPSC handles disciplinary matters affecting civil servants. Statement D is incorrect as the additional functions relating to the services of the state can be conferred on SPSC by the state legislature and not by the SPSC itself."},{"questionId":84,"questionType":"Chronology","answer":"B) 1 -> 2 -> 3 -> 4","explanation":"The Battle of Plassey was fought in 1757, which marked the beginning of British rule in India. The Revolt of 1857, also known as the First War of Independence, took place in 1857 and was a significant event in India's struggle for independence. The Partition of Bengal was announced in 1905 by Lord Curzon, which was met with widespread protests and boycotts by Indians. Finally, India gained its independence from British rule on August 15, 1947, after years of struggle and non-violent resistance led by Mahatma Gandhi and other freedom fighters."},{"questionId":85,"questionType":"List","answer":"B)","explanation":["Keynesian Economics -> Believes in government intervention to stabilize the economy","Classical Economics -> Believes in free markets and laissez-faire policies","Monetarism -> Believes in controlling the money supply to stabilize the economy","Supply-Side Economics -> Believes in cutting taxes and regulations to stimulate economic growth."]},{"questionId":86,"questionType":"Statements","answer":"A) A and B","explanation":"Statement A is correct as the Parliament and the State Legislatures have failed to acquire adequate representative character, as per the given paragraph. Statement B is correct as the increasing instability of the elected governments is attributable to opportunistic politics and unprincipled defections, as mentioned in the given paragraph. Statement C is partially correct as the state of the Indian economy is disturbing and is gradually sinking into a debt-trap, but it is not directly related to the working of the institutions of parliamentary democracy. Statement D is partially correct as the quality of education and the higher research need urgent repair, but it is not directly related to the working of the institutions of parliamentary democracy."},{"questionId":87,"questionType":"Statements","answer":"C) A and C","explanation":"Statement A is correct as per the Citizenship (Amendment) Act, 2015, an overseas citizen of India cardholder can be a citizen of another country, but was a citizen of India at any time after the commencement of the Constitution. Statement B is incorrect as an overseas citizen of India cardholder shall be entitled to the right to equality of opportunity in matters of public employment. Statement C is correct as per the Citizenship (Amendment) Act, 2015, an overseas citizen of India cardholder can be a person whose spouse of foreign origin of a citizen of India or spouse of foreign origin of an Overseas Citizen of India Cardholder and whose marriage has been registered and subsisted for a continuous period of not less than two years immediately preceding the presentation of the application."},{"questionId":88,"questionType":"MCQ","answer":"B) It is the same as the procedure for impeachment of the President, mutatis mutandis","explanation":"As per paragraph 10, the procedure laid down for impeachment of President, mutatis mutandis can be made applicable for impeachment of Governors as well."},{"questionId":89,"questionType":"MCQ","answer":"C) Difficulties in interpreting provisions related to the right of Parliament","explanation":"The Swaran Singh Committee Report stated that difficulties have been thrown up from time to time in the interpretation of some of its provisions, more particularly when they concern the right of Parliament to be the most authentic and effective instrument to give expression and content to the sovereign will of the people."},{"questionId":90,"questionType":"List","answer":"B)","explanation":["Nelson Mandela -> South Africa","Che Guevara -> Bolivia","Ho Chi Minh -> Vietnam","Fidel Castro -> Cuba."]},{"questionId":91,"questionType":"MCQ","answer":"B) To combat corruption in public life and curbing economic and violent crimes through meticulous investigation and prosecution","explanation":"As per the given paragraph, the mission of CBI is to combat corruption in public life and curbing economic and violent crimes through meticulous investigation and prosecution."},{"questionId":92,"questionType":"List","answer":"B)","explanation":["Lucknow Pact -> Demand for Dominion Status","August Offer -> Offer of Dominion Status","Cripps Mission -> Proposed constitutional reforms and Indian independence after World War II","Quit India Movement -> Call for immediate and unconditional withdrawal of British from India."]},{"questionId":93,"questionType":"List","answer":"C)","explanation":["Keynesian economics -> Believes in government intervention to stabilize economy","Classical economics -> Emphasizes free market and laissez-faire policies","Monetarism -> Focuses on the role of money supply in economic growth","Austrian economics -> Emphasizes individual liberty and private property rights."]},{"questionId":94,"questionType":"Statements","answer":"C) A, B and C","explanation":"Statement A is correct as the heading of Part-IV of the Constitution should be amended to read as ‘Directive Principles of State Policy and Action’. Statement B is correct as a new Directive Principle on control of population should be added. Statement C is correct as an independent National Education Commission should be set-up every five years."},{"questionId":95,"questionType":"List","answer":"C)","explanation":["Montreal Protocol -> Aims to protect human health and the environment from ozone depletion","UN Framework Convention on Climate Change -> Addresses the reduction of greenhouse gases in the atmosphere","Convention on Biological Diversity -> Aims to conserve and sustainably use biodiversity","Stockholm Convention on Persistent Organic Pollutants -> Addresses the reduction and elimination of persistent organic pollutants."]},{"questionId":96,"questionType":"List","answer":"C)","explanation":["Montreal Protocol -> Aims to protect the ozone layer by phasing out the production of substances that are responsible for ozone depletion","Convention on Biological Diversity -> Aims to conserve and sustainably use biodiversity, and ensure the fair and equitable sharing of benefits arising from the use of genetic resources","Kyoto Protocol -> Aims to reduce greenhouse gas emissions to combat climate change","Paris Agreement -> Aims to limit global temperature rise to well below 2 degrees Celsius and pursue efforts to limit the temperature increase to 1.5 degrees Celsius."]},{"questionId":97,"questionType":"Statements","answer":"C) A, C and D","explanation":"Statement A is correct as in a pocket veto, the President neither ratifies nor rejects nor returns the bill, but simply keeps the bill pending for an indefinite period. Statement B is correct as the Indian President has a bigger pocket veto than the American President. Statement C is correct as the American President has to return the bill for reconsideration within 10 days. Statement D is correct as the President has no veto power in respect of a constitutional amendment bill, but is obligated to give his assent to it as per the 24th Constitutional Amendment Act of 1971."},{"questionId":98,"questionType":"Statements","answer":"C) A and B","explanation":"The Constitution makers chose indirect election for the President of India because it is in harmony with the parliamentary system of government envisaged in the Constitution, where the President is only a nominal executive and the real powers are vested in the council of ministers headed by the prime minister. Direct election of the President would have been very costly and time-consuming due to the vast size of the electorate, and it would have been unwarranted keeping in view that the President is only a symbolic head."},{"questionId":99,"questionType":"MCQ","answer":"B) The doctrine that the constituent power of Parliament under Article 368 does not enable it to alter the 'basic structure' of the Constitution","explanation":"The doctrine of basic structure of the Constitution was laid down by the Supreme Court in the Kesavananda Bharati case and reaffirmed in subsequent cases. It states that the constituent power of Parliament under Article 368 does not enable it to alter the 'basic structure' of the Constitution, which means that the Parliament cannot abridge or take away a Fundamental Right that forms a part of the 'basic structure' of the Constitution."},{"questionId":100,"questionType":"MCQ","answer":"C) Doctrine of Severability","explanation":"The Doctrine of Severability is applied by the Supreme Court while interpreting the constitution to ensure that a law is not declared unconstitutional in its entirety."}]