[
    {
        "questionId": 1,
        "questionType": "MCQ",
        "answer": "C) Sahil Varman",
        "explanation": "Sahil Varman was the Raja of Chamba who transferred the capital of his state from Bharmaur to Chamba. This relocation took place in the 10th century. Sahil Varman is credited with establishing Chamba as the new capital and developing it into a prosperous and influential city in the region."
    },
    {
        "questionId": 2,
        "questionType": "MCQ",
        "answer": "A) Jagat Singh",
        "explanation": "During the reign of Raja Jagat Singh of Nurpur princely state, the forts of Maukot, Nurpur, and Taragarh were captured by the Mughals. This event took place during the Mughal period, indicating that the Mughal Empire successfully took control of these forts under Raja Jagat Singh's rule."
    },
    {
        "questionId": 3,
        "questionType": "MCQ",
        "answer": "B) Cunningham",
        "explanation": "The first European to draw attention to the history of royal families of Jalandhar and Trigarta was Cunningham. Alexander Cunningham, an officer in the British Indian Army and an archaeologist, extensively studied the history and archaeology of ancient India. He conducted surveys and excavations in various regions, including Jalandhar and Trigarta, and contributed significantly to the understanding of India's historical past."
    },
    {
        "questionId": 4,
        "questionType": "MCQ",
        "answer": "A) 1803 AD",
        "explanation": "The Gurkhas captured the Sirmaur princely state around the year 1803 AD. The Gurkhas, from present-day Nepal, expanded their territory into various regions of northern India during the early 19th century. In 1803, they successfully captured the Sirmaur princely state, which was located in the foothills of the Himalayas in the present-day Himachal Pradesh region of India."
    },
    {
        "questionId": 5,
        "questionType": "MCQ",
        "answer": "C) Kehri Singh",
        "explanation": "The raja of Bushahr princely state who was conferred the title of Chhatarpati by the Mughal emperor Aurangzeb was Kehri Singh. During Aurangzeb's reign, Kehri Singh, the ruler of Bushahr, displayed loyalty and valor in his service to the Mughal Empire. As a mark of recognition, Aurangzeb bestowed upon him the prestigious title of Chhatarpati, signifying his status as a distinguished warrior."
    },
    {
        "questionId": 6,
        "questionType": "MCQ",
        "answer": "C) Heisidrus",
        "explanation": "The Greek scholars referred to the Satluj River as Heisidrus. During ancient times, Greek scholars and geographers had their own names for various geographical features and rivers. They named the Satluj River as Heisidrus, which was their rendition and interpretation of its local name. This demonstrates the historical interactions and exchanges between different civilizations in the exploration and documentation of geographical features."
    },
    {
        "questionId": 7,
        "questionType": "MCQ",
        "answer": "C) Deva Purana",
        "explanation": "According to legend, it was the Deva Purana that states a God (Devta) killed Banasur, who was the ruler of the Sarahan area of upper Shimla. The Deva Purana is a sacred text in Hindu mythology that contains stories and legends about various gods and goddesses. This particular legend narrates the defeat of Banasur by a deity, showcasing the mythical tales associated with the region and its rulers."
    },
    {
        "questionId": 8,
        "questionType": "MCQ",
        "answer": "A) Kunjam Pass",
        "explanation": "The Spiti River originates from Kunjam Pass. Kunjam Pass is a high mountain pass located in the Spiti Valley of Himachal Pradesh, India. It serves as the source of the Spiti River, which flows through the rugged and picturesque Spiti Valley, offering stunning landscapes and serving as a lifeline for the region's inhabitants. The origin of the Spiti River from Kunjam Pass showcases the natural beauty and geographical features of the area."
    },
    {
        "questionId": 9,
        "questionType": "MCQ",
        "answer": "C) Bharari",
        "explanation": "In Bilaspur District of Himachal Pradesh, a woman Industrial Training Institute (I.T.I) was made functional at Bharari during the year 2015-16. Bharari is a location within Bilaspur District where this specialized training institute for women was established. The I.T.I. provides vocational training and skill development opportunities to women, enabling them to acquire valuable skills for employment and entrepreneurship. This initiative promotes women's empowerment and economic growth in the region."
    },
    {
        "questionId": 10,
        "questionType": "MCQ",
        "answer": "C) 111MW",
        "explanation": "The approximate capacity of the Sawra-Kuddu Hydro-Electric Power Project is 111MW. The Sawra-Kuddu project is a hydroelectric power plant located in Himachal Pradesh, India. It harnesses the power of the Satluj River to generate electricity through its installed capacity of 111MW. This renewable energy project contributes to the state's power generation and helps meet the growing energy demands in the region."
    },
    {
        "questionId": 11,
        "questionType": "MCQ",
        "answer": "D) Kangra and Chamba",
        "explanation": "The H.P. Forest Ecosystem Climate Proofing Project will be implemented in the districts of Kangra and Chamba in Himachal Pradesh. This project aims to enhance the resilience of forest ecosystems in the face of climate change. Kangra and Chamba districts, known for their diverse forest cover and ecological significance, will benefit from the project's measures to conserve and sustainably manage forest resources. The implementation of this project in these districts reflects the strategic approach towards climate adaptation and environmental conservation in the region."
    },
    {
        "questionId": 12,
        "questionType": "MCQ",
        "answer": "B) 50 percent subject to maximum of Rupees 1,300",
        "explanation": "Under the Mata Shabri Mahila Sashaktikaran Yojan in Himachal Pradesh, women belonging to the eligible category receive a subsidy of 50 percent, subject to a maximum of Rupees 1,300, for providing a gas connection. This scheme aims to empower women by promoting clean cooking fuel and reducing their reliance on traditional and polluting cooking methods. The subsidy provided helps make LPG (liquefied petroleum gas) cylinders more affordable and accessible to women in the eligible category, contributing to their empowerment and improved health and safety."
    },
    {
        "questionId": 13,
        "questionType": "MCQ",
        "answer": "D) Pyramidal shaped",
        "explanation": "The architectural style of the Hateshwari Temple at Hatkoti, located in Jubbal Tehsil of Shimla District, is pyramidal shaped. The temple follows a distinctive architectural design characterized by a pyramid-like structure. This style is often associated with traditional temple architecture in Himachal Pradesh, showcasing the rich cultural and artistic heritage of the region. The pyramidal shape of the Hateshwari Temple adds to its unique and visually appealing features."
    },
    {
        "questionId": 14,
        "questionType": "MCQ",
        "answer": "C) Padmavat of Jayasee",
        "explanation": "The subject matter 'Padmavat of Jayasee' is not found in the Kangra Kalam style Kangra paintings of the eighteenth century. Kangra paintings, a prominent school of miniature paintings in Himachal Pradesh, often depicted themes from Indian literature and poetry. However, the specific work 'Padmavat of Jayasee' is not associated with the Kangra Kalam style. The other options mentioned, such as 'Geet Gobind of Jai Deva,' 'Satsai of Bihari,' and 'Rasik Priya of Keshav Das,' are known to be depicted in Kangra paintings of that era."
    },
    {
        "questionId": 15,
        "questionType": "MCQ",
        "answer": "B) Three",
        "explanation": "The present H.P. Vidhan Sabha, as of the current information available, consists of three women members. These women members represent their respective constituencies and contribute to the legislative proceedings and decision-making processes in the Himachal Pradesh state assembly. The presence of women members in the Vidhan Sabha reflects the efforts towards gender representation and inclusivity in the political arena of Himachal Pradesh."
    },
    {
        "questionId": 16,
        "questionType": "MCQ",
        "answer": "C) Jeori",
        "explanation": "The Government Sheep Breeding Farm in Shimla District of Himachal Pradesh is located in Jeori. Jeori is a town in the Shimla District known for its agricultural and farming activities. The Government Sheep Breeding Farm plays a crucial role in the development and improvement of sheep breeds by implementing scientific breeding practices. It serves as a center for the production and distribution of superior quality sheep breeds to enhance the productivity and profitability of the sheep farming sector in the region."
    },
    {
        "questionId": 17,
        "questionType": "MCQ",
        "answer": "D) 18.17",
        "explanation": "According to the 2010-11 Agricultural census, the percentage of small landholding in Himachal Pradesh was 18.17%. This indicates that a significant portion of agricultural land in the state is owned by small-scale farmers. Small landholdings are characterized by their size and are typically cultivated by farmers who rely on subsistence farming or small-scale commercial agriculture. The presence of a relatively high percentage of small landholdings reflects the agrarian structure and farming practices in Himachal Pradesh."
    },
    {
        "questionId": 18,
        "questionType": "MCQ",
        "answer": "A) M/s. Reliance Cementation",
        "explanation": "The prospecting license to carry out a detailed study for proving the quantity of limestone deposits in Sugrathi-Thangar-Kura Khera-Paulikhera-Kandal-Dedera of Tehsil Chopal in Shimla District, Himachal Pradesh, was given to M/s. Reliance Cementation. Reliance Cementation, a cement company, has been granted permission to conduct an in-depth assessment of the limestone reserves in the mentioned area. This study will help determine the availability and potential utilization of limestone for cement production in the region."
    },
    {
        "questionId": 19,
        "questionType": "MCQ",
        "answer": "B) Inderpal",
        "explanation": "During the pre-independence period, the Himachali revolutionary who edited the Sudarshan Chakra magazine from Lahore was Inderpal. Sudarshan Chakra was an influential magazine that played a significant role in spreading revolutionary ideas and promoting the cause of independence. Inderpal, hailing from Himachal Pradesh, took on the responsibility of editing and publishing the magazine, contributing to the freedom movement through his writings and activism."
    },
    {
        "questionId": 20,
        "questionType": "MCQ",
        "answer": "A) C.G. Bruce",
        "explanation": "The book 'Kullu and Lahaul' is authored by C.G. Bruce. C.G. Bruce was an author and explorer who wrote about various regions in India, including Kullu and Lahaul. The book provides insights into the culture, history, geography, and traditions of these regions, offering a comprehensive understanding of Kullu and Lahaul. It serves as a valuable resource for those interested in exploring and learning about the rich heritage of Himachal Pradesh."
    },
    {
        "questionId": 21,
        "questionType": "MCQ",
        "answer": "A) Norway, Australia and Switzerland",
        "explanation": "According to the UN Human Development Report (2016), the top three countries in terms of human development are Norway, Australia, and Switzerland. The Human Development Index (HDI) measures various indicators, including life expectancy, education, and income, to assess the overall development and well-being of a country's population. These three countries consistently rank high in terms of human development, reflecting their strong social, economic, and educational systems that contribute to the overall quality of life for their citizens."
    },
    {
        "questionId": 22,
        "questionType": "statements",
        "answer": "A) (1), (2) and (3)",
        "explanation": "The recipients of the Rajiv Gandhi Khel Ratna Award for 2015-16 were P.V. Sindhu, Sakshi Malik, and Jitu Rai. These athletes were recognized for their exceptional performances and achievements in their respective sports during the given period. P.V. Sindhu is a renowned badminton player, Sakshi Malik is a prominent wrestler, and Jitu Rai is a skilled shooter. Their remarkable contributions to their sports earned them the prestigious Rajiv Gandhi Khel Ratna Award."
    },
    {
        "questionId": 23,
        "questionType": "MCQ",
        "answer": "B) Shankha Ghosh",
        "explanation": "The Jnanpith Award in 2016 was conferred upon Shankha Ghosh. Shankha Ghosh was a prominent poet and literary figure from West Bengal, India. He was recognized for his outstanding contributions to literature and poetry, particularly in the Bengali language. The Jnanpith Award is one of the most prestigious literary awards in India and is given in recognition of an author's exceptional literary achievements and influence. Shankha Ghosh's poetic brilliance and impact on the literary landscape earned him this esteemed honor."
    },
    {
        "questionId": 24,
        "questionType": "MCQ",
        "answer": "B) Alok Kumar Verma",
        "explanation": "Alok Kumar Verma was appointed as the Director of the Central Bureau of Investigation (CBI) in 2017. Alok Kumar Verma, an Indian Police Service (IPS) officer, assumed the position to lead the premier investigative agency in India. As the Director of CBI, Verma was responsible for overseeing and managing high-profile investigations and maintaining the integrity and efficiency of the organization. His appointment to this crucial role reflects his experience and expertise in the field of law enforcement and administration."
    },
    {
        "questionId": 25,
        "questionType": "MCQ",
        "answer": "B) Foreign Secretary",
        "explanation": "Tehmina Janjua is the first woman in Pakistan's history to hold the office of Foreign Secretary. As Foreign Secretary, she served as the highest-ranking diplomat and head of the diplomatic service in Pakistan. Tehmina Janjua's appointment marked a significant milestone in the country, reflecting the growing recognition and empowerment of women in senior leadership positions within the Pakistani government and diplomatic corps."
    },
    {
        "questionId": 26,
        "questionType": "MCQ",
        "answer": "A) 5th September",
        "explanation": "Teacher's Day is celebrated on 5th September. It is a special day dedicated to honoring and appreciating the contributions of teachers in society. The date, 5th September, was chosen to commemorate the birth anniversary of Dr. Sarvepalli Radhakrishnan, a renowned philosopher, scholar, and India's second President. On this day, students express their gratitude towards their teachers and acknowledge their role in shaping their lives and imparting knowledge."
    },
    {
        "questionId": 27,
        "questionType": "statements",
        "answer": "B) (1) and (2)",
        "explanation": "The High Court has termed the rivers Ganga and Yamuna as 'living entities.' This legal recognition of rivers as living entities grants them certain rights and protections similar to those of a legal person. It aims to safeguard the ecological and environmental interests of these rivers and ensure their conservation. The rivers Godavari and Brahmaputra are not included in the list of rivers termed as 'living entities' by the High Court."
    },
    {
        "questionId": 28,
        "questionType": "MCQ",
        "answer": "A) 68.3 years",
        "explanation": "In India, the life expectancy is approximately 68.3 years. Life expectancy refers to the average number of years a person is expected to live, and it is influenced by various factors such as healthcare, sanitation, nutrition, lifestyle, and socio-economic conditions. The life expectancy in India has been steadily increasing over the years due to advancements in healthcare and improvements in living conditions. However, it can vary across different regions and demographic groups within the country."
    },
    {
        "questionId": 29,
        "questionType": "MCQ",
        "answer": "C) Uttarakhand",
        "explanation": "The district to which two Chief Ministers of Northern States (2017) belong falls in the state of Uttarakhand. Uttarakhand is a state in northern India and is known for its picturesque landscapes and hill stations. The district mentioned in the question is not specified, but since Uttarakhand is mentioned as the state, it can be inferred that the district belongs to Uttarakhand. Uttarakhand has seen the appointment of two Chief Ministers from different districts within the state."
    },
    {
        "questionId": 30,
        "questionType": "MCQ",
        "answer": "A) Calcutta High Court",
        "explanation": "The Supreme Court issued a contempt notice to a sitting High Court Judge of the Calcutta High Court. The notice indicates that the Supreme Court found the actions or statements of the Judge to be in violation of its authority or undermining the administration of justice. Contempt of court refers to any act that disrespects or obstructs the functioning of the court or undermines its authority. In this case, the notice was specifically directed towards a Judge from the Calcutta High Court."
    },
    {
        "questionId": 31,
        "questionType": "MCQ",
        "answer": "A) Madhya Pradesh and Uttar Pradesh",
        "explanation": "The Kol tribe is primarily found in the states of Madhya Pradesh and Uttar Pradesh. The Kol tribe is one of the indigenous tribal communities of India and has a significant presence in these two states. They have their distinct language, customs, and traditions. The Kol tribe is known for their agricultural practices, as well as their unique cultural heritage. While they are primarily concentrated in Madhya Pradesh and Uttar Pradesh, they may also have smaller populations or scattered settlements in other regions."
    },
    {
        "questionId": 32,
        "questionType": "MCQ",
        "answer": "B) Dr. Vijay Bhatkar",
        "explanation": "Dr. Vijay Bhatkar is the Chancellor of Nalanda University as of 2017. Dr. Vijay Bhatkar is an eminent scientist and technologist from India, known for his contributions to the field of supercomputing and information technology. As the Chancellor of Nalanda University, he plays a significant role in guiding and overseeing the operations of the university. Nalanda University is an international research institution located in Bihar, India, and focuses on interdisciplinary studies in various fields of knowledge."
    },
    {
        "questionId": 33,
        "questionType": "MCQ",
        "answer": "C) 2013",
        "explanation": "The NOTA (None of the Above) option was first introduced and used in the elections in 2013. NOTA provides voters with the choice to reject all the candidates contesting in an election if they find none of them suitable for their vote. It allows voters to express their dissatisfaction with the available options. The introduction of NOTA was a significant step towards promoting transparency, fairness, and inclusivity in the electoral process, giving voters the right to register their protest against unsatisfactory candidates."
    },
    {
        "questionId": 34,
        "questionType": "statements",
        "answer": "D) (2),(3) and (4)",
        "explanation": "In 2017, Sadguru Jaggi Vasudev, Sharad Pawar, and Sunder Lal Patwa were conferred with the Padma Vibhushan Awards. The Padma Vibhushan is the second-highest civilian award in India, recognizing exceptional and distinguished service in various fields. Sadguru Jaggi Vasudev is a spiritual leader, Sharad Pawar is a prominent politician, and Sunder Lal Patwa was a veteran politician and former Chief Minister of Madhya Pradesh. These individuals were honored for their significant contributions and achievements in their respective domains."
    },
    {
        "questionId": 35,
        "questionType": "MCQ",
        "answer": "D) Uttar Pradesh",
        "explanation": "In 2017, the Chief Minister and Deputy Chief Minister(s) of Uttar Pradesh were not members of the State Legislative Assembly at the time of their appointments. This means that they were not elected as Members of the Legislative Assembly (MLAs) but were appointed to their positions. The other states mentioned in the options, Punjab, Goa, and Uttarakhand, had Chief Ministers and Deputy Chief Ministers who were members of their respective State Legislative Assemblies at the time of their appointments."
    },
    {
        "questionId": 36,
        "questionType": "MCQ",
        "answer": "D) Bengaluru",
        "explanation": "The city known as the 'Silicon Valley of India' is Bengaluru. Bengaluru, the capital city of Karnataka, is renowned for its thriving information technology (IT) industry. It is home to numerous multinational IT companies and startups, making it a major hub for technological innovation and development. The city's growth in the IT sector has earned it the nickname 'Silicon Valley of India', drawing parallels with the original Silicon Valley in California, USA. Bengaluru's technological advancements and contributions have positioned it as a prominent center for IT and innovation in India."
    },
    {
        "questionId": 37,
        "questionType": "MCQ",
        "answer": "A) The 45th USA President",
        "explanation": "Donald Trump served as the 45th President of the United States. He was inaugurated on January 20, 2017, and served until January 20, 2021. Donald Trump, a businessman and television personality, won the presidential election in 2016 as the Republican candidate. During his presidency, he implemented various policies and initiatives across different areas such as immigration, trade, foreign relations, and healthcare. Donald Trump's presidency was marked by controversy and polarizing opinions, shaping the political landscape of the United States during his tenure."
    },
    {
        "questionId": 38,
        "questionType": "MCQ",
        "answer": "B) Peace",
        "explanation": "Juan Manuel Santos was awarded the 2016 Nobel Prize in Peace. Santos is a Colombian politician who served as the President of Colombia from 2010 to 2018. He was awarded the Nobel Peace Prize for his efforts to bring an end to the long-lasting armed conflict in Colombia. Santos played a key role in negotiating a peace agreement with the Revolutionary Armed Forces of Colombia (FARC), a guerrilla group involved in the conflict. The Nobel Committee recognized his contributions to the peace process and his efforts to promote reconciliation and stability in Colombia."
    },
    {
        "questionId": 39,
        "questionType": "MCQ",
        "answer": "B) Portugal",
        "explanation": "Antonio Guterres, the UN Secretary General, belongs to Portugal. He was born in Lisbon, Portugal, in 1949. Guterres has had a distinguished career in politics and public service in Portugal before assuming the position of UN Secretary General in 2017. Prior to his appointment, he served as the Prime Minister of Portugal from 1995 to 2002 and also held other important positions within the Portuguese government. As the UN Secretary General, Guterres is responsible for leading the United Nations and addressing various global issues."
    },
    {
        "questionId": 40,
        "questionType": "MCQ",
        "answer": "A) Venezuela",
        "explanation": "The Margarita Island, which was the venue of the 17th NAM (Non-Aligned Movement) Summit, is owned by Venezuela. Margarita Island is located in the Caribbean Sea and is part of the Nueva Esparta state of Venezuela. The NAM Summit is a gathering of member countries that are not formally aligned with any major power bloc. The 17th NAM Summit was held in 2016, and Venezuela, as the host country, provided the venue for the event on Margarita Island."
    },
    {
        "questionId": 41,
        "questionType": "MCQ",
        "answer": "B) The adopted son of Peshwa Baji Rao 2nd",
        "explanation": "Nana Saheb, who fought against the English during the Indian Mutiny of 1857, was the adopted son of Peshwa Baji Rao 2nd. He was born as Dhondu Pant and later adopted by Baji Rao 2nd, the Peshwa of the Maratha Empire. Nana Saheb played a significant role in the rebellion and was one of the prominent leaders during that period. His leadership and actions had a significant impact on the uprising against British rule in India."
    },
    {
        "questionId": 42,
        "questionType": "MCQ",
        "answer": "D) W.C. Bannerji",
        "explanation": "The first session of the Indian National Congress was presided over by W.C. Bannerji. The session took place in Bombay (now Mumbai) in December 1885. W.C. Bannerji was a prominent lawyer and political leader who played a significant role in the early years of the Indian National Congress. He presided over the session and set the tone for the Congress's future role in India's freedom struggle."
    },
    {
        "questionId": 43,
        "questionType": "MCQ",
        "answer": "A) The Theosophical Society",
        "explanation": "The Theosophical Society, founded by Helena Blavatsky and Henry Steel Olcott in 1875, was a Socio-Religious Movement of the 19th-20th century that adopted the practices of occult mysticism. The society aimed to explore and promote spiritual and mystical teachings from various traditions and believed in the existence of hidden spiritual knowledge accessible to humans. It attracted followers who were interested in esoteric philosophies and mystical experiences. The Theosophical Society played a significant role in popularizing occult practices and contributing to the growth of the New Age movement."
    },
    {
        "questionId": 44,
        "questionType": "MCQ",
        "answer": "C) Aurobindo Ghosh",
        "explanation": "Aurobindo Ghosh was not a Moderate leader of the Indian National Congress. The Moderates were a faction within the Congress during the early phase of the Indian independence movement, advocating for gradual reforms and a peaceful approach. Gopal Krishna Gokhale, M.G. Ranade, and Surendra Nath Banerji were prominent Moderate leaders who played significant roles in shaping the Congress and advocating for political and social reforms. Aurobindo Ghosh, on the other hand, was associated with the extremist faction and later became a spiritual leader and philosopher."
    },
    {
        "questionId": 45,
        "questionType": "MCQ",
        "answer": "D) Karachi(1907)",
        "explanation": "The first session of the Muslim League was held in Karachi in 1907. It marked the establishment of the party and aimed to represent the interests of the Muslim community in British India. The session was attended by prominent Muslim leaders and led to the formation of the Muslim League as a political force advocating for the rights of Muslims. This event holds historical significance in the context of the struggle for independence and the eventual creation of Pakistan."
    },
    {
        "questionId": 46,
        "questionType": "MCQ",
        "answer": "A) Madan Lal Dhingra",
        "explanation": "Curzon Wyllie was shot dead by Madan Lal Dhingra. Dhingra was an Indian revolutionary and a member of the Indian independence movement. He assassinated Curzon Wyllie, a British official, in London in 1909. Dhingra's action was a response to British colonial rule and oppression in India. His act of assassination had a significant impact on the Indian nationalist movement and fueled further calls for independence."
    },
    {
        "questionId": 47,
        "questionType": "MCQ",
        "answer": "B) August 20, 1917",
        "explanation": "The Montague Declaration was made on August 20, 1917. It was a statement by Edwin Montague, the Secretary of State for India, outlining the British government's intention to introduce responsible government in stages for India. The declaration expressed the aim of gradually increasing self-governance and Indian participation in the governance of their own country. It was a significant step towards granting greater autonomy and political rights to the Indian people during the colonial period."
    },
    {
        "questionId": 48,
        "questionType": "MCQ",
        "answer": "C) Tashkent",
        "explanation": "The Communist Party of India was founded in Tashkent, which was then a part of Soviet Central Asia, in 1920. The founding congress of the party took place in Tashkent and marked the formal establishment of the Communist Party in India. Tashkent was chosen as the location due to its proximity to the revolutionary movement in British India and the presence of Indian political activists in the region. The establishment of the Communist Party of India had a significant impact on the political landscape of India and played a crucial role in the country's independence movement."
    },
    {
        "questionId": 49,
        "questionType": "MCQ",
        "answer": "B) April",
        "explanation": "The 100th anniversary of Gandhi's arrival in Champaran was marked in the month of April 2017. Mahatma Gandhi arrived in Champaran, Bihar, in April 1917 to investigate the grievances of the local farmers who were forced to cultivate indigo under oppressive conditions. This event played a significant role in shaping Gandhi's philosophy of nonviolent resistance and his leadership in India's freedom struggle. The centenary of this important milestone in Gandhi's life and the history of India was commemorated in April 2017."
    },
    {
        "questionId": 50,
        "questionType": "MCQ",
        "answer": "D) The Bardoli Satyagraha",
        "explanation": "The event that earned Vallabhbhai Patel the title of 'Sardar' was the Bardoli Satyagraha. The Bardoli Satyagraha was a nonviolent protest organized by Vallabhbhai Patel in 1928 against the unfair taxation policies imposed by the British in the Bardoli region of Gujarat, India. Patel's leadership and his ability to unite the farmers and lead a successful resistance movement earned him the title 'Sardar', which means 'leader' or 'chief' in Hindi. This event showcased Patel's strong leadership skills and his commitment to the welfare of the people."
    },
    {
        "questionId": 51,
        "questionType": "MCQ",
        "answer": "B) Depositional landforms in the Karst region",
        "explanation": "Stalactites and stalagmites are depositional landforms in the Karst region. They are formed in caves or caverns through the process of mineral deposition. Stalactites are icicle-shaped formations that hang from the ceiling of a cave, while stalagmites are cone-shaped formations that rise from the floor. These formations are created when mineral-rich water drips from the ceiling and leaves behind deposits of minerals, such as calcite. Over time, these deposits build up and form the characteristic structures. Stalactites and stalagmites are commonly found in limestone caves and are a result of the dissolution and precipitation processes in the Karst landscape."
    },
    {
        "questionId": 52,
        "questionType": "MCQ",
        "answer": "A) Cerrado",
        "explanation": "The savanna region of Brazil is locally called Cerrado. The Cerrado is a vast tropical savanna ecoregion in Brazil, characterized by a mix of grasslands, shrublands, and forests. It is the largest savanna region in South America and one of the most biodiverse savannas in the world. The Cerrado is known for its rich biodiversity, with numerous plant and animal species found in this region. It plays a vital role in maintaining water resources and supporting agriculture in Brazil. The Cerrado is an important ecological and cultural heritage of Brazil."
    },
    {
        "questionId": 53,
        "questionType": "MCQ",
        "answer": "D) J.A. Steers",
        "explanation": "The author of the book “The Unstable Earth” is J.A. Steers. The book explores the concept of Earth's dynamic and ever-changing nature, focusing on geological processes and phenomena that shape our planet. It delves into topics such as plate tectonics, earthquakes, volcanic activity, and other geological hazards. J.A. Steers provides insights into the complex interactions that occur within the Earth's systems, shedding light on the forces that contribute to its instability. The book offers a comprehensive understanding of Earth's geological processes and their significance in shaping the planet we inhabit."
    },
    {
        "questionId": 54,
        "questionType": "MCQ",
        "answer": "A) Jamuna",
        "explanation": "After joining the Tista River, the Brahmaputra River is known as the Jamuna River. The Brahmaputra River originates in the Himalayas and flows through Tibet, India, and Bangladesh. Upon reaching Bangladesh, it merges with the Tista River and continues its journey as the Jamuna River. The Jamuna River is a major tributary of the Ganges River and plays a significant role in the water resources and transportation system of Bangladesh. It is an important river in the region, supporting agriculture, fishing, and other economic activities."
    },
    {
        "questionId": 55,
        "questionType": "MCQ",
        "answer": "B) 30’N; 30’S Latitude",
        "explanation": "Coral reefs are primarily found between the latitudes of 30°N and 30°S. These regions, known as the tropics or the tropical zone, encompass the equator and extend approximately 30 degrees north and south of it. Within this range, the warm waters and favorable environmental conditions support the growth of coral reefs. Coral reefs are diverse marine ecosystems that are formed by the accumulation of coral polyps and the calcium carbonate skeletons they secrete. They provide habitats for a wide variety of marine organisms and are vital for the health and biodiversity of the oceans."
    },
    {
        "questionId": 56,
        "questionType": "statements",
        "answer": "A) (1), (2) and (4)",
        "explanation": "The answer is option A) (1), (2) and (4). The Green Revolution, which aimed to increase agricultural productivity through the adoption of modern farming techniques, had some fallouts. Statement 1 is correct as the Green Revolution was more successful in increasing wheat production compared to pulses. Statement 2 is correct as it led to inter-state disparities, with some states benefiting more than others. Statement 3 is incorrect as the Green Revolution focused more on high-yielding varieties of crops and did not prioritize soil fertility restoration. Statement 4 is correct as the intensive use of water for irrigation in the Green Revolution led to a decline in water tables in some states."
    },
    {
        "questionId": 57,
        "questionType": "MCQ",
        "answer": "C) Pacific Ocean",
        "explanation": "The answer is option C) Pacific Ocean. The Mindanao Trench is located in the Pacific Ocean. It is a deep underwater trench that runs along the eastern coast of the island of Mindanao in the Philippines. It is one of the deepest trenches in the world, reaching depths of over 7,000 meters. The trench is formed as a result of the tectonic plate movements in the region. It is known for its seismic activity and is part of the Pacific Ring of Fire."
    },
    {
        "questionId": 58,
        "questionType": "list",
        "answer": "B) (a-2) (b-1) (c-4) (d-3)",
        "explanation": "The correct match between List1 (Mines) and List2 (Minerals) is: \na. Kimberley - (2) Diamond \nb. Wankie - (1) Coal \nc. Witwatersrand - (4) Gold \nd. Katanga - (3) Copper. \nTherefore, the correct answer is option B) (a-2) (b-1) (c-4) (d-3)."
    },
    {
        "questionId": 59,
        "questionType": "list",
        "answer": "D) (a-ii) (b-iv) (c-iii) (d-i)",
        "explanation": "The correct match between List I and List II is as follows:\na. Carl Saur - (ii) Cultural geography\nb. David Harvey - (iv) Radical Geography\nc. F. Ratzel - (iii) Political Geography\nd. D H.J. Johnston - (i) Social Geography\nTherefore, the correct answer is option D) (a-ii) (b-iv) (c-iii) (d-i)."
    },
    {
        "questionId": 60,
        "questionType": "MCQ",
        "answer": "A) Commuters Zone",
        "explanation": "In the \"Concentric Zone Model \" proposed by Ernest Burgess, the fifth ring is known as the \"Commuters Zone \". This zone is located on the outskirts of the city and is primarily occupied by people who commute to the central business district (CBD) for work. It is characterized by residential areas with lower densities and a higher proportion of single-family homes. The Commuters Zone represents the outermost ring of the urban area in this model."
    },
    {
        "questionId": 61,
        "questionType": "MCQ",
        "answer": "A) Schedule-X",
        "explanation": "The provisions for the disqualification of a legislator on grounds of defection are contained in Schedule-X of the Constitution of India. Schedule-X, also known as the Tenth Schedule, was added to the Constitution in 1985. It specifies the conditions and procedures for disqualification of members of Parliament and State Legislatures who defect from their political parties. These provisions aim to prevent political defections and promote stability in the functioning of the legislative bodies."
    },
    {
        "questionId": 62,
        "questionType": "MCQ",
        "answer": "B) Procedure established by Law",
        "explanation": "The power of Judicial Review, provided in the constitution, is exercised on the basis of the principle of 'Procedure established by Law'. This principle emphasizes that the actions of the government and its agencies must follow the procedures prescribed by law. Judicial Review allows the judiciary to examine the constitutionality and legality of laws, executive actions, and governmental decisions. By applying the principle of Procedure established by Law, the judiciary ensures that the government's actions are carried out in accordance with the prescribed legal procedures and safeguards the rights and liberties of individuals."
    },
    {
        "questionId": 63,
        "questionType": "MCQ",
        "answer": "B) Speaker of Lok Sabha",
        "explanation": "The Speaker of Lok Sabha presides over the joint sitting of the Parliament. A joint sitting is called when there is a disagreement between the two houses of Parliament on a particular bill. The Speaker, as the presiding officer of Lok Sabha, assumes the role of the chairperson for the joint sitting. The joint sitting provides an opportunity for both houses to deliberate and vote on the bill, and the decision is taken based on a majority of the members present and voting. The Speaker ensures the smooth conduct of the joint sitting and maintains order during the proceedings."
    },
    {
        "questionId": 64,
        "questionType": "MCQ",
        "answer": "C) Article 120(1)",
        "explanation": "Under Article 120(1) of the Indian Constitution, the Speaker of the House has the power to allow any member of the House to speak in his/her mother language. This provision recognizes the linguistic diversity of India and ensures that members are able to express themselves in the language they are most comfortable with. It promotes inclusivity and facilitates effective communication within the legislative body. The Speaker exercises this power to promote democratic participation and ensure that all voices are heard in the proceedings of the House."
    },
    {
        "questionId": 65,
        "questionType": "MCQ",
        "answer": "A) Reservation for OBC",
        "explanation": "The Supreme Court's judgement in Indira Sawhney vs. Union of India is related to the issue of reservation for Other Backward Classes (OBC). The case involved the implementation of a reservation policy in public employment and admissions to educational institutions. The Supreme Court examined the constitutional validity of providing reservations based on social and educational backwardness. The judgement laid down certain guidelines and restrictions on the reservation policy to ensure its proper implementation and prevent its misuse. It had significant implications for the reservation system in India."
    },
    {
        "questionId": 66,
        "questionType": "MCQ",
        "answer": "D) Consolidated fund of India.",
        "explanation": "The provision for Grant-in-Aid under Article 243H for the Panchayats is made out of the taxes collected by the Union Government. As per Article 243H of the Indian Constitution, the Union Government provides financial assistance to the Panchayats in the form of grants-in-aid. These funds are sourced from the Consolidated Fund of India, which consists of the revenues collected by the Union Government through various sources such as taxes. The grants-in-aid are allocated to the Panchayats to support their functioning, development projects, and implementation of government schemes at the local level."
    },
    {
        "questionId": 67,
        "questionType": "MCQ",
        "answer": "A) Sovereign, Socialist, Secular, Democratic, Republic",
        "explanation": "The correct sequencing of the features of the Preamble of the Indian Constitution is as follows: Sovereign, Socialist, Secular, Democratic, Republic. The Preamble declares India as a Sovereign nation, which means it is independent and free from external control. It also emphasizes the socialist nature of the country, highlighting the commitment to social and economic equality. The term 'Secular' indicates the principle of religious neutrality and equal treatment of all religions. 'Democratic' signifies the system of government by the people, and 'Republic' signifies the head of the state being elected by the people. Therefore, the correct sequence is A) Sovereign, Socialist, Secular, Democratic, Republic."
    },
    {
        "questionId": 68,
        "questionType": "list",
        "answer": "C) (a-iii) (b-iv) (c-i) (d-ii)",
        "explanation": "The correct matching of the articles and their corresponding provisions is as follows: (a-iii) Article 15 corresponds to the Prohibition of Discrimination, (b-iv) Article 20 corresponds to Protection against conviction, (c-i) Article 25 corresponds to Freedom of Religion, and (d-ii) Article 32 corresponds to Constitutional Remedies. Therefore, the correct sequence is C) (a-iii) (b-iv) (c-i) (d-ii)."
    },
    {
        "questionId": 69,
        "questionType": "MCQ",
        "answer": "C) Financial emergency has never been imposed in India",
        "explanation": "The correct statement is C) Financial emergency has never been imposed in India. The Indian Constitution provides for three types of emergencies: National Emergency, State Emergency (President's Rule), and Financial Emergency. However, since the inception of the Constitution, a financial emergency has never been imposed in India. Financial emergency is described under Article 360 of the Constitution, but it has not been invoked so far."
    },
    {
        "questionId": 70,
        "questionType": "MCQ",
        "answer": "A) Ujjawala Yojana",
        "explanation": "The correct answer is A) Ujjawala Yojana. Ujjawala Yojana is a policy of the Government of India aimed at providing clean cooking fuel to below poverty line (BPL) households. It was launched in 2016 with the objective of replacing traditional cooking fuels such as firewood and coal with LPG (liquefied petroleum gas) cylinders. The scheme provides financial assistance to eligible households to help them access LPG connections and promote clean and efficient cooking practices."
    },
    {
        "questionId": 71,
        "questionType": "MCQ",
        "answer": "C) It deals with the financial relations between States and Centre",
        "explanation": "The correct answer is C) It deals with the financial relations between States and Centre. The Finance Commission of India is a constitutional body established under Article 280 of the Indian Constitution. Its primary responsibility is to make recommendations regarding the distribution of financial resources between the central government and the state governments. It reviews the financial position of the states and recommends the principles governing the grants-in-aid to the states from the Consolidated Fund of India. The Finance Commission plays a crucial role in ensuring a fair and balanced fiscal federalism in the country."
    },
    {
        "questionId": 72,
        "questionType": "MCQ",
        "answer": "A) Rs. 45,000 Cr",
        "explanation": "The correct answer is A) Rs. 45,000 Cr. In the Budget for 2017-18, the funds allocated for the Mahatma Gandhi National Rural Employment Guarantee Act (MGNREGA) was Rs. 45,000 crore. MGNREGA is a social welfare scheme aimed at providing employment opportunities to rural households and ensuring livelihood security. The allocation of funds for MGNREGA reflects the government's commitment to rural development and poverty alleviation."
    },
    {
        "questionId": 73,
        "questionType": "MCQ",
        "answer": "B) 89.53 and 75.93",
        "explanation": "The correct answer is B) 89.53 and 75.93. As per Census 2011, the literacy rate in Himachal Pradesh for males is 89.53% and for females is 75.93%. The literacy rate represents the percentage of the population aged seven years and above who can read and write with understanding. Himachal Pradesh has made significant progress in literacy, with both male and female literacy rates above the national average."
    },
    {
        "questionId": 74,
        "questionType": "statements",
        "answer": "B) (i), (ii) and (iii) are correct",
        "explanation": "The Human Development Index (HDI) is a measure of a country's level of human development, comprising three dimensions: life expectancy at birth, expected and mean years of schooling, and gross national income per capita. Infant mortality and morbidity are not directly used in HDI calculations. While real GDP per capita is related, the specific measure used is gross national income per capita. Therefore, the accurate summary is that life expectancy at birth, expected and mean years of schooling, and gross national income per capita are the dimensions included in HDI calculations."
    },
    {
        "questionId": 75,
        "questionType": "MCQ",
        "answer": "C) NSSO",
        "explanation": "The correct answer is C) NSSO (National Sample Survey Office). The NSSO is responsible for conducting the periodical sample survey in India to estimate the poverty line. The survey collects data on various socio-economic indicators, including income and consumption patterns, to determine the poverty threshold and estimate the percentage of the population living below the poverty line. It plays a crucial role in providing data for policymaking and monitoring poverty alleviation programs in the country."
    },
    {
        "questionId": 76,
        "questionType": "MCQ",
        "answer": "A) 25 June, 2015 to improve basic Urban infrastructure in 500 cities",
        "explanation": "The correct answer is A) 25 June, 2015 to improve basic Urban infrastructure in 500 cities. AMRUT stands for Atal Mission for Rejuvenation and Urban Transformation. It was launched on 25 June, 2015 by the Government of India with the aim of providing basic urban infrastructure and services in 500 cities across the country. The mission focuses on areas such as water supply, sewerage, drainage, urban transport, and green spaces. It aims to improve the quality of life for urban residents and promote sustainable urban development."
    },
    {
        "questionId": 77,
        "questionType": "MCQ",
        "answer": "C) Odisha",
        "explanation": "The correct answer is C) Odisha. According to the latest data, Odisha has the highest poverty ratio among the given states of India. Poverty ratio refers to the percentage of the population living below the poverty line. Odisha faces various socio-economic challenges, including high poverty rates, inadequate access to basic amenities, and limited economic opportunities in certain regions. Efforts are being made by the government and other stakeholders to address these issues and uplift the living standards of the people in Odisha."
    },
    {
        "questionId": 78,
        "questionType": "MCQ",
        "answer": "C) Total allocation for rural, agriculture and allied sector is Rs. 80,000 crore",
        "explanation": "The correct answer is C) Total allocation for rural, agriculture and allied sector is Rs. 80,000 crore. This statement is not correct. In the Budget proposals for 2017-18, the total allocation for rural, agriculture, and allied sectors was not specified as Rs. 80,000 crore. The budgetary allocations for these sectors may vary from year to year based on various factors and priorities of the government. It is important to refer to the specific budget documents or announcements to obtain accurate information about the allocations for different sectors in a particular fiscal year."
    },
    {
        "questionId": 79,
        "questionType": "MCQ",
        "answer": "B) 7.2 percent",
        "explanation": "The correct answer is B) 7.2 percent. The growth rate of Himachal Pradesh during the 12th Plan (2012-17) was estimated to be 7.2 percent. The 12th Plan period witnessed significant development and progress in various sectors of the state's economy, leading to this positive growth rate. It reflects the overall economic performance and advancement of Himachal Pradesh during that particular plan period. The growth rate indicates the rate of increase in the Gross State Domestic Product (GSDP) and is an important indicator of the economic health and development of a region."
    },
    {
        "questionId": 80,
        "questionType": "MCQ",
        "answer": "C) 5.0 percent",
        "explanation": "The correct answer is C) 5.0 percent. The unemployment rate during 2015-16 based on the Usual Principal Status in India was 5.0 percent. This rate represents the percentage of the labor force that was unemployed during that period. It is an important indicator of the job market conditions and the availability of employment opportunities in the country. A lower unemployment rate generally indicates a healthier job market with more people employed, while a higher rate suggests a higher level of unemployment and potential economic challenges."
    },
    {
        "questionId": 81,
        "questionType": "MCQ",
        "answer": "C) 26",
        "explanation": "The correct answer is C) 26. The number of wetlands in India listed under the Ramsar Convention is 26. The Ramsar Convention is an international treaty for the conservation and sustainable use of wetlands. India has designated several wetlands of international importance as Ramsar sites to protect their ecological significance and promote their conservation. These sites play a crucial role in maintaining biodiversity, supporting migratory bird populations, and providing various ecosystem services."
    },
    {
        "questionId": 82,
        "questionType": "MCQ",
        "answer": "B) 2006",
        "explanation": "The correct answer is B) 2006. India ratified the Stockholm Convention on Persistent Organic Pollutants (POPs) in 2006. The Stockholm Convention is a global treaty aimed at protecting human health and the environment from highly toxic chemicals that persist in the environment, bioaccumulate in living organisms, and pose significant risks. By ratifying the convention, India committed to taking measures to eliminate or reduce the production, use, and release of POPs in the country."
    },
    {
        "questionId": 83,
        "questionType": "MCQ",
        "answer": "B) Ecosystem services",
        "explanation": "The correct answer is B) Ecosystem services. Environmental degradation leads to the loss of various ecosystem services, which are the benefits that humans derive from ecosystems. Ecosystem services include the provision of clean air and water, pollination of crops, regulation of climate, nutrient cycling, and many others. When ecosystems are degraded, these services are compromised, resulting in negative impacts on human well-being and the overall functioning of ecosystems. Protecting and restoring ecosystem services is crucial for sustainable development and the preservation of human health and the environment."
    },
    {
        "questionId": 84,
        "questionType": "MCQ",
        "answer": "A) Sustainable tourism for development",
        "explanation": "The correct answer is A) Sustainable tourism for development. In 2017, the United Nations declared it as the International Year of Sustainable Tourism for Development. The aim of this initiative was to raise awareness about the importance of sustainable tourism and its potential to contribute to economic growth, social inclusiveness, cultural preservation, and environmental sustainability. It aimed to promote tourism practices that minimize negative impacts on the environment and local communities while maximizing the positive contributions of tourism to sustainable development."
    },
    {
        "questionId": 85,
        "questionType": "MCQ",
        "answer": "A) Basel Convention",
        "explanation": "The correct answer is A) Basel Convention. The Basel Convention is a global agreement that aims to control the transboundary movements of hazardous wastes and their disposal. It was adopted in 1989 and has been ratified by many countries worldwide. The convention sets out guidelines and procedures for the environmentally sound management of hazardous wastes, including their minimization, generation, transboundary movement, and disposal. The objective is to protect human health and the environment from the adverse effects of hazardous waste management and disposal."
    },
    {
        "questionId": 86,
        "questionType": "MCQ",
        "answer": "A) Sugarcane",
        "explanation": "The correct answer is A) Sugarcane. Sugarcane is considered one of the most promising biodiesel crops. It is rich in sucrose, which can be converted into ethanol through fermentation and further processed into biodiesel. Sugarcane biodiesel has shown potential as a renewable and sustainable alternative to fossil fuels. Its cultivation for biodiesel production offers several advantages, including high yield, fast growth rate, and the ability to thrive in tropical and subtropical regions. Additionally, sugarcane-based biodiesel has a lower environmental impact compared to traditional fossil fuels."
    },
    {
        "questionId": 87,
        "questionType": "MCQ",
        "answer": "B) Secondary treatment",
        "explanation": "The correct answer is B) Secondary treatment. The biological oxygen demand (BOD) of water refers to the amount of dissolved oxygen consumed by microorganisms during the decomposition of organic matter. Secondary treatment is a wastewater treatment process that focuses on removing organic pollutants through biological processes. This process involves the use of microorganisms to break down organic substances, which reduces the BOD of the water. Secondary treatment is typically more advanced than primary treatment and plays a crucial role in improving water quality and reducing the environmental impact of wastewater discharge."
    },
    {
        "questionId": 88,
        "questionType": "MCQ",
        "answer": "D) All of the above",
        "explanation": "The correct answer is D) All of the above. Dead zones in the world's oceans and large lakes are areas where the dissolved oxygen levels are extremely low or depleted, leading to hypoxic or anoxic conditions. This is primarily caused by high biological oxygen demand, which is the result of excessive blooms of algae. These blooms occur due to the excess nutrients like nitrates and phosphates present in the water, often from agricultural runoff or sewage discharge. The excessive growth of algae consumes the available oxygen, leading to the formation of dead zones. Therefore, dead zones are characterized by all the mentioned factors."
    },
    {
        "questionId": 89,
        "questionType": "MCQ",
        "answer": "C) Sweden",
        "explanation": "The correct answer is C) Sweden. Sweden has been successful in reducing emissions of greenhouse gases by implementing the use of carbon tax. A carbon tax is a financial levy imposed on the carbon content of fossil fuels. It is designed to incentivize companies and individuals to reduce their carbon emissions by making it more costly to emit greenhouse gases. Sweden has implemented a carbon tax policy that has effectively reduced emissions and encouraged the transition to cleaner and more sustainable energy sources. The success of Sweden's carbon tax model has been recognized globally as an effective tool in mitigating climate change."
    },
    {
        "questionId": 90,
        "questionType": "MCQ",
        "answer": "B) Conservation of swamp deer from near extinction",
        "explanation": "One of the better achievements of Kanha National Park is the conservation of swamp deer from near extinction. The park has played a crucial role in protecting and increasing the population of swamp deer, also known as barasingha. These deer were once on the brink of extinction due to habitat loss and poaching, but through dedicated conservation efforts, their numbers have been revived. Kanha National Park's success in safeguarding the swamp deer population contributes to the preservation of biodiversity and the overall health of the ecosystem."
    },
    {
        "questionId": 91,
        "questionType": "MCQ",
        "answer": "B) Nitrogen",
        "explanation": "The correct answer is B) Nitrogen. Chip manufacturers seal the packet in the presence of nitrogen to prevent oxidation of potato chips during storage. Nitrogen is an inert gas that displaces oxygen, reducing the oxygen concentration inside the packet. This helps to maintain the freshness and crispiness of the chips by minimizing the oxidation process, which can lead to the degradation of quality and the development of off-flavors. By creating a nitrogen-rich environment, the chip manufacturers can extend the shelf life of the chips and ensure that they remain crispy and delicious."
    },
    {
        "questionId": 92,
        "questionType": "MCQ",
        "answer": "A) A lichen",
        "explanation": "The correct answer is A) A lichen. Litmus dye is extracted from a lichen, which is a composite organism consisting of a fungus and an alga or cyanobacterium living in a mutualistic relationship. Lichens are known for their ability to produce natural dyes, and litmus dye is one such pigment. Litmus dye is commonly used as a pH indicator, changing color depending on whether a substance is acidic or basic. It is widely used in various applications, including laboratory testing, educational experiments, and industrial processes."
    },
    {
        "questionId": 93,
        "questionType": "MCQ",
        "answer": "C) Baking soda",
        "explanation": "The correct answer is C) Baking soda. When someone is suffering from the problem of acidity after overeating, one of the remedies is to consume baking soda. Baking soda, also known as sodium bicarbonate, acts as an antacid and helps neutralize the excess stomach acid that causes acidity. It can provide quick relief from symptoms such as heartburn and indigestion. However, it is important to use baking soda in moderation and under the guidance of a healthcare professional, as excessive consumption can have side effects. It is always advisable to consult a doctor for proper diagnosis and treatment of acidity-related issues."
    },
    {
        "questionId": 94,
        "questionType": "MCQ",
        "answer": "C) Milk of magnesia",
        "explanation": "The correct answer is C) Milk of magnesia. Milk of magnesia, which is a suspension of magnesium hydroxide in water, has a pH above 10. It is an alkaline solution and is commonly used as an antacid to neutralize excess stomach acid. The alkaline nature of milk of magnesia helps in reducing acidity and providing relief from symptoms such as heartburn and indigestion. It is important to note that gastric juice, blood, and sodium chloride solution do not have a pH above 10."
    },
    {
        "questionId": 95,
        "questionType": "MCQ",
        "answer": "D) Chlorophyll degradation",
        "explanation": "The correct answer is D) Chlorophyll degradation. Chlorophyll degradation is not a process that takes place during photosynthesis. Photosynthesis is the process by which green plants, algae, and some bacteria convert light energy into chemical energy in the form of glucose. The process involves the absorption of light energy by chlorophyll, the conversion of light energy to chemical energy through a series of reactions, and the splitting of water molecules into hydrogen and oxygen to release oxygen gas. Chlorophyll degradation occurs during leaf senescence or when plants undergo stress or aging, but it is not directly involved in the process of photosynthesis."
    },
    {
        "questionId": 96,
        "questionType": "MCQ",
        "answer": "D) Fathometer",
        "explanation": "The correct answer is D) Fathometer. A fathometer is an instrument used for measuring the depth of the ocean or other bodies of water. It works by emitting sound waves or pulses of ultrasound into the water and measuring the time it takes for the sound waves to bounce back after hitting the ocean floor. By knowing the speed of sound in water, the fathometer can calculate the depth based on the time taken for the sound waves to return. This instrument is commonly used in hydrographic surveys and oceanographic research."
    },
    {
        "questionId": 97,
        "questionType": "MCQ",
        "answer": "C) Astronomical distance",
        "explanation": "The correct answer is C) Astronomical distance. A light year is a unit of measurement used in astronomy to represent the distance that light travels in one year in a vacuum. Since light travels at a constant speed of approximately 299,792 kilometers per second, one light year is equivalent to about 9.461 trillion kilometers. It is used to express vast distances between celestial objects, such as stars, galaxies, and other astronomical phenomena. The term 'light year' emphasizes the concept that we are measuring the distance based on the time it takes for light to travel."
    },
    {
        "questionId": 98,
        "questionType": "MCQ",
        "answer": "B) Red, Green, Blue",
        "explanation": "The correct answer is B) Red, Green, Blue. Red, green, and blue are considered the primary colors in the additive color model, also known as the RGB color model. In this model, different combinations of red, green, and blue light are used to create a wide range of colors. By varying the intensity of each primary color, it is possible to produce all other colors in the visible spectrum. This concept is commonly used in devices such as computer monitors, televisions, and digital screens."
    },
    {
        "questionId": 99,
        "questionType": "MCQ",
        "answer": "B) Acetone",
        "explanation": "The correct answer is B) Acetone. Nail polish remover commonly contains acetone as the main ingredient. Acetone is a colorless liquid solvent that is effective in dissolving and removing nail polish. It is a volatile compound that evaporates quickly, allowing it to efficiently remove nail polish from the surface of the nails. Acetone is also used in various other applications, such as paint thinners and industrial solvents."
    },
    {
        "questionId": 100,
        "questionType": "MCQ",
        "answer": "D) Argon",
        "explanation": "The correct answer is D) Argon. Argon is the most abundant rare gas in the atmosphere, making up about 0.934% of the Earth's atmosphere. It is a colorless and odorless gas that is denser than air. Argon is chemically inert and does not react with other substances under normal conditions. It is widely used in various applications, such as filling incandescent light bulbs and as a shielding gas in welding."
    }
]