[
    {
        "questionId": 1,
        "questionType": "MCQ",
        "answer": "D) Wet Sub-Temperate",
        "explanation": "Physiographically, Palampur, Dharamshala, and Jogindernagar in Himachal Pradesh are situated in the Wet Sub-Temperate zone. This zone is characterized by high rainfall and cool temperatures throughout the year. The region experiences abundant moisture and is known for its dense vegetation and green landscapes. The wet sub-temperate climate supports the growth of diverse flora and fauna in these areas."
    },
    {
        "questionId": 2,
        "questionType": "MCQ",
        "answer": "D) Ani",
        "explanation": "Ani was not a princely state or Thakurai that was clubbed to form the Mahasu district in 1948. The princely states of Koti, Darkoti, and Ghund were merged to create the Mahasu district, but Ani was not included in this consolidation. Ani may have been a separate administrative unit or belonged to a different district during that time."
    },
    {
        "questionId": 3,
        "questionType": "MCQ",
        "answer": "B) Mandi",
        "explanation": "The Tibetan name 'Zahor' refers to the district of Mandi in Himachal Pradesh. Mandi is known for its rich cultural heritage and historical significance. It is located in the central part of Himachal Pradesh and is surrounded by scenic mountains and valleys. The name 'Zahor' is used in the Tibetan language to refer to this district."
    },
    {
        "questionId": 4,
        "questionType": "MCQ",
        "answer": "A) Gyephang",
        "explanation": "The snow-clad peak in Himachal Pradesh that is shaped somewhat like the Matterhorn in Switzerland is called Gyephang. Gyephang Peak is known for its striking resemblance to the iconic Matterhorn peak of Switzerland. It is a majestic mountain with a unique pyramid-like shape, making it a popular destination for mountaineering and trekking enthusiasts. The breathtaking beauty and resemblance to Matterhorn make Gyephang a notable landmark in the state of Himachal Pradesh."
    },
    {
        "questionId": 5,
        "questionType": "MCQ",
        "answer": "D) Swangla-Jhanjrara",
        "explanation": "The combination 'Swangla-Jhanjrara' is not correct. Swangla and Jhanjrara are not traditionally associated with each other in Himachal Pradesh. However, Pangwal-Doghri, Kinner or Kinnaura-Janekang, and Gaddi-Satta-Satta are correct combinations of communities or tribes that are found in different regions of Himachal Pradesh. Swangla and Jhanjrara may not have a direct cultural or historical association with each other in the context of Himachal Pradesh."
    },
    {
        "questionId": 6,
        "questionType": "list",
        "answer": "D) (a-i) (b-ii) (c-ii) (d-iV)",
        "explanation": "The correct matching of List-I and List-II is as follows: \\na. Kayang - Sirmaur \\nb. Jhanjar - Una \\nc. Keekli and Bangra - Chamba \\nd. Jhoori - Lahaul \\nThe traditional folk dances of Himachal Pradesh are associated with specific regions. Kayang is associated with Sirmaur, Jhanjar with Una, Keekli and Bangra with Chamba, and Jhoori with Lahaul. Therefore, the correct answer is option D) (a-i) (b-ii) (c-ii) (d-iV)."
    },
    {
        "questionId": 7,
        "questionType": "MCQ",
        "answer": "B) Pragpur",
        "explanation": "The first Lohri festival, after being declared as a state-level festival, was celebrated on 13th January 2010 in Pragpur. Pragpur is a heritage village located in the Kangra district of Himachal Pradesh. It is known for its traditional architecture and cultural significance. The celebration of Lohri in Pragpur marked the recognition of the festival at a state level, highlighting its importance and cultural significance in Himachal Pradesh."
    },
    {
        "questionId": 8,
        "questionType": "MCQ",
        "answer": "A) Baijnath",
        "explanation": "The temple believed to be constructed by two merchants 'Ahuka' and 'Manyuka' is Baijnath temple. The Baijnath temple is an ancient and significant temple located in the town of Baijnath in the Kangra district of Himachal Pradesh. It is dedicated to Lord Shiva and is renowned for its architectural beauty and historical importance. According to the legends, the temple was built by the two merchants, Ahuka and Manyuka, as an offering to Lord Shiva. The Baijnath temple stands as a testament to the rich cultural and religious heritage of Himachal Pradesh."
    },
    {
        "questionId": 9,
        "questionType": "MCQ",
        "answer": "B) Kardang Gompa",
        "explanation": "The largest collection of Kangyur and Tangyur is placed in the library of Kardang Gompa. Kardang Gompa is a famous Buddhist monastery located in the Lahaul and Spiti district of Himachal Pradesh. It is known for its historical and cultural significance. The monastery houses a vast collection of Buddhist scriptures, including Kangyur (translated words of Buddha) and Tangyur (commentaries by Indian and Tibetan scholars). The library of Kardang Gompa preserves and protects these sacred texts, making it the repository of the largest collection of Kangyur and Tangyur in the region."
    },
    {
        "questionId": 10,
        "questionType": "MCQ",
        "answer": "A) The Arki School of painting was founded by Raja Jagat Singh",
        "explanation": "The statement 'A) The Arki School of painting was founded by Raja Jagat Singh' is not correct. The Arki School of painting was actually founded by Raja Kishan Chand in the late 18th century, not Raja Jagat Singh. The Arki School of painting is known for its distinctive style and is characterized by the use of bold colors and intricate detailing. On the other hand, the Basholi School of painting did come into prominence from the time of Raja Kripal Pal, Kangra painting has indeed obtained a Geographical Indicator (GI) tag, and Chamba was indeed one of the principal centers of Pahari miniature paintings. Therefore, option A is the incorrect statement."
    },
    {
        "questionId": 11,
        "questionType": "MCQ",
        "answer": "D) Spiti Valley",
        "explanation": "In the Spiti Valley of Himachal Pradesh, the Himachal Pradesh Language, Art and Culture Academy founded a 600-year-old manuscript that deals with the Ayurvedic System of Medicine. Spiti Valley is a remote and picturesque valley located in the Lahaul and Spiti district of Himachal Pradesh. The manuscript found in Spiti Valley holds significant historical and cultural value as it provides insights into the ancient Ayurvedic practices followed in the region. The discovery highlights the rich cultural heritage and traditional knowledge preserved in the Spiti Valley."
    },
    {
        "questionId": 12,
        "questionType": "MCQ",
        "answer": "A) Fatehpur Fort: Bandla Dhar",
        "explanation": "The combination 'A) Fatehpur Fort: Bandla Dhar' is not correct. Fatehpur Fort is not located at Bandla Dhar. However, Tiun Fort is indeed located at Tiun Dhar, Devi Badoli Temple is associated with Jhanjiar Dhar, and Dagoga Malhot is connected to Kot Dhar. It is important to note that the correct combination of location and fort/temple is significant in understanding the historical and geographical context of Himachal Pradesh."
    },
    {
        "questionId": 13,
        "questionType": "MCQ",
        "answer": "C) Chakli",
        "explanation": "The only coin special to Chamba, where five of them make an 'anna', is the 'Chakli'. Chakli is a historical coin that was used in the region of Chamba, Himachal Pradesh. It had a specific value, and five Chakli coins were equivalent to one 'anna'. The Chakli coin holds significance in the monetary history of Chamba and provides insights into the economic transactions and currency systems of the region during that time."
    },
    {
        "questionId": 14,
        "questionType": "MCQ",
        "answer": "C) General Cunningham",
        "explanation": "The PAHAL Scheme, also known as the Pratyaksha Hastaantarit Laabh, is related to the direct transfer of LPG subsidy. It is a government initiative in India aimed at providing subsidies for LPG (cooking gas) cylinders directly to the bank accounts of consumers. By implementing this scheme, the government ensures that the subsidy reaches the intended beneficiaries, eliminates leakages, and reduces instances of fraud and misappropriation of funds. The PAHAL Scheme has played a crucial role in improving the efficiency and transparency of LPG subsidy distribution in the country."
    },
    {
        "questionId": 15,
        "questionType": "MCQ",
        "answer": "A) Brahmi",
        "explanation": "The script of the earliest rock inscription found at Pathiar and Kanihara is 'Brahmi'. Brahmi is one of the oldest known scripts used in ancient India. It was widely used for writing various Indian languages during the ancient and early medieval periods. The rock inscriptions found at Pathiar and Kanihara provide valuable historical and linguistic information, as they are written in the Brahmi script. These inscriptions help in understanding the ancient history and cultural developments in the region."
    },
    {
        "questionId": 16,
        "questionType": "MCQ",
        "answer": "B) Shoton/Shotou",
        "explanation": "The name of the opera festival annually held by the Tibetan Institute of Performing Arts (TIPA) at Mcleodganj and was an annual feature in Lhasa prior to 1959 is 'Shoton/Shotou'. Shoton/Shotou is a traditional Tibetan opera festival that celebrates Tibetan performing arts, including opera, music, and dance. It is a significant cultural event that showcases the rich artistic heritage of Tibet. The festival, now held in Mcleodganj, Himachal Pradesh, continues to promote and preserve Tibetan performing arts and serves as a platform for cultural exchange."
    },
    {
        "questionId": 17,
        "questionType": "MCQ",
        "answer": "A) Tidong Valley",
        "explanation": "The Tidong Valley is without exception the most rugged glen of Kinnaur district. Tidong Valley is known for its rugged and challenging terrain, characterized by steep slopes, deep gorges, and rocky cliffs. It is located in the Kinnaur district of Himachal Pradesh. The ruggedness of the Tidong Valley adds to its scenic beauty and makes it a destination for adventure enthusiasts and nature lovers. The valley offers breathtaking views and is a testament to the diverse and awe-inspiring landscapes found in the region."
    },
    {
        "questionId": 18,
        "questionType": "MCQ",
        "answer": "C) Upper House and Lower House of village khap of Malana",
        "explanation": "'Jeyeshthang' and 'Kanishthang' are the names given to the Upper House and Lower House of the village khap of Malana. Malana is a unique village located in the Kullu district of Himachal Pradesh. It has its own autonomous system of governance and social structure. The village khap of Malana consists of two houses, namely Jeyeshthang (Upper House) and Kanishthang (Lower House). These houses play important roles in decision-making and governance within the village. The names Jeyeshthang and Kanishthang reflect the hierarchical structure of the village khap."
    },
    {
        "questionId": 19,
        "questionType": "MCQ",
        "answer": "C) Netherlands",
        "explanation": "The country relegated to the second position by Lahaul-Spiti in achieving the highest per hectare production of potato is the Netherlands. Lahaul-Spiti, a district in Himachal Pradesh, has excelled in potato cultivation and achieved high productivity per hectare. The Netherlands, known for its advanced agricultural practices and expertise in potato cultivation, was surpassed by Lahaul-Spiti in terms of per hectare production. This achievement highlights the agricultural prowess of Lahaul-Spiti and its success in potato cultivation."
    },
    {
        "questionId": 20,
        "questionType": "MCQ",
        "answer": "B) Shimla",
        "explanation": "The first mention of the place 'Shimla' came in 1817 from the diary of the Scottish officer brothers. Shimla, now the capital city of Himachal Pradesh, was initially discovered by the British during the colonial era. The Scottish officer brothers, in their diary, mentioned Shimla as a picturesque location with pleasant weather. This mention marked the beginning of Shimla's journey as a popular hill station and eventually led to its development as the summer capital of British India. Today, Shimla is a prominent tourist destination known for its scenic beauty and colonial-era architecture."
    },
    {
        "questionId": 21,
        "questionType": "MCQ",
        "answer": "C) Beas",
        "explanation": "The climate change vulnerability assessment is being undertaken for the Beas river basin. This assessment covers 9258 villages across four districts and more than 1200 panchayats. The Beas river basin in Himachal Pradesh is an important water resource and plays a crucial role in the socio-economic development of the region. The vulnerability assessment aims to understand the potential impacts of climate change on the basin's ecosystems, water resources, and communities. It helps in identifying adaptation measures and developing strategies to mitigate the risks associated with climate change in the Beas river basin."
    },
    {
        "questionId": 22,
        "questionType": "MCQ",
        "answer": "B) Sarathi",
        "explanation": "The name of the web-based software implemented by the Department of Transport of Himachal Pradesh for issuing a Driving License is 'Sarathi'. Sarathi is a comprehensive online platform that enables citizens to apply for a driving license and manage related processes. It facilitates the online application, scheduling of tests, payment of fees, and issuance of driving licenses. The implementation of Sarathi has streamlined and modernized the process of obtaining a driving license in Himachal Pradesh, making it more convenient and efficient for the applicants."
    },
    {
        "questionId": 23,
        "questionType": "MCQ",
        "answer": "B) Dr. Jameson",
        "explanation": "The Superintendent of Botanical Garden who set up the 'Delhi Tea Estate' in 1852 was Dr. Jameson. Dr. Jameson, known for his expertise in botany and horticulture, played a significant role in the establishment of the tea estate in Delhi. The establishment of the Delhi Tea Estate marked an important milestone in the cultivation of tea in India. Dr. Jameson's efforts and contributions in the field of horticulture and tea cultivation have left a lasting impact on the development of the tea industry in the region."
    },
    {
        "questionId": 24,
        "questionType": "MCQ",
        "answer": "D) Kinnaur",
        "explanation": "After intensive research and the success of the project, the district of Kinnaur in Himachal Pradesh is likely to emerge as the pistachio bowl of the state. Kinnaur, known for its favorable climatic conditions and suitable soil quality, has shown great potential for pistachio cultivation. Through extensive research and efforts, pistachio farming techniques have been developed and implemented in Kinnaur, leading to successful cultivation. This has opened up new avenues for pistachio production in the region, positioning Kinnaur as a potential hub for pistachio cultivation in Himachal Pradesh."
    },
    {
        "questionId": 25,
        "questionType": "MCQ",
        "answer": "A) Gandwal in Una",
        "explanation": "The first 'Emu' breeding farm of Himachal Pradesh is set up by the multi-level marketing company 'Easy Way With' in Gandwal, Una. Gandwal in Una district has been chosen as the location for the breeding farm due to its favorable conditions for emu farming. Emus are large flightless birds native to Australia, and their farming has gained popularity in various parts of the world. The establishment of the Emu breeding farm in Gandwal signifies the growing interest in emu farming in Himachal Pradesh and the potential economic benefits associated with it."
    },
    {
        "questionId": 26,
        "questionType": "MCQ",
        "answer": "C) Francis Bunar and T. H. Walker",
        "explanation": "The two wildlife experts who were the main force behind setting up Himachal's first 'Bird Ringing Station' at Salropa were Francis Bunar and T. H. Walker. They played a crucial role in establishing the bird ringing station, which is a facility used for scientific bird banding and studying bird migration patterns. The station at Salropa serves as a valuable research center for studying avian species and their movements in Himachal Pradesh. The efforts of Francis Bunar and T. H. Walker have contributed significantly to the field of avian research and conservation in the region."
    },
    {
        "questionId": 27,
        "questionType": "MCQ",
        "answer": "C) Statue of Unity",
        "explanation": "The Statue of Unity has been included in the 8 wonders of the Shanghai Cooperation Organisation (SCO). The Statue of Unity is a colossal statue located in Gujarat, India, dedicated to the Indian political leader Vallabhbhai Patel. It is the world's tallest statue and has become a prominent tourist attraction. The inclusion of the Statue of Unity in the 8 wonders of the Shanghai Cooperation Organisation highlights its significance and recognition on an international platform."
    },
    {
        "questionId": 28,
        "questionType": "MCQ",
        "answer": "B) Maldives",
        "explanation": "India gifted a 'Made in India' patrol vessel named 'KAAMIYAAB' to the Maldives. The Maldives, a neighboring country of India, received the patrol vessel as part of bilateral cooperation and strengthening of maritime security. The gift of the patrol vessel showcases the friendly relations between India and the Maldives and the commitment to mutual security and cooperation. The 'KAAMIYAAB' patrol vessel represents India's support in enhancing the maritime capabilities of the Maldives and promoting regional security in the Indian Ocean."
    },
    {
        "questionId": 29,
        "questionType": "MCQ",
        "answer": "A) MiG-27",
        "explanation": "The Indian Air Force aircraft that was decommissioned on December 27, 2019, is the MiG-27. The MiG-27 was a ground-attack aircraft that served the Indian Air Force for several decades. Its decommissioning marked the end of an era for the MiG-27 fleet in the Indian Air Force. The decision to decommission the MiG-27 was made as part of the modernization and upgradation plans of the Indian Air Force's aircraft inventory. The MiG-27 played a significant role in the Indian Air Force's operational capabilities and contributed to its defense strategies."
    },
    {
        "questionId": 30,
        "questionType": "MCQ",
        "answer": "B) Bru-Reang",
        "explanation": "The Tribal refugee community that will now be given permission to settle in Tripura following the signing of a historic agreement on January 16, 2020, is the Bru-Reang community. The Bru-Reang community, also known as Reang, is a tribal group that faced displacement from Mizoram due to ethnic tensions. The agreement signed between the Government of India, the Governments of Tripura and Mizoram, and the Bru-Reang representatives aimed to provide a permanent solution to the issue of displacement. The agreement granted land and rehabilitation packages to the Bru-Reang community, allowing them to settle in Tripura."
    },
    {
        "questionId": 31,
        "questionType": "MCQ",
        "answer": "D) 84",
        "explanation": "In the Henley Passport Index 2020, the ranking of the Indian Passport was 84. The Henley Passport Index is a global ranking that measures the strength of passports based on the number of countries their holders can travel to without a visa or with visa-on-arrival access. The ranking of 84 indicates that Indian passport holders have visa-free or visa-on-arrival access to 84 countries. The ranking of a passport in the Henley Passport Index is an important indicator of the travel freedom and global mobility associated with that passport."
    },
    {
        "questionId": 32,
        "questionType": "MCQ",
        "answer": "B) New Delhi",
        "explanation": "The headquarters of the Global Tiger Forum (GTF) is located in New Delhi, India. The Global Tiger Forum is an intergovernmental international organization dedicated to the conservation of tigers and their habitats. It was established in 1994 with the goal of promoting the protection and sustainable management of tiger populations across tiger range countries. With its headquarters in New Delhi, the Global Tiger Forum plays a crucial role in facilitating collaboration and coordination among member countries to address the conservation challenges faced by tigers."
    },
    {
        "questionId": 33,
        "questionType": "MCQ",
        "answer": "B) Digital monitoring of the borders",
        "explanation": "BOID QIT, which was in the news recently, refers to 'Border Outpost Identification, Digitization, and Quick Response Team.' It is a system or technology used for digital monitoring of the borders. The BOID QIT system involves the use of advanced surveillance and communication technologies to enhance border security and enable quick response to any security threats or breaches. It helps in real-time monitoring and management of border areas, ensuring effective border control and security. The implementation of BOID QIT aims to strengthen border security and prevent unauthorized border crossings."
    },
    {
        "questionId": 34,
        "questionType": "MCQ",
        "answer": "A) Stable",
        "explanation": "According to the State of India's Birds 2020 Report, the status of House Sparrow in India is 'Stable.' The report assesses the conservation status of bird species in India based on various factors such as population trends, distribution, and threats. The stable status indicates that the population of House Sparrows in India is relatively consistent and not undergoing significant declines. However, it is important to continue monitoring and conserving the species to ensure its long-term survival and prevent any future decline. The State of India's Birds report provides valuable insights into the conservation status of birds in the country."
    },
    {
        "questionId": 35,
        "questionType": "MCQ",
        "answer": "A) Maldives",
        "explanation": "India signed an agreement with Maldives to establish Addu Tourism. Addu Atoll, also known as Seenu Atoll, is the southernmost atoll in the Maldives. The agreement between India and Maldives aims to promote tourism in Addu Atoll and develop infrastructure and facilities to attract tourists. It is a collaborative effort to boost tourism and strengthen bilateral relations between the two countries. The agreement signifies the commitment of both India and Maldives to enhance tourism cooperation and explore the potential of Addu Atoll as a popular tourist destination."
    },
    {
        "questionId": 36,
        "questionType": "MCQ",
        "answer": "A) 140",
        "explanation": "India's rank among 156 countries in the Global Happiness Index 2019 was 140. The Global Happiness Index is a report published annually by the United Nations Sustainable Development Solutions Network. It ranks countries based on various factors including GDP per capita, social support, life expectancy, freedom to make life choices, generosity, and perceptions of corruption. India's ranking in the Global Happiness Index reflects the overall happiness and well-being of its population in comparison to other countries. The index provides valuable insights into the factors influencing happiness and helps policymakers in formulating strategies to improve the well-being of their citizens."
    },
    {
        "questionId": 37,
        "questionType": "MCQ",
        "answer": "B) Sikkim",
        "explanation": "The State Government of Sikkim has launched the 'One family, one job' scheme. Under this scheme, one government job is provided to each family in the state. The aim of the scheme is to address unemployment and provide livelihood opportunities to the people of Sikkim. It ensures that every family in the state has at least one earning member who is employed in a government job. The scheme aims to improve the socio-economic conditions of the people and promote inclusive development in Sikkim."
    },
    {
        "questionId": 38,
        "questionType": "MCQ",
        "answer": "D) Consistently showing for Air quality than the National Ambient Air Quality Standards",
        "explanation": "The cities called 'Non-attainment cities' in India are those that consistently show air quality worse than the National Ambient Air Quality Standards (NAAQS). These cities fail to meet the air quality standards set by the Central Pollution Control Board (CPCB) and are categorized as non-attainment cities. The term 'non-attainment' signifies that these cities have not achieved the desired air quality targets and require focused efforts and interventions to improve their air quality. The designation helps in identifying and prioritizing areas for implementing pollution control measures and improving air quality in these cities."
    },
    {
        "questionId": 39,
        "questionType": "MCQ",
        "answer": "D) China",
        "explanation": "China topped the list of the global diplomacy index 2019 released by the Sidney-based Lowy Institute. The index measures the diplomatic networks and capabilities of 61 countries around the world. China's top ranking reflects its growing influence and assertive diplomacy on the global stage. The country's diplomatic efforts and investments in building relationships and networks have contributed to its position as a significant player in international affairs. This index provides insights into the diplomatic power and reach of nations in shaping global politics and relationships."
    },
    {
        "questionId": 40,
        "questionType": "MCQ",
        "answer": "D) Srilanka",
        "explanation": "Sri Lanka has criminalized offences related to match-fixing. The country recognized the need to address the issue of match-fixing and took a proactive approach by passing legislation to make such activities illegal. By criminalizing match-fixing, Sri Lanka aims to protect the integrity of sports and ensure fair competition. This move sends a strong message that any form of manipulation or corruption in sports will not be tolerated and will be met with legal consequences. It is an important step towards maintaining the credibility and transparency of sporting events."
    },
    {
        "questionId": 41,
        "questionType": "MCQ",
        "answer": "B) Nepal",
        "explanation": "The festival of 'Bada Dashain' is celebrated in Nepal. It is the biggest and most important festival in the country, also known as Dashain or Vijaya Dashami. The festival marks the victory of good over evil and is dedicated to the Hindu goddess Durga. It is a time of feasting, family gatherings, and worship. During Bada Dashain, people participate in various religious rituals, visit temples, fly kites, play games, and exchange blessings and gifts. It is a significant cultural and religious celebration in Nepal."
    },
    {
        "questionId": 42,
        "questionType": "MCQ",
        "answer": "D) Each for Equal",
        "explanation": "The campaign theme of 'International Women's Day 2020' was 'Each for Equal'. The theme highlights the importance of gender equality and calls for collective action to create a more inclusive and gender-balanced world. It emphasizes that every individual has a role to play in promoting gender equality and that an equal world is an enabled world. The campaign encourages individuals to challenge stereotypes, biases, and discrimination, and strive for equality in all aspects of life. 'Each for Equal' signifies the power of individual actions in driving positive change and building a more equitable society."
    },
    {
        "questionId": 43,
        "questionType": "MCQ",
        "answer": "A) Brazil",
        "explanation": "'Operation Car Wash' refers to a major corruption investigation that took place in Brazil. It was initiated by the Brazilian Federal Police in 2014 and aimed at uncovering a large-scale money laundering and corruption scheme involving prominent politicians and business executives. The operation exposed widespread corruption in the country, leading to the arrest and prosecution of numerous individuals involved in bribery and embezzlement. The investigation had a significant impact on Brazilian politics and resulted in the impeachment of the President. Therefore, the term 'Operation Car Wash' is associated with Brazil."
    },
    {
        "questionId": 44,
        "questionType": "MCQ",
        "answer": "B) UK",
        "explanation": "The United Kingdom (UK) will host the UN Climate Summit 'COP 26'. COP 26 stands for the 26th Conference of the Parties to the United Nations Framework Convention on Climate Change (UNFCCC). It is a significant global summit where countries come together to discuss and negotiate actions to address climate change. The summit aims to enhance international cooperation and commitment to mitigating climate change and achieving the goals of the Paris Agreement. As the host country, the UK will play a crucial role in facilitating the discussions and driving global climate action."
    },
    {
        "questionId": 45,
        "questionType": "MCQ",
        "answer": "A) Reduce poverty by half since 1991",
        "explanation": "The World Bank, in its latest report in 2019, appreciated India's efforts and policies to reduce poverty by half since 1991. This recognition highlights India's progress in poverty alleviation and its commitment to improving the well-being of its citizens. Over the years, India has implemented various poverty reduction programs and initiatives that have contributed to significant poverty reduction. The World Bank's acknowledgment underscores India's dedication to addressing the issue of poverty and improving the lives of its people."
    },
    {
        "questionId": 46,
        "questionType": "MCQ",
        "answer": "A) To discover the most effective ways to tackle poverty in the developing world",
        "explanation": "The Nobel Prize in Economics for the year 2019 was awarded to Abhijit Banerjee, Esther Duflo, and Michael Kremer for their experimental approach to alleviating global poverty. Their research focused on finding effective ways to tackle poverty in the developing world by conducting field experiments and gathering empirical evidence. They emphasized the importance of using data-driven and evidence-based policies to address poverty and improve the lives of people in low-income communities. Their work has made significant contributions to the field of development economics and has helped shape poverty reduction strategies worldwide."
    },
    {
        "questionId": 47,
        "questionType": "MCQ",
        "answer": "A) They are considered harmful to the Marine ecosystem",
        "explanation": "There is a great concern about the 'microbeads' that are released into the environment because they are considered harmful to the marine ecosystem. Microbeads are tiny plastic particles commonly found in personal care products such as face scrubs, toothpaste, and body wash. These microbeads are too small to be filtered out by wastewater treatment plants and end up in rivers, lakes, and oceans, posing a threat to marine life. Marine organisms can mistake these microbeads for food, leading to ingestion and potential harm. Additionally, microbeads can absorb and release harmful pollutants, further contributing to environmental pollution. Efforts are being made to ban or restrict the use of microbeads to protect the marine ecosystem."
    },
    {
        "questionId": 48,
        "questionType": "MCQ",
        "answer": "B) India",
        "explanation": "Among the options provided, India is the largest exporter of rice in the world in the last five years. India has consistently been one of the top exporters of rice globally due to its significant production capacity and favorable climatic conditions for rice cultivation. The country has implemented various measures to increase rice production and promote exports, leading to its dominant position in the global rice market. India's export of rice plays a crucial role in meeting the global demand for this staple food and contributing to its economy. "
    },
    {
        "questionId": 49,
        "questionType": "MCQ",
        "answer": "A) Kazakhstan",
        "explanation": "The capital of Kazakhstan, formerly known as Astana, has been renamed as Nursultan. This change in the capital's name was made in honor of Nursultan Nazarbayev, the first President of Kazakhstan, who served in that position for almost three decades. The decision to rename the capital was made in March 2019, shortly after Nazarbayev announced his resignation. The renaming of the capital is a symbolic gesture to recognize and honor Nazarbayev's contributions to the country. Nursultan continues to serve as the political, economic, and cultural center of Kazakhstan."
    },
    {
        "questionId": 50,
        "questionType": "MCQ",
        "answer": "A) IMF and International Bank for Reconstruction and Development (IBRD)",
        "explanation": "The 'Bretton Woods Twins' refer to the International Monetary Fund (IMF) and the International Bank for Reconstruction and Development (IBRD). These two institutions were created during the Bretton Woods Conference held in 1944. The IMF is responsible for promoting global monetary cooperation, ensuring financial stability, and providing financial assistance to member countries in need. The IBRD, also known as the World Bank, focuses on providing loans and development assistance to middle-income and low-income countries for infrastructure and development projects. Together, the IMF and IBRD play a significant role in international economic cooperation and development."
    },
    {
        "questionId": 51,
        "questionType": "MCQ",
        "answer": "B) Paris",
        "explanation": "The 2024 Summer Olympic Games will be held in Paris, France. Paris was awarded the hosting rights for the event by the International Olympic Committee (IOC). The city previously hosted the Summer Olympics in 1900 and 1924, making the 2024 Games the third time Paris will be the host. The event will showcase various sports competitions, bringing together athletes from around the world to compete for Olympic glory. The Olympics is a major international sporting event that promotes unity, athletic excellence, and cultural exchange."
    },
    {
        "questionId": 52,
        "questionType": "MCQ",
        "answer": "A) Norway",
        "explanation": "Norway topped the list of the 2019 World Press Freedom Index. The World Press Freedom Index is an annual ranking published by Reporters Without Borders (RSF), which evaluates the state of press freedom in countries around the world. Norway's high ranking reflects its commitment to protecting and promoting freedom of the press, allowing journalists to operate independently and report without undue restrictions. The index takes into account factors such as media independence, legal framework, transparency, and abuses against journalists. Norway's strong performance in these areas earned it the top position in the 2019 index."
    },
    {
        "questionId": 53,
        "questionType": "MCQ",
        "answer": "C) Statue of Unity",
        "explanation": "The Statue of Unity has been included in the 8 wonders of the Shanghai Cooperation Organisation (SCO). The Shanghai Cooperation Organisation is a regional intergovernmental organization comprising eight member states, including China, Russia, India, and others. The inclusion of the Statue of Unity in the list highlights its significance and recognition as a remarkable architectural and engineering marvel. The Statue of Unity is a statue dedicated to Indian political leader Vallabhbhai Patel, located in Gujarat, India. It is the world's tallest statue, symbolizing unity and the vision of a strong and prosperous nation. The inclusion of the Statue of Unity in the list showcases its cultural and historical significance within the SCO member countries."
    },
    {
        "questionId": 54,
        "questionType": "MCQ",
        "answer": "B) Maldives",
        "explanation": "India gifted a 'Made in India' patrol vessel named 'KAAMIYAAB' to Maldives. The patrol vessel represents the strong bilateral relations between India and Maldives. It signifies India's commitment to maritime security cooperation and support to the Maldivian Coast Guard. The gift of the patrol vessel aims to enhance the maritime capabilities of Maldives and strengthen the maritime security in the region. The gesture reflects India's role as a reliable partner and friend to the Maldives in promoting regional security and cooperation."
    },
    {
        "questionId": 55,
        "questionType": "MCQ",
        "answer": "A) MiG-27",
        "explanation": "The Indian Air Force decommissioned the MiG-27 aircraft on December 27, 2019. The MiG-27, also known as the 'Bahadur,' was a ground-attack aircraft that served the Indian Air Force for several decades. Its retirement marked the end of an era in the Indian Air Force's combat capabilities. The decision to decommission the MiG-27 was made as part of the modernization and upgradation plans of the Indian Air Force to make way for more advanced and capable aircraft. The retirement of the MiG-27 reflects the constant evolution and technological advancements in the field of military aviation."
    },
    {
        "questionId": 56,
        "questionType": "MCQ",
        "answer": "B) Bru-Reang",
        "explanation": "The Bru-Reang community will now be given permission to settle in Tripura following the signing of a historic agreement on January 16, 2020. The Bru-Reang community, also known as the Reang tribe, is a tribal refugee community that has been living in temporary camps in Tripura after being displaced from Mizoram due to ethnic tensions. The agreement, known as the Bru-Reang settlement agreement, aims to provide a permanent solution to the refugee crisis by allowing the Bru-Reang people to settle in Tripura and providing them with various welfare measures and assistance. This agreement is a significant step towards resolving the longstanding issue and ensuring the well-being and rights of the Bru-Reang community."
    },
    {
        "questionId": 57,
        "questionType": "MCQ",
        "answer": "D) 84",
        "explanation": "The ranking of the Indian Passport in the Henley Passport Index 2020 is 84. The Henley Passport Index is a global ranking that measures the strength of passports based on the number of countries their holders can visit without a visa or with visa-on-arrival access. With a ranking of 84, it means that Indian passport holders can travel to 84 countries either visa-free or by obtaining a visa on arrival. The ranking reflects the level of travel freedom and mobility that Indian passport holders have compared to citizens of other countries. It is an important indicator of the international travel privileges associated with a particular passport."
    },
    {
        "questionId": 58,
        "questionType": "MCQ",
        "answer": "B) New Delhi",
        "explanation": "The headquarters of the Global Tiger Forum (GTF) is located in New Delhi, India. The Global Tiger Forum is an intergovernmental international organization dedicated to the conservation and protection of tigers and their habitats. It was established in 1993 with the goal of promoting the conservation and sustainable management of tiger populations. As the headquarters of the GTF, New Delhi serves as a central hub for coordinating and implementing initiatives and strategies aimed at tiger conservation. The GTF works closely with member countries and other stakeholders to address issues related to tiger conservation and combat wildlife trafficking."
    },
    {
        "questionId": 59,
        "questionType": "MCQ",
        "answer": "B) Digital monitoring of the borders",
        "explanation": "BOID QIT refers to 'Border Security Force (BSF) Online Integrated Solution for Duty Rostering, Leave Management, and Monitoring of Border Outposts'. It is a digital monitoring system developed by the Border Security Force (BSF) of India for effective management and monitoring of the borders. The system utilizes technology to automate duty rostering, leave management, and monitoring of border outposts, enhancing the efficiency and effectiveness of border security operations. With BOID QIT, the BSF aims to streamline administrative processes, improve transparency, and strengthen border security. The system has been in the news recently for its successful implementation and its contribution to border management."
    },
    {
        "questionId": 60,
        "questionType": "MCQ",
        "answer": "A) Stable",
        "explanation": "According to the State of India's Birds 2020 Report, the status of House Sparrow in India is 'Stable'. The report indicates that the population of House Sparrows in India has not shown a significant decline or increase and has remained relatively stable. This is an encouraging finding as House Sparrows were previously facing concerns about their declining numbers due to urbanization, loss of nesting sites, and changes in habitat. Efforts such as conservation initiatives and awareness campaigns have contributed to maintaining the stability of the House Sparrow population in India."
    },
    {
        "questionId": 61,
        "questionType": "MCQ",
        "answer": "A) Maldives",
        "explanation": "India signed an agreement with the Maldives to establish Addu Tourism. The agreement aims to promote tourism cooperation between the two countries, particularly in the Addu City region of the Maldives. The collaboration is expected to boost tourism infrastructure development, enhance cultural exchanges, and strengthen bilateral ties. This agreement reflects the growing tourism partnership between India and the Maldives, which have long-standing historical and cultural connections. The establishment of Addu Tourism is a significant step in furthering the tourism industry and promoting mutual tourism benefits."
    },
    {
        "questionId": 62,
        "questionType": "MCQ",
        "answer": "B) Sikkim",
        "explanation": "The 'One family, one job' scheme was launched by the Sikkim State Government. Under this scheme, the government aims to provide employment to at least one member of every family in the state. The scheme focuses on addressing unemployment issues and improving the economic condition of households. By providing job opportunities, the government aims to uplift families and enhance their overall well-being. This initiative is part of Sikkim's efforts to promote inclusive growth and ensure sustainable development."
    },
    {
        "questionId": 63,
        "questionType": "MCQ",
        "answer": "D) Consistently showing for Air quality than the National Ambient Air Quality Standards",
        "explanation": "The cities that are called 'Non-attainment cities' in India are the ones that consistently fail to meet the National Ambient Air Quality Standards for air quality. These cities have air pollution levels that exceed the permissible limits, posing risks to the health of their residents. The term 'Non-attainment' refers to the failure to achieve the desired air quality standards. These cities require special attention and interventions to improve their air quality and reduce pollution levels. Various measures and policies are implemented in these cities to mitigate air pollution and protect public health."
    },
    {
        "questionId": 64,
        "questionType": "MCQ",
        "answer": "D) China",
        "explanation": "China topped the list of the global diplomacy index 2019 released by the Sydney-based Lowy Institute. The index measures the diplomatic influence of countries based on their diplomatic networks, resources, and capabilities. China's rise to the top position reflects its increasing global influence and assertive diplomacy on various international issues. The country's diplomatic efforts, including its economic initiatives such as the Belt and Road Initiative, have positioned China as a key player in global affairs. China's diplomatic prowess has contributed to shaping the geopolitical landscape and influencing global decision-making."
    },
    {
        "questionId": 65,
        "questionType": "MCQ",
        "answer": "D) Srilanka",
        "explanation": "Sri Lanka has criminalized offences related to match-fixing. The country passed the Prevention of Offences Related to Sports Act in 2019, which includes provisions to tackle match-fixing and corruption in sports. This step was taken to preserve the integrity of sports and ensure fair play. By criminalizing match-fixing, Sri Lanka aims to deter individuals involved in such activities and safeguard the credibility of sports competitions. The move reflects the country's commitment to promoting clean and transparent sports practices."
    },
    {
        "questionId": 66,
        "questionType": "MCQ",
        "answer": "B) Nepal",
        "explanation": "Bada Dashain is the festival celebrated in Nepal. It is the biggest and most important festival in the country, lasting for 15 days. Also known as Dashain or Vijaya Dashami, it is a Hindu festival that commemorates the victory of good over evil. During Bada Dashain, people engage in various religious rituals, visit temples, exchange gifts, and participate in cultural events. The festival is marked by vibrant decorations, music, dance, and the flying of kites. It holds great significance in Nepalese culture and is a time for family gatherings and celebration."
    },
    {
        "questionId": 67,
        "questionType": "MCQ",
        "answer": "D) Each for Equal",
        "explanation": "The campaign theme of International Women's Day 2020 was 'Each for Equal'. The theme emphasizes the importance of collective action and individual responsibility in achieving gender equality. It promotes the idea that gender equality is not just a women's issue but a societal issue that requires the active participation and support of everyone. The theme highlights the need to challenge biases, stereotypes, and discrimination, and encourages individuals to take action to create a more inclusive and gender-equal world. It emphasizes the power of individual actions in contributing to a larger movement for gender equality."
    },
    {
        "questionId": 68,
        "questionType": "MCQ",
        "answer": "A) Brazil",
        "explanation": "The term 'Operation Car Wash' refers to a high-profile corruption investigation that took place in Brazil. It began as a money laundering investigation in 2014 but eventually uncovered a massive corruption scandal involving state-owned oil company Petrobras and numerous political and business figures. The operation led to the arrest and prosecution of prominent individuals and the recovery of billions of dollars in illegally obtained assets. The investigation had a significant impact on Brazil's political and economic landscape, resulting in widespread public outrage and calls for accountability."
    },
    {
        "questionId": 69,
        "questionType": "MCQ",
        "answer": "B) UK",
        "explanation": "The United Kingdom (UK) will host the UN Climate Summit 'COP 26'. COP 26 stands for the 26th Conference of the Parties to the United Nations Framework Convention on Climate Change (UNFCCC). It is an international event where world leaders, policymakers, and stakeholders come together to discuss and negotiate global climate action. The UK's hosting of COP 26 signifies its commitment to addressing climate change and driving international cooperation towards mitigating its effects. The summit aims to accelerate climate action and secure global agreements to combat climate change."
    },
    {
        "questionId": 70,
        "questionType": "MCQ",
        "answer": "A) Reduce poverty by half since 1991",
        "explanation": "In the latest report of 2019, the World Bank appreciated India's efforts and policies to reduce poverty by half since 1991. This recognition acknowledges India's significant progress in poverty reduction over the years. India has implemented various initiatives and programs to address poverty, including social welfare schemes, economic reforms, and targeted interventions. These efforts have resulted in a significant decline in the poverty rate and improvements in the living standards of millions of people. The World Bank's appreciation highlights India's commitment to poverty alleviation and sustainable development."
    },
    {
        "questionId": 71,
        "questionType": "MCQ",
        "answer": "A) To discover the most effective ways to tackle poverty in the developing world",
        "explanation": "The Nobel Prize 2019 for economics was awarded to Abhijit Banerjee, Esther Duflo, and Michael Kremer for their experimental approach to alleviating global poverty. Their research focused on understanding the root causes of poverty and identifying effective interventions to address it. They conducted field experiments and applied rigorous economic analysis to study various aspects of poverty, such as education, health, and financial inclusion. Their work has provided valuable insights into the most effective ways to tackle poverty in the developing world, leading to evidence-based policies and interventions that have the potential to make a significant impact on poverty reduction."
    },
    {
        "questionId": 72,
        "questionType": "MCQ",
        "answer": "A) They are considered harmful to the Marine ecosystem",
        "explanation": "There is great concern about the 'microbeads' that are released into the environment because they are considered harmful to the marine ecosystem. Microbeads are tiny plastic particles that are commonly found in personal care and cosmetic products such as facial scrubs, toothpaste, and body wash. When these products are used and washed down the drain, the microbeads end up in water bodies and can have detrimental effects on marine life. Marine organisms can mistake the microbeads for food and ingest them, leading to potential health problems and disruption of the marine food chain. Additionally, microbeads can accumulate toxins and pollutants, further impacting the marine ecosystem."
    },
    {
        "questionId": 73,
        "questionType": "MCQ",
        "answer": "B) India",
        "explanation": "India is the largest exporter of rice in the world in the last five years. With its abundant rice production and favorable climatic conditions, India has consistently maintained its position as the leading exporter of rice globally. The country's robust agricultural sector, advanced farming techniques, and efficient supply chains contribute to its significant rice export volume. India's rice exports cater to the increasing demand in various international markets, making it a key player in the global rice trade. This achievement showcases India's competitiveness and strength in the agriculture sector."
    },
    {
        "questionId": 74,
        "questionType": "MCQ",
        "answer": "A) Kazakhstan",
        "explanation": "The country whose capital name is renamed as 'Nursultan' is Kazakhstan. The capital city of Kazakhstan was previously known as Astana, but in March 2019, it was officially renamed as Nursultan in honor of the country's long-serving leader Nursultan Nazarbayev. This renaming was done to commemorate his contributions and legacy to the nation. The renaming of the capital reflects the importance and influence of Nursultan Nazarbayev in shaping Kazakhstan's political landscape and development. Kazakhstan is located in Central Asia and is known for its rich history and diverse cultural heritage."
    },
    {
        "questionId": 75,
        "questionType": "MCQ",
        "answer": "A) IMF and International Bank for Reconstruction and Development (IBRD)",
        "explanation": "The 'Bretton Woods Twins' refer to the International Monetary Fund (IMF) and the International Bank for Reconstruction and Development (IBRD). These two institutions were established at the Bretton Woods Conference in 1944, which aimed to promote global economic stability and development after World War II. The IMF focuses on maintaining monetary cooperation and providing financial assistance to member countries, while the IBRD, commonly known as the World Bank, provides loans and grants for development projects. Together, the IMF and IBRD play a crucial role in international finance and development."
    },
    {
        "questionId": 76,
        "questionType": "MCQ",
        "answer": "D) Andhra Pradesh",
        "explanation": "Andhra Pradesh is the state that got a separate high court on 1 January 2019, making it the 25th high court of India. Prior to this, Andhra Pradesh and Telangana shared a common high court after the bifurcation of the state in 2014. However, to address the need for separate judicial administration, Andhra Pradesh was granted its own high court. This decision aimed to ensure effective and efficient justice delivery in the state. The establishment of a separate high court for Andhra Pradesh is an important milestone in its judicial system."
    },
    {
        "questionId": 77,
        "questionType": "MCQ",
        "answer": "D) West Bengal",
        "explanation": "West Bengal is the state that does not have a bicameral legislature. A bicameral legislature consists of two separate houses or chambers, namely the lower house (Legislative Assembly) and the upper house (Legislative Council). However, West Bengal only has a unicameral legislature, which means it has only one house, known as the West Bengal Legislative Assembly. The other options, Jammu &amp; Kashmir, Telangana, and Karnataka, have a bicameral legislature with both an assembly and a council. West Bengal follows the unicameral system of legislation."
    },
    {
        "questionId": 78,
        "questionType": "MCQ",
        "answer": "A) Rajasthan",
        "explanation": "The state of Rajasthan was the first to adopt the Panchayati Raj system in India in 1959. Panchayati Raj is a system of local self-government in rural areas that aims to decentralize power and promote grassroots democracy. It involves the establishment of elected village councils or Panchayats at the village, block, and district levels. The adoption of Panchayati Raj in Rajasthan marked an important milestone in the decentralization of governance and empowerment of local communities. It served as a model for other states to follow suit and implement Panchayati Raj across the country."
    },
    {
        "questionId": 79,
        "questionType": "statements",
        "answer": "C) Both I and II",
        "explanation": "The statement I is true that the Panchayati Raj Act does not apply to the Darjeeling district of West Bengal. This exception is due to the special provisions under the Darjeeling Gorkha Hill Council Act, which governs the local self-government in the Darjeeling district. Statement II is also true that the allotment of seats in constituencies for Panchayat elections cannot be questioned in a court of law. This provision aims to ensure the smooth functioning of the Panchayati Raj system and avoid unnecessary legal challenges to the seat allocation process. Therefore, both statements I and II are correct."
    },
    {
        "questionId": 80,
        "questionType": "statements",
        "answer": "D) All of these",
        "explanation": "The L.M. Singhvi Committee made several recommendations related to the Panchayati Raj system. Statement I is true, as the committee recommended the creation of Nyaya Panchayats for a cluster of villages to provide justice at the grassroots level. Statement II is also true, as the committee recommended constitutional recognition for Panchayati Raj institutions to ensure their autonomy and effectiveness. Statement III is true, as the committee recommended allocating more financial resources to village panchayats to enhance their capacity for local development. Therefore, all statements I, II, and III are correct."
    },
    {
        "questionId": 81,
        "questionType": "MCQ",
        "answer": "B) Direct transfer of LPG subsidy",
        "explanation": "The PAHAL Scheme is related to the direct transfer of LPG subsidy. It was launched by the Government of India to provide subsidies for cooking gas (LPG) directly to the bank accounts of consumers. The scheme aims to eliminate leakages and ensure that the subsidy reaches the intended beneficiaries. By linking the subsidy directly to the consumer's bank account, it helps in reducing instances of fraud and misappropriation of funds. The PAHAL Scheme has been implemented nationwide and has significantly contributed to improving the efficiency of LPG subsidy distribution."
    },
    {
        "questionId": 82,
        "questionType": "MCQ",
        "answer": "B) Fifth schedule",
        "explanation": "The transfer of tribal land to private parties for mining can be declared null and void under the Fifth Schedule of the Constitution of India. The Fifth Schedule provides special provisions for the administration and control of scheduled areas and tribes in certain states. It aims to safeguard the rights and interests of tribal communities, including protection of their land, resources, and culture. Therefore, the correct answer is option B) Fifth schedule."
    },
    {
        "questionId": 83,
        "questionType": "MCQ",
        "answer": "D) 6 months",
        "explanation": "Rajya Sabha can delay the finance bill sent for consideration by the Lok Sabha for a maximum period of 6 months. The Rajya Sabha, also known as the Upper House of Parliament in India, has the power to suggest amendments and propose changes to the finance bill. However, if the bill is not returned to the Lok Sabha within 6 months, it is considered to have been passed by both houses. Therefore, the correct answer is option D) 6 months."
    },
    {
        "questionId": 84,
        "questionType": "MCQ",
        "answer": "A) Right to Education a Fundamental Right for children in the range of 6 to 14 years",
        "explanation": "The Constitution 86th Amendment Act, 2002 deals with the Right to Education as a Fundamental Right for children in the range of 6 to 14 years. This amendment made education a fundamental right for children in the specified age group, ensuring that every child has the right to free and compulsory education. It aimed to provide equal access to quality education and promote inclusive education practices. Therefore, the correct answer is option A) Right to Education a Fundamental Right for children in the range of 6 to 14 years."
    },
    {
        "questionId": 85,
        "questionType": "MCQ",
        "answer": "C) Statutory body",
        "explanation": "The National Human Rights Commission (NHRC) is a statutory body in India. It was established under the Protection of Human Rights Act, 1993. As a statutory body, the NHRC derives its powers and functions from a specific legislation passed by the Parliament. It is responsible for promoting and protecting human rights in the country, investigating human rights violations, and addressing complaints related to human rights abuses. Therefore, the correct answer is option C) Statutory body."
    },
    {
        "questionId": 86,
        "questionType": "MCQ",
        "answer": "C) Ministry of Labour and Employment",
        "explanation": "The Union Ministry of Labour and Employment has launched a new portal called Santusht for effective delivery of public service. The portal aims to address grievances and ensure timely resolution of issues related to the ministry's various departments and organizations. It provides a platform for individuals to register their complaints, track their status, and receive updates on the progress of their complaints. By launching this portal, the Ministry of Labour and Employment aims to enhance transparency, accountability, and efficiency in public service delivery. Therefore, the correct answer is option C) Ministry of Labour and Employment."
    },
    {
        "questionId": 87,
        "questionType": "MCQ",
        "answer": "A) Tamil Nadu",
        "explanation": "In the good governance index (GGI) launched by the Central Government on 25th December 2019, Tamil Nadu topped the rankings. The index assesses the performance of states and union territories in terms of good governance based on various parameters such as infrastructure, human resource development, social welfare, and economic governance. Tamil Nadu's top ranking signifies its effective governance practices and efficient delivery of public services. The state has made significant strides in areas like public health, education, and infrastructure development. Therefore, the correct answer is option A) Tamil Nadu."
    },
    {
        "questionId": 88,
        "questionType": "MCQ",
        "answer": "B) Baba Ramchandra",
        "explanation": "Among the given options, Baba Ramchandra was not an Arya Samajist. Lala Hansraj, Bhai Parmananda, and Lala Lajpat Rai were prominent Arya Samajists who played significant roles in the Arya Samaj movement in India. Arya Samaj is a Hindu reform movement founded by Swami Dayananda Saraswati in 1875. It emphasizes the Vedas as the ultimate source of knowledge and advocates for social and religious reforms. While Lala Hansraj, Bhai Parmananda, and Lala Lajpat Rai were associated with the Arya Samaj, Baba Ramchandra did not have any known association with the movement. Therefore, the correct answer is option B) Baba Ramchandra."
    },
    {
        "questionId": 89,
        "questionType": "MCQ",
        "answer": "A) Rashtriya Swayamsevak Sangh",
        "explanation": "Among the given options, the Rashtriya Swayamsevak Sangh (RSS) was the last organization to be established. The RSS was founded on September 27, 1925, by Keshav Baliram Hedgewar in Nagpur, India. It is a right-wing Hindu nationalist organization that aims to promote the cultural and spiritual values of India. The Hindu Mahasabha was established in 1915, the Satya Sodhak Samaj was founded in 1873, and the Hindustan Republican Association (later known as Hindustan Socialist Republican Association) was formed in 1924. Therefore, the correct answer is option A) Rashtriya Swayamsevak Sangh."
    },
    {
        "questionId": 90,
        "questionType": "MCQ",
        "answer": "A) 1878",
        "explanation": "The 'Vernacular Press Act' was passed in the year 1878. It was a controversial law enacted by the British colonial government in India during the British Raj. The Act aimed to regulate the vernacular press, which was publishing articles critical of the government's policies and actions. It granted the government extensive powers to censor and control the press, including the authority to confiscate printing equipment and impose penalties for seditious writings. The Act was met with widespread opposition from the Indian press and nationalist leaders, who viewed it as a suppression of freedom of speech and expression."
    },
    {
        "questionId": 91,
        "questionType": "MCQ",
        "answer": "C) Bengal",
        "explanation": "The 'Pabna Revolt' took place in the region of Bengal. It occurred from 1873 to 1876 and was a peasant uprising against the oppressive zamindari system and the high rates of land revenue imposed by the British colonial administration. The revolt was primarily concentrated in the Pabna district of Bengal, which was known for its agrarian discontent and widespread peasant grievances. The uprising was marked by protests, demonstrations, and acts of violence, with the peasants demanding relief from the exploitative land tenure system. The Pabna Revolt played a significant role in the agrarian resistance movements during the colonial period in Bengal."
    },
    {
        "questionId": 92,
        "questionType": "MCQ",
        "answer": "C) 1921",
        "explanation": "The first session of the 'Chamber of Princes' was held in the year 1921. The Chamber of Princes was a legislative body established under the Government of India Act, 1919. It represented the princely states of British India and provided them with a platform to discuss and deliberate on matters concerning their interests and governance. The establishment of the Chamber of Princes aimed to foster cooperation between the British government and the princely states. The first session marked an important milestone in the political engagement of the princely states within the framework of British India."
    },
    {
        "questionId": 93,
        "questionType": "MCQ",
        "answer": "B) Richard Strachey",
        "explanation": "Richard Strachey presided over the commission appointed on Famine Policy in 1880. The commission, known as the Famine Commission of 1880, was established to review and evaluate the existing policies and practices related to famine relief and prevention in British India. Richard Strachey, a British civil servant and engineer, played a key role in the commission's proceedings and recommendations. The commission's findings helped shape future policies and strategies to mitigate the impact of famines in India. Richard Strachey's expertise and leadership contributed to the commission's important work in addressing the challenges of famine in British India."
    },
    {
        "questionId": 94,
        "questionType": "MCQ",
        "answer": "D) Jawaharlal Nehru",
        "explanation": "Jawaharlal Nehru attended the 'Congress of Oppressed Nationalists' at Brussels in 1927. The conference, held in Brussels, Belgium, was organized to bring together nationalist leaders from different countries who were fighting against colonialism and imperialism. Nehru, a prominent leader of the Indian National Congress and a staunch advocate of India's independence, actively participated in the conference. His presence at the event highlighted India's struggle for freedom and its solidarity with other oppressed nations. Nehru's involvement in international forums like the 'Congress of Oppressed Nationalists' demonstrated his commitment to the cause of global liberation movements."
    },
    {
        "questionId": 95,
        "questionType": "MCQ",
        "answer": "A) A Munda Revolt",
        "explanation": "'Ulgulan' refers to a Munda Revolt. The Munda Revolt, also known as the Ulgulan movement, was an uprising by the Munda tribal people in the late 19th century against the oppressive practices of the British colonial administration in the Chota Nagpur region of present-day Jharkhand, India. The revolt was led by tribal leaders like Birsa Munda, who mobilized the Munda community to resist land encroachments, forced labor, and cultural assimilation. The term 'Ulgulan' signifies the spirit of rebellion and agitation in the Munda language. The revolt played a significant role in raising tribal consciousness and asserting their rights."
    },
    {
        "questionId": 96,
        "questionType": "MCQ",
        "answer": "B) Madras Mahajan Sabha",
        "explanation": "The Madras Mahajan Sabha was the last organization to be established among the options provided. It was founded in 1884 by M. Veeraraghavachariar and G. Subramania Iyer in Madras (now Chennai), India. The organization played a crucial role in advocating for social and political reforms in Madras Presidency during the colonial period. It focused on issues such as education, women's rights, caste discrimination, and political representation. The Madras Mahajan Sabha aimed to bring together the educated middle-class Indians and create awareness about the need for social change and political empowerment."
    },
    {
        "questionId": 97,
        "questionType": "MCQ",
        "answer": "B) February 20, 1947",
        "explanation": "The British Prime Minister declared in the British Parliament that the transfer of power to responsible Indian hands would be done by June 1948 on February 20, 1947. This declaration, commonly known as the 'February 20 announcement,' marked a significant milestone in the Indian independence movement. It set a timeline for the transfer of power and paved the way for the subsequent negotiations and discussions between the British government and Indian leaders. The announcement fueled the momentum of the independence movement and led to the formation of the Interim Government of India in 1947."
    },
    {
        "questionId": 98,
        "questionType": "MCQ",
        "answer": "D) Bandi Jivan",
        "explanation": "The work 'Bandi Jivan' was written by Sachindranath Sanyal to attract the youth to Revolutionary Nationalism. 'Bandi Jivan' translates to 'Life in Prison' and is an autobiographical account of Sanyal's experiences as a revolutionary and his time spent in prison. The book aimed to inspire and educate young revolutionaries about the ideals of freedom and resistance against colonial rule. It provided insights into the challenges faced by revolutionaries and their commitment to the cause of Indian independence. 'Bandi Jivan' played a significant role in shaping the revolutionary movement in India during the early 20th century."
    },
    {
        "questionId": 99,
        "questionType": "MCQ",
        "answer": "D) Choes",
        "explanation": "The soil type 'Choes' does not exist in India. The options provided in the question are all related to soil types found in India except for 'Choes'. Arid soil refers to the desert soils found in arid regions, peat soil is characterized by the accumulation of partially decayed organic matter, and laterite soil is a type of soil rich in iron and aluminum. However, 'Choes' is not a recognized soil type in India. It is important to note that India has a wide variety of soil types due to its diverse geographical and climatic conditions."
    },
    {
        "questionId": 100,
        "questionType": "MCQ",
        "answer": "D) Area between Beas and Sutlej",
        "explanation": "Jalandhar Doab is closely related to the area between the Beas and Sutlej rivers. A 'doab' refers to the land area between two rivers, and the Jalandhar Doab specifically refers to the region between the Beas and Sutlej rivers in Punjab, India. It is named after the city of Jalandhar, which is located in this region. The Doab is known for its fertile agricultural land and is an important agricultural and industrial region in Punjab."
    }
]