[
    {
        "questionId": 1,
        "questionType": "MCQ",
        "answer": "B) Bara Bhangal Valley",
        "explanation": "The Bara Bhangal Valley lies between the Dhauladhar and Pir Panjal ranges. It is a remote and picturesque valley located in the Indian state of Himachal Pradesh. The valley is known for its challenging trekking routes and stunning natural beauty, with snow-capped peaks, lush meadows, and pristine alpine lakes. Bara Bhangal Valley is a popular destination for adventure enthusiasts and nature lovers."
    },
    {
        "questionId": 2,
        "questionType": "MCQ",
        "answer": "A) Sub-Himalayan Zone",
        "explanation": "The Sub-Himalayan Zone occupies the maximum percentage of the total geographical area of Himachal Pradesh. Also known as the Shiwalik Range, this zone lies in the southern part of the state. It is characterized by lower altitudes and foothills of the Himalayas. The Sub-Himalayan Zone is marked by a diverse range of flora and fauna, dense forests, and numerous rivers and streams. It is an important ecological region and contributes significantly to the overall geographical diversity of Himachal Pradesh."
    },
    {
        "questionId": 3,
        "questionType": "MCQ",
        "answer": "A) Zanskar Pass",
        "explanation": "Shingo-La is the name of the Zanskar Pass. It is a high mountain pass located in the Zanskar Range of the Indian state of Jammu and Kashmir. The pass connects the Zanskar Valley with the Lahaul region in Himachal Pradesh. Shingo-La is known for its challenging terrain and is frequently used by trekkers and adventure enthusiasts. It offers breathtaking views of snow-capped peaks, glaciers, and alpine landscapes. The pass is an important route for trade and transportation in the region."
    },
    {
        "questionId": 4,
        "questionType": "MCQ",
        "answer": "B) Khodarmanjari",
        "explanation": "After flowing through Uttarakhand, the river Yamuna enters the Sirmaur district of Himachal Pradesh at Khodarmanjari. Khodarmanjari is a location along the banks of the Yamuna river where it enters the state of Himachal Pradesh. It is an important point of entry for the river into Himachal Pradesh and marks the beginning of its journey through the state. The Yamuna river is a significant river in northern India and is revered as a sacred river in Hindu mythology."
    },
    {
        "questionId": 5,
        "questionType": "MCQ",
        "answer": "B) Pajhota Andolan",
        "explanation": "The movement started under the aegis of 'Kisan Sabha' in which Shri Lakshmi Singh and Vaid Surat Singh played a pivotal role was the Pajhota Andolan. Pajhota Andolan was a peasant movement that took place in the Pajhota region of Himachal Pradesh in the early 1940s. The movement was aimed at demanding the reduction of land revenue, abolition of begar (forced labor), and improvement of the living conditions of farmers. It was a significant agrarian struggle that highlighted the issues faced by farmers and played a crucial role in the socio-political awakening of the region."
    },
    {
        "questionId": 6,
        "questionType": "MCQ",
        "answer": "A) Praja Mandal Movement",
        "explanation": "'Democratisation of the Administration' was the main aim of the Praja Mandal Movement. The Praja Mandal Movement was a political movement that emerged in the princely states of India, including several regions in Himachal Pradesh, during the pre-independence era. It aimed to challenge the autocratic rule of the princely states and demanded greater participation of the people in the administration. The movement sought to establish democratic principles, representation, and accountable governance. It played a crucial role in the eventual integration of princely states into independent India and the establishment of democratic institutions."
    },
    {
        "questionId": 7,
        "questionType": "MCQ",
        "answer": "A) 1952",
        "explanation": "Himachal Pradesh got the right to participate in the election for the first time under the new constitution in 1952. With the adoption of the Constitution of India in 1950, the democratic framework was established, and elections were held to form representative bodies at various levels of government. In 1952, Himachal Pradesh, which was then a union territory, participated in its first elections, allowing the people of the region to exercise their right to vote and elect their representatives. This marked an important milestone in the democratic process and political history of Himachal Pradesh."
    },
    {
        "questionId": 8,
        "questionType": "MCQ",
        "answer": "C) Tabo",
        "explanation": "The Tabo Monastery was built by the Western Tibet ruler 'Ye-Sashoad' around the year 996 A.D. Tabo Monastery, also known as the 'Ajanta of the Himalayas,' is located in the Spiti Valley of Himachal Pradesh. It is one of the oldest functioning monasteries in the world and is renowned for its ancient murals, sculptures, and scriptures. The monastery is a significant center of Buddhist learning and a pilgrimage site for followers of the Tibetan Buddhist tradition. It holds immense historical and cultural importance in the region."
    },
    {
        "questionId": 9,
        "questionType": "MCQ",
        "answer": "B) Jagatsukh",
        "explanation": "Jagatsukh was the old capital of Kullu Rajas from where the twelve generations of Kullu Rajas ruled. Jagatsukh is a small village located in the Kullu district of Himachal Pradesh. It holds historical significance as it served as the capital of the Kullu Rajas in the past. The village is known for its ancient temples, including the Gaurishankar Temple and the Sandhya Gayatri Temple, which reflect the rich cultural and architectural heritage of the region. Jagatsukh is a popular tourist destination and attracts visitors for its serene surroundings and religious significance."
    },
    {
        "questionId": 10,
        "questionType": "MCQ",
        "answer": "A) Gurkha Army Chief Amar Singh Thapa",
        "explanation": "In 1804 A.D., the rulers of Bilaspur, Mandi, Chamba, and other small rulers of the Kangra area invited Gurkha Army Chief Amar Singh Thapa to invade Kangra. During that time, the Gurkhas had established their dominance in the hilly regions of Nepal and parts of present-day Himachal Pradesh. The rulers sought Amar Singh Thapa's assistance to counter the expanding influence of Maharaja Ranjit Singh of the Sikh Empire. This led to the invasion of Kangra by the Gurkha forces, resulting in a prolonged conflict and eventual defeat of the Gurkhas by the combined forces of the British and the Sikh Empire."
    },
    {
        "questionId": 11,
        "questionType": "MCQ",
        "answer": "A) Mr Lawerence",
        "explanation": "In 1848, Mr. Lawerence suppressed the rebellion of Wazir of Nurpur and then Pramod Chand and Rajas of Jaswan and Datarpur. Mr. Lawerence refers to Sir Henry Montgomery Lawrence, who was a British administrator and statesman during the British Raj in India. He played a significant role in the suppression of various rebellions and uprisings in different regions of India, including Himachal Pradesh. His efforts aimed at maintaining British control and restoring peace and order in the affected areas. Sir Henry Montgomery Lawrence is remembered for his administrative skills and contributions to British colonial rule in India."
    },
    {
        "questionId": 12,
        "questionType": "MCQ",
        "answer": "C) Shivratri",
        "explanation": "'Madho Rai ki Jaleb' is the main attraction of the Shivratri fair in Himachal Pradesh. Shivratri is a popular festival celebrated in honor of Lord Shiva, and it holds great religious and cultural significance in the state. The fair attracts a large number of devotees and tourists who come to witness the vibrant procession known as 'Madho Rai ki Jaleb.' The procession features beautifully decorated palanquins and chariots carrying idols of deities, accompanied by music, dance, and enthusiastic devotees. The Shivratri fair is a time of celebration, devotion, and cultural festivities in Himachal Pradesh."
    },
    {
        "questionId": 13,
        "questionType": "MCQ",
        "answer": "B) Pagoda",
        "explanation": "The architectural style of the temple built on the edge of the Prashar Lake is the Pagoda style. Pagoda is a distinctive architectural style commonly found in East Asia, characterized by multiple tiers of roofs with projecting eaves. The temple at Prashar Lake follows this style, featuring a multi-tiered roof structure with intricate woodwork and decorative elements. The Pagoda style is known for its elegance, symmetry, and aesthetic appeal. The temple's architectural design adds to the scenic beauty of the Prashar Lake area and attracts visitors from far and wide."
    },
    {
        "questionId": 14,
        "questionType": "MCQ",
        "answer": "D)  Kinnaur",
        "explanation": "'Dohru' is a traditional woollen dress worn by the women of Kinnaur district. Kinnaur is a district located in the eastern part of Himachal Pradesh. The Dohru is a significant part of the traditional attire of Kinnauri women. It is a long, full-sleeved woollen dress made from locally produced wool and intricately woven with colorful patterns. The Dohru not only serves as a protective garment against the cold weather but also reflects the cultural identity and heritage of the Kinnauri people. It is often adorned with decorative elements like embroidery, tassels, and motifs specific to the region."
    },
    {
        "questionId": 15,
        "questionType": "MCQ",
        "answer": "D)  450 MW",
        "explanation": "The approximate capacity of the 'Shontong Karcham' Hydro Electric Power Project is 450 MW. The Shontong Karcham Hydro Electric Power Project is a run-of-the-river hydropower plant located on the Sutlej River in Kinnaur district of Himachal Pradesh. It harnesses the power of flowing water to generate electricity. With a capacity of 450 MW, it is a significant power generation project in the region, contributing to the renewable energy sector and meeting the growing power demands. The project plays a crucial role in the overall development and energy infrastructure of Himachal Pradesh."
    },
    {
        "questionId": 16,
        "questionType": "MCQ",
        "answer": "B) Kibber in Lahaul-Spiti",
        "explanation": "The Central Government approved Rs. 80 lakh in 2011 for setting up a Snow Leopard centre in Kibber, Lahaul-Spiti district. Kibber is a village located in the high-altitude region of Lahaul-Spiti in Himachal Pradesh. The Snow Leopard centre was established to focus on conservation efforts and research related to the endangered Snow Leopard species. This funding allocation demonstrates the government's commitment to protecting and preserving the Snow Leopard population and their habitat in the region. Kibber's strategic location and its significance as a habitat for Snow Leopards make it an ideal choice for establishing the centre."
    },
    {
        "questionId": 17,
        "questionType": "MCQ",
        "answer": "B) 2013 (2013-14)",
        "explanation": "The government of Himachal Pradesh adopted the 'Rashtriya Uchtar Shiksha Abhiyan' (RUSA), a centrally sponsored scheme, in the year 2013 (2013-14) to improve the Gross Enrolment Ratio (GER) in Higher Education. RUSA is a flagship program of the Government of India aimed at providing strategic funding to higher education institutions and improving the overall quality of higher education in the country. By adopting RUSA, the government of Himachal Pradesh demonstrated its commitment to enhancing access, equity, and excellence in higher education, thereby encouraging more students to enroll and pursue higher education in the state."
    },
    {
        "questionId": 18,
        "questionType": "MCQ",
        "answer": "A) Dr Y.S Parmar",
        "explanation": "The author of the book 'Polyandry in the Himalayas' is Dr Y.S Parmar. Dr Y.S Parmar was a prominent leader and the first Chief Minister of Himachal Pradesh. While he is known for his significant contributions in the field of politics and governance, he also had an interest in writing and research. 'Polyandry in the Himalayas' explores the practice of polyandry, a unique marital system found in certain regions of the Himalayas, including Himachal Pradesh. The book delves into the cultural, social, and historical aspects of polyandry and provides insights into the lives of the people who follow this custom."
    },
    {
        "questionId": 19,
        "questionType": "MCQ",
        "answer": "C) Durand Cup",
        "explanation": "The famous football tournament that was started in 1888 from Annadale is the Durand Cup. The Durand Cup is one of the oldest football tournaments in the world and has a rich history in Indian football. It was initiated by Sir Henry Mortimer Durand, the then Foreign Secretary of British India, and was initially held in Shimla, Himachal Pradesh. Over the years, the tournament has gained prominence and is now played in various cities across India. The Durand Cup is highly regarded in the Indian football circuit and continues to be a prestigious competition."
    },
    {
        "questionId": 20,
        "questionType": "MCQ",
        "answer": "B) Dutch",
        "explanation": "The Mushroom Development Project in Palampur was launched in 1985 with the introduction of the technology from the Netherlands (Dutch). The project aimed to promote the cultivation and commercialization of mushrooms in Himachal Pradesh. The Dutch technology brought innovative and efficient methods of mushroom farming, including improved techniques for cultivation, processing, and marketing. The project played a crucial role in diversifying the agricultural sector and generating employment opportunities. It contributed to the socio-economic development of the region and helped establish Himachal Pradesh as a significant hub for mushroom production in India."
    },
    {
        "questionId": 21,
        "questionType": "MCQ",
        "answer": "B) 12.9%",
        "explanation": "The approximate decadal population growth rate of Himachal Pradesh in the census 2011 was 12.9%. The decadal population growth rate refers to the percentage increase in population over a period of ten years. Himachal Pradesh witnessed a relatively moderate population growth rate during this period, indicating a steady but not excessive increase in its population. This growth rate is influenced by various factors such as birth rates, death rates, migration patterns, and government policies. Monitoring population growth rates is essential for understanding demographic trends and formulating effective development plans and policies."
    },
    {
        "questionId": 22,
        "questionType": "MCQ",
        "answer": "C) 7% – 7.5%",
        "explanation": "India's estimated GDP growth rate for 2018-19 in the Economic Survey was 7% - 7.5%. The Economic Survey is an annual report prepared by the Government of India that presents the state of the country's economy, including key economic indicators and growth projections. The estimated GDP growth rate indicates the expected rate of expansion of India's economy during that particular fiscal year. A growth rate of 7% - 7.5% reflects a strong and robust economic performance, showcasing India's potential for sustainable growth and development. It signifies the overall health and progress of the Indian economy during that period."
    },
    {
        "questionId": 23,
        "questionType": "MCQ",
        "answer": "B) 7.1%",
        "explanation": "The Index of Industrial Production (IIP) in December 2017 was 7.1%. The IIP is an important economic indicator that measures the growth in the production output of various industrial sectors within a specific time period. A higher IIP indicates a higher level of industrial activity and production. The 7.1% IIP in December 2017 suggests a positive growth in industrial production during that month. This signifies an expansion in manufacturing, mining, and electricity generation sectors, which are essential components of the industrial sector and contribute to overall economic growth."
    },
    {
        "questionId": 24,
        "questionType": "MCQ",
        "answer": "D)",
        "explanation": "The correct poverty estimates for Arunachal Pradesh, Bihar, Chhatisgarh, Manipur in 2011-12, as per the Planning Commission, are 34.7%, 33.7%, 33.9%, and 36.9% respectively."
    },
    {
        "questionId": 25,
        "questionType": "MCQ",
        "answer": "C) Tomato Onion Potato",
        "explanation": "'Operation Green' is related to the promotion and development of the Tomato Onion Potato (TOP) crops. It aims to stabilize the prices of these perishable crops and ensure their availability throughout the year."
    },
    {
        "questionId": 26,
        "questionType": "MCQ",
        "answer": "A) Indu Malhotra",
        "explanation": "The first woman advocate whose name has been recommended by the collegium to become a Judge of the Supreme Court of India is Indu Malhotra. Indu Malhotra is a renowned lawyer and legal professional who has made significant contributions to the field of law. She has had a successful career representing clients in various legal matters and has also been involved in several landmark cases. Her nomination as a Judge of the Supreme Court of India marks a significant milestone for gender representation and women's empowerment in the Indian judiciary."
    },
    {
        "questionId": 27,
        "questionType": "MCQ",
        "answer": "C) 10 lakh – 1 crore",
        "explanation": "Under the 'Stand-up India' initiative, a bank account is made available to Dalits and Women with a loan amount ranging from 10 lakh to 1 crore. 'Stand-up India' is a scheme launched by the Government of India to promote entrepreneurship among marginalized sections of society, particularly Dalits and Women. The objective of the scheme is to provide financial support and assistance in the form of bank loans to facilitate the establishment of greenfield enterprises. The loan amount provided under 'Stand-up India' is intended to enable Dalits and Women to start and grow their own businesses and become self-reliant."
    },
    {
        "questionId": 28,
        "questionType": "MCQ",
        "answer": "A) Mission Rainbow",
        "explanation": "The immunization of all children by 2020 is related to 'Mission Rainbow'. 'Mission Rainbow' is a government initiative aimed at achieving full immunization coverage for all children in India by the year 2020. The mission focuses on ensuring that every child receives all the recommended vaccines to protect them from preventable diseases. Immunization plays a crucial role in safeguarding children's health, preventing the spread of infectious diseases, and reducing child mortality rates. 'Mission Rainbow' emphasizes the importance of immunization as a key component of child healthcare and aims to create a healthier future for the children of India."
    },
    {
        "questionId": 29,
        "questionType": "MCQ",
        "answer": "B) 51%",
        "explanation": "According to the Global Nutrition Report 2017, 51% of females in India suffered from anaemia. Anaemia is a condition characterized by a deficiency of red blood cells or a low level of hemoglobin in the blood. It is a major public health concern in India, particularly among women and children. The high prevalence of anaemia among females can have significant health implications, including fatigue, weakness, and increased vulnerability to infections. Addressing anaemia is crucial for improving the overall health and well-being of women in India and requires targeted interventions and awareness programs."
    },
    {
        "questionId": 30,
        "questionType": "MCQ",
        "answer": "C) 1.38 lakh crore",
        "explanation": "The estimated social sector expenditure in the budget 2018-19 is 1.38 lakh crore. Social sector expenditure refers to the allocation of funds by the government for various social welfare programs and initiatives aimed at improving the well-being and quality of life of its citizens. These expenditures encompass sectors such as education, healthcare, social security, and poverty alleviation. The allocation of a significant amount of 1.38 lakh crore indicates the government's commitment to addressing social issues and promoting inclusive development in the country. It reflects the priority given to social welfare and the enhancement of social infrastructure."
    },
    {
        "questionId": 31,
        "questionType": "MCQ",
        "answer": "C) 10 crore and Rs 5 lakh",
        "explanation": "Under the Ayushman Bharat Yojana in 2018-19, 10 crore poor families were provided with medical insurance of Rs 5 lakh per family. The Ayushman Bharat Yojana, also known as the Pradhan Mantri Jan Arogya Yojana (PMJAY), is a flagship healthcare program launched by the Government of India. It aims to provide financial protection to economically vulnerable families by offering health insurance coverage for secondary and tertiary healthcare services. The coverage of Rs 5 lakh per family ensures access to quality healthcare without financial burden, significantly benefiting millions of underprivileged households across the country."
    },
    {
        "questionId": 32,
        "questionType": "MCQ",
        "answer": "D)  100",
        "explanation": "Under the Swachh Bharat Abhiyan, people are expected to contribute 100 hours per year for cleanliness. The Swachh Bharat Abhiyan, also known as the Clean India Mission, is a nationwide campaign initiated by the Government of India to promote cleanliness, hygiene, and sanitation practices. It aims to achieve the vision of a clean and open defecation-free India. The participation of individuals in contributing 100 hours per year towards cleanliness showcases the collective effort required to bring about a significant change in the cleanliness standards of the country. It emphasizes the importance of community involvement and individual responsibility in maintaining cleanliness."
    },
    {
        "questionId": 33,
        "questionType": "list",
        "answer": "B) (P-iv), (Q-i), (R-ii), (S-iii)",
        "explanation": "The correct matching of items given in Column I and II is: (P) Montreal Protocol - (iv) Total Elimination of Ozone Depleting Substances, (Q) Vienna Convention - (i) Protection of Ozone Layer, (R) Kyoto Protocol - (ii) Stabilization of Greenhouse Gases, and (S) Earth Summit - (iii) Environment and Sustainable Development. The Montreal Protocol aims to phase out the production and use of ozone-depleting substances, the Vienna Convention focuses on protecting the ozone layer, the Kyoto Protocol aims to stabilize greenhouse gas concentrations in the atmosphere, and the Earth Summit addresses various environmental and sustainable development issues. This matching reflects the objectives and scope of each international agreement or summit."
    },
    {
        "questionId": 34,
        "questionType": "statements",
        "answer": "C) only 2",
        "explanation": "In the context of the environment, the term 'dirty dozen' refers to 12 persistent organic pollutants. Persistent organic pollutants (POPs) are toxic chemicals that persist in the environment, bioaccumulate in living organisms, and pose a threat to human health and the Environment The 'dirty dozen' includes substances such as DDT, PCBs, dioxins, and furans, which are highly resistant to degradation and can cause serious harm. These pollutants have been targeted for international regulation and control due to their widespread presence and harmful effects. Therefore, the correct statement is that the term 'dirty dozen' refers to 12 persistent organic pollutants."
    },
    {
        "questionId": 35,
        "questionType": "MCQ",
        "answer": "A) Developing countries",
        "explanation": "The vast majority of biodiversity occurs in developing countries. Developing countries are often characterized by rich and diverse ecosystems, including tropical rainforests, coral reefs, and other unique habitats that support a wide array of plant and animal species. These regions are known as biodiversity hotspots and are crucial for global biodiversity conservation. Developing countries are home to a significant portion of the world's biodiversity, highlighting the importance of conservation efforts in these areas. Protecting and preserving biodiversity in developing countries is essential for maintaining the planet's ecological balance and ensuring the survival of numerous species."
    },
    {
        "questionId": 36,
        "questionType": "MCQ",
        "answer": "B) Pandurang Hegde",
        "explanation": "The \"Appiko Movement\" was led by Pandurang Hegde. The Appiko Movement, also known as the Chipko Movement of Karnataka, was an environmental movement that originated in the state of Karnataka, India. The movement aimed to protect the forests from deforestation and promote sustainable forest management. The term \"Appiko\" means \"embrace\" or \"hug\" in the Kannada language, symbolizing the villagers' act of hugging the trees to prevent them from being cut down. Pandurang Hegde played a significant role in mobilizing local communities and raising awareness about the importance of forest conservation."
    },
    {
        "questionId": 37,
        "questionType": "MCQ",
        "answer": "C) 2.5%",
        "explanation": "Freshwater present on Earth is approximately 2.5% of the total water available. The majority of Earth's water is in the form of saltwater in the oceans, accounting for about 97.5%. Freshwater is essential for various life forms, including humans, animals, and plants. However, only a small percentage of the total water supply is freshwater, and out of that, a significant portion is locked in ice caps, glaciers, and underground aquifers. The availability of freshwater resources is crucial for sustaining ecosystems, supporting agriculture, and meeting the needs of human populations around the world."
    },
    {
        "questionId": 38,
        "questionType": "MCQ",
        "answer": "D) Cement",
        "explanation": "Laborers working in the cement industry are most prone to Cytosilicosis disease. Cytosilicosis, also known as silicosis, is a lung disease caused by the inhalation of crystalline silica dust. Workers in the cement industry are at a higher risk of developing this disease due to their exposure to silica dust during various processes such as mining, crushing, grinding, and handling of raw materials containing silica. Silica dust particles, when inhaled, can cause lung inflammation and scarring, leading to respiratory problems and other health complications. It is important to implement proper safety measures and protective equipment to prevent the risk of Cytosilicosis in cement industry workers."
    },
    {
        "questionId": 39,
        "questionType": "list",
        "answer": "C) (P-iv) (Q-iii) (R-ii) (S-i)",
        "explanation": "The correct match for the items in Column I and Column II is (P-iv) (Q-iii) (R-ii) (S-i). The Biological Diversity Act was enacted in 2002 (iv) to provide for the conservation, sustainable use, and equitable sharing of biological resources. The E-Waste (Management and Handling) Rules were formulated in 2011 (iii) to regulate the management and disposal of electronic waste. The Hazardous Wastes (Management, Handling and Trans-boundary) Rules were introduced in 2008 (ii) to regulate the management and handling of hazardous wastes. The Municipal Solid Wastes (Management and Handling) Rules were implemented in 2000 (i) to regulate the management and handling of solid waste in urban areas."
    },
    {
        "questionId": 40,
        "questionType": "MCQ",
        "answer": "B) 1975",
        "explanation": "The \"Project Crocodile\" was launched in India in the year 1975 (B). It was a conservation program aimed at protecting and conserving the endangered crocodile species, especially the Indian crocodile, also known as the mugger crocodile. The project involved the establishment of specialized breeding and conservation centers, habitat protection, and public awareness campaigns to safeguard the crocodile population. Through the efforts of Project Crocodile, the population of crocodiles in India has witnessed a significant recovery."
    },
    {
        "questionId": 41,
        "questionType": "MCQ",
        "answer": "C) Nuclear reactors",
        "explanation": "The correct answer is C) Nuclear reactors. Nuclear energy is a non-renewable energy source. Unlike solar and wind energy, which are renewable and derive power from natural resources such as sunlight and wind, nuclear energy is generated through the process of nuclear fission in nuclear reactors. Nuclear reactors use uranium or plutonium as fuel, and these resources are finite and non-renewable. Once the fuel is consumed, it cannot be replenished. Therefore, nuclear energy is classified as a non-renewable source of energy."
    },
    {
        "questionId": 42,
        "questionType": "MCQ",
        "answer": "B) Litre",
        "explanation": "The correct answer is B) Litre. The fundamental units in the International System of Units (SI) are meter, kilogram, second, ampere, kelvin, mole, and candela. These units are considered fundamental because they are base units from which all other units are derived. The liter, on the other hand, is a derived unit of volume in the SI system. It is equal to 1 cubic decimeter, and its symbol is 'L'. While the liter is widely used in everyday life for measuring liquids, it is not considered a fundamental unit."
    },
    {
        "questionId": 43,
        "questionType": "MCQ",
        "answer": "C) Mercury",
        "explanation": "The correct answer is C) Mercury. Mercury is the liquid used in a clinical thermometer. Mercury is a heavy, silvery metal that is liquid at room temperature. It has a high coefficient of expansion, which means it expands and contracts significantly with changes in temperature. This property makes it suitable for use in thermometers to measure body temperature. However, due to the toxic nature of mercury, alternative substances like alcohol or digital thermometers are now commonly used in place of mercury thermometers."
    },
    {
        "questionId": 44,
        "questionType": "MCQ",
        "answer": "A) Erect and diminished",
        "explanation": "The correct answer is A) Erect and diminished. A convex mirror is a curved mirror that bulges outward. When an object is placed in front of a convex mirror, the reflected rays diverge or spread out. As a result, the image formed by a convex mirror is virtual, erect (upright), and diminished in size. The image appears smaller than the actual object. Convex mirrors are commonly used as side-view mirrors in vehicles to provide a wider field of view."
    },
    {
        "questionId": 45,
        "questionType": "MCQ",
        "answer": "D) Sun",
        "explanation": "The correct answer is D) Sun. The Sun is a renewable source of energy. It provides us with abundant solar energy that can be harnessed and converted into various forms of usable energy, such as solar power and solar thermal energy. Solar power is generated by using photovoltaic cells to convert sunlight directly into electricity, while solar thermal energy is obtained by capturing the heat from the Sun and using it for heating or generating electricity. Unlike fossil fuels such as coal and natural gas, which are finite and non-renewable, the Sun's energy is continuously available and will not deplete over time."
    },
    {
        "questionId": 46,
        "questionType": "MCQ",
        "answer": "D) Increase in sea levels",
        "explanation": "The correct answer is D) Increase in sea levels. Global warming, primarily caused by the accumulation of greenhouse gases in the atmosphere, has led to the melting of glaciers and polar ice caps. This melting ice contributes to the rise in sea levels worldwide. As the Earth's temperature increases, the ice melts, adding more water to the oceans and causing sea levels to rise. This phenomenon poses significant challenges to coastal communities, as higher sea levels can lead to coastal erosion, increased flooding, and the displacement of populations living in low-lying areas."
    },
    {
        "questionId": 47,
        "questionType": "MCQ",
        "answer": "C) Chloroplast",
        "explanation": "The correct answer is C) Chloroplast. Photosynthesis is the process by which plants, algae, and some bacteria convert light energy into chemical energy to produce glucose and release oxygen. This process takes place in the chloroplasts, which are specialized organelles found in plant cells. Chloroplasts contain a pigment called chlorophyll, which absorbs light energy and initiates the photosynthetic reaction. Inside the chloroplasts, the light-dependent reactions occur in the thylakoid membranes, and the light-independent reactions (Calvin cycle) occur in the stroma. Through photosynthesis, plants play a vital role in converting sunlight into usable energy and producing oxygen as a byproduct."
    },
    {
        "questionId": 48,
        "questionType": "MCQ",
        "answer": "C) Bone marrow",
        "explanation": "The correct answer is C) Bone marrow. Red blood cells (RBCs), also known as erythrocytes, are formed in the bone marrow. Bone marrow is a soft, spongy tissue found inside certain bones, such as the sternum, ribs, pelvis, and long bones. It is responsible for the production of various types of blood cells, including RBCs. The process of RBC formation is known as erythropoiesis. In the bone marrow, stem cells called hematopoietic stem cells differentiate and mature into RBCs under the influence of the hormone erythropoietin. RBCs play a crucial role in transporting oxygen to tissues and removing carbon dioxide from the body."
    },
    {
        "questionId": 49,
        "questionType": "MCQ",
        "answer": "A) Vitamin A",
        "explanation": "The correct answer is A) Vitamin A. Rataundhi, also known as night blindness, is a condition characterized by difficulty seeing in low light or at night. It is primarily caused by a deficiency of Vitamin A. Vitamin A plays a crucial role in maintaining good vision, particularly in dim light conditions. It is essential for the proper functioning of the retina, which is responsible for converting light into nerve signals that are sent to the brain for visual perception. A deficiency of Vitamin A can lead to impaired vision, especially in low light situations, and can be addressed by consuming foods rich in Vitamin A or taking Vitamin A supplements."
    },
    {
        "questionId": 50,
        "questionType": "MCQ",
        "answer": "B) Soft iron",
        "explanation": "The correct answer is B) Soft iron. The core of a transformer is made of soft iron. Soft iron is preferred for transformer cores due to its high magnetic permeability, which allows it to efficiently conduct magnetic flux. The core serves as a pathway for the magnetic field generated by the primary winding of the transformer, enabling the transfer of energy between the primary and secondary windings. Soft iron has the ability to magnetize and demagnetize quickly, making it suitable for transformers where the magnetic field needs to alternate rapidly. Its high magnetic permeability also helps minimize energy losses in the transformer."
    },
    {
        "questionId": 51,
        "questionType": "MCQ",
        "answer": "C) Platelets",
        "explanation": "The correct answer is C) Platelets. During Dengue fever, the platelet count in the body decreases significantly. Platelets are responsible for blood clotting and preventing excessive bleeding. In Dengue fever, the virus affects the bone marrow, where platelets are produced, leading to a decrease in their count. This condition is known as thrombocytopenia. It is important to monitor and manage platelet levels in Dengue fever patients to prevent complications such as bleeding. Adequate hydration and medical intervention are necessary to support platelet recovery."
    },
    {
        "questionId": 52,
        "questionType": "MCQ",
        "answer": "D) All of the above",
        "explanation": "The correct answer is D) All of the above. In 2017, the Nobel Prize for Chemistry was awarded jointly to Joachim Frank, Jacques Dubochet, and Richard Henderson. They were recognized for their contributions to the development of cryo-electron microscopy, a technique used to visualize biomolecules in high resolution. Joachim Frank developed the image processing method, Jacques Dubochet contributed to the development of vitrification of water to preserve biomolecules, and Richard Henderson pioneered the use of electron microscopy to determine the structure of proteins. Their work revolutionized the field of structural biology and opened up new possibilities for studying complex molecular structures."
    },
    {
        "questionId": 53,
        "questionType": "MCQ",
        "answer": "A) Garbine Muguruza",
        "explanation": "The correct answer is A) Garbine Muguruza. In 2017, Garbine Muguruza won the Women's Singles Wimbledon tournament. She defeated Venus Williams in the final with a score of 7-5, 6-0. It was Muguruza's second Grand Slam title, following her victory at the French Open in 2016. Muguruza's powerful game and aggressive playing style helped her claim the Wimbledon title and establish herself as one of the top players in women's tennis."
    },
    {
        "questionId": 54,
        "questionType": "MCQ",
        "answer": "B) Halimah Yacob",
        "explanation": "The correct answer is B) Halimah Yacob. Halimah Yacob became the first female President of Singapore. She was elected as the President in 2017 and took office on September 14, 2017. Halimah Yacob had previously served as the Speaker of the Parliament of Singapore. Her election as the President marked a significant milestone in Singapore's history, as she became the first woman to hold the highest office in the country."
    },
    {
        "questionId": 55,
        "questionType": "MCQ",
        "answer": "A) He is elected leader of Canada’s New Democratic Party",
        "explanation": "The correct answer is A) He is elected leader of Canada’s New Democratic Party. Jagmeet Singh is a Canadian politician who was elected as the leader of Canada’s New Democratic Party (NDP) in 2017. He became the first person of a visible minority background to lead a major federal political party in Canada. Singh's election as the NDP leader gained significant media attention and made headlines both nationally and internationally."
    },
    {
        "questionId": 56,
        "questionType": "MCQ",
        "answer": "D) All of the above",
        "explanation": "The correct answer is D) All of the above. The Hambantota Port in Sri Lanka has been in the news in 2017 due to multiple reasons. Firstly, the majority stakes of the port were sold to China, which raised concerns about Chinese influence and control over strategic assets. Secondly, the port is strategically located and straddles the world's busiest east-west shipping route, making it significant for global trade and maritime activities. Lastly, China's involvement in the development of the port and its expansion in the region created worries for India in terms of security and geopolitical implications."
    },
    {
        "questionId": 57,
        "questionType": "MCQ",
        "answer": "A) M. Surabhi",
        "explanation": "The correct answer is A) M. Surabhi. She was awarded the Best Actress award in the 64th National Film Awards function. The National Film Awards are prestigious awards in India that recognize excellence in the Indian film industry. M. Surabhi's outstanding performance in a film led her to receive this recognition as the Best Actress. The specific film and her notable contribution were not mentioned in the question."
    },
    {
        "questionId": 58,
        "questionType": "list",
        "answer": "B) (a-iii) (b-iv) (c-ii) (d-i)",
        "explanation": "The correct answer is B) (a-iii) (b-iv) (c-ii) (d-i). The matching pairs are as follows: Sachidanand Vatsyayan (I) - Hindi Poet (iii), Aryabhatta (II) - Astronomer (iv), Ayyankali (III) - Harijan leader (ii), Fatima Beevi (IV) - Judge (i). Sachidanand Vatsyayan is known for his contributions to Hindi poetry, Aryabhatta was an ancient Indian mathematician and astronomer, Ayyankali was a social reformer and leader of the lower-caste community, and Fatima Beevi was the first female judge of the Supreme Court of India."
    },
    {
        "questionId": 59,
        "questionType": "MCQ",
        "answer": "C) Sachin Tendulkar",
        "explanation": "Sachin Tendulkar, the renowned cricketer from India, has been honoured with the prestigious 'Bharat Ratna' award, the highest civilian award in India, for his exceptional contribution to the sport of cricket."
    },
    {
        "questionId": 60,
        "questionType": "MCQ",
        "answer": "D) K.Sivan",
        "explanation": "K.Sivan has been appointed as the new Chairman of the Indian Space Research Organisation (ISRO). He is a renowned space scientist and has made significant contributions to various ISRO missions."
    },
    {
        "questionId": 61,
        "questionType": "MCQ",
        "answer": "C) Granville Austin",
        "explanation": "The correct answer is C) Granville Austin. Granville Austin, an American political scientist and author, made the statement that 'The Constituent Assembly was a one party body in The Assembly was the Congress and the Congress was India'. This statement highlights the dominant role of the Indian National Congress in the Constituent Assembly of India, which was responsible for drafting the Indian Constitution. Granville Austin is well-known for his extensive research and analysis of the Indian Constitution and its making."
    },
    {
        "questionId": 62,
        "questionType": "list",
        "answer": "B) (a-iv) (b-iii) (c-ii) (d-i)",
        "explanation": "The correct match between List-I (Books) and List-II (Authors) is as follows: l. The Child and the State in India - iv. Myron Weiner, II. The Hindu Nationalist Movement and Indian Politics - iii. Christopher Jaferlot, Ill. The Political Economy of Development in India - ii. Pranab Bardhan, IV. Poverty Amid Plenty in the New India - i. Atul Kohli"
    },
    {
        "questionId": 63,
        "questionType": "MCQ",
        "answer": "A) Keshavanand Bharti case",
        "explanation": "The correct answer is A) Keshavananda Bharti case. In the Keshavananda Bharti case, the Supreme Court of India established the doctrine of 'Basic Structure' of the constitution. This doctrine holds that there are certain fundamental features or principles of the constitution that cannot be amended by the Parliament. These essential features form the basic structure of the constitution and provide a framework for the functioning of the Indian democracy. The Keshavananda Bharti case is a landmark judgment that has had a significant impact on constitutional law in India."
    },
    {
        "questionId": 64,
        "questionType": "MCQ",
        "answer": "D) Karnataka, Tamil Nadu, Kerala and Puducherry",
        "explanation": "The correct answer is D) Karnataka, Tamil Nadu, Kerala, and Puducherry. The Cauvery river dispute involves these states and union territory. The dispute is primarily between Karnataka and Tamil Nadu over the sharing of Cauvery river water. Both states have been involved in legal battles and negotiations to resolve the issue. Kerala and Puducherry are also affected by the dispute as they are located downstream and receive water from the Cauvery river. The Cauvery river dispute is a longstanding and complex issue with significant political, social, and economic implications."
    },
    {
        "questionId": 65,
        "questionType": "MCQ",
        "answer": "A) Reservations for OBCs",
        "explanation": "The correct answer is A) Reservations for OBCs. The Supreme Court's judgment in the Indira Sawhney vs. Union of India case deals with the issue of reservations for Other Backward Classes (OBCs) in government jobs and educational institutions. The case challenged the implementation of reservations for OBCs and raised questions about the extent and criteria for providing reservation benefits. The Supreme Court's judgment in this case laid down important guidelines and principles regarding reservations for OBCs, including the concept of creamy layer exclusion and the overall reservation limit."
    },
    {
        "questionId": 66,
        "questionType": "list",
        "answer": "B) (a-ii) (b-iv) (c-i) (d-iii)",
        "explanation": "The correct answer is B) (a-ii) (b-iv) (c-i) (d-iii). In the context of Panchayati Raj Committees, the matching is as follows: (a) H. Hanumantha Rao - 1984, (b) V.K. Rao - 1985, (c) Ashok Mehta - 1978, (d) M. Singhvi - 1986. Each person listed in List-I corresponds to the respective year mentioned in List-II. Therefore, the correct answer is option B."
    },
    {
        "questionId": 67,
        "questionType": "MCQ",
        "answer": "C) N. N. Vohra committee",
        "explanation": "The correct answer is C) N. N. Vohra committee. The N. N. Vohra committee is not associated with electoral reforms in India. The Tarkunde Committee, Dinesh Goswami Committee, and Indrajit Gupta Committee are all known for their contributions to electoral reforms in the country. The N. N. Vohra committee, on the other hand, was formed to examine issues related to criminalization of politics and suggest measures to address them. Therefore, option C is the correct answer."
    },
    {
        "questionId": 68,
        "questionType": "MCQ",
        "answer": "D) Raj Krishna",
        "explanation": "The correct answer is D) Raj Krishna. Raj Krishna, an eminent economist, described Indian Capitalism as 'Dharmshala Capitalism'. He used this term to emphasize the close relationship between business and religion in the Indian context. According to Raj Krishna, Indian capitalists often engage in philanthropic activities and provide welfare support, similar to the services provided by Dharmshalas (rest houses for pilgrims). This term highlights the unique characteristics of Indian capitalism and its connection to cultural and religious practices."
    },
    {
        "questionId": 69,
        "questionType": "statements",
        "answer": "B) (i), (iii), and (iv)",
        "explanation": "The correct answer is B) (i), (iii), and (iv). Statutory bodies are institutions or organizations that are established and governed by specific legislation or statutes. They have a legal mandate and authority to perform certain functions and make decisions. In this case, the University Grants Commission, Railway Board, and Atomic Energy Commission are all statutory bodies as they are created and regulated by specific laws. The Official Language Commission, on the other hand, may or may not be a statutory body depending on the specific context and legislation."
    },
    {
        "questionId": 70,
        "questionType": "MCQ",
        "answer": "A) Jawaharlal Nehru was the Prime Minister/Head of the Executive Council",
        "explanation": "The correct answer is A) Jawaharlal Nehru was the Prime Minister/Head of the Executive Council. In the Interim Government of 1946, Jawaharlal Nehru was not the Prime Minister or the Head of the Executive Council. Instead, he was designated as the Vice-President of the Viceroy's Executive Council. The viceroy, Lord Wavell, continued to be the Head of the Executive Council. The members of the Interim Government were not members of the Viceroy's Executive Council but were appointed separately."
    },
    {
        "questionId": 71,
        "questionType": "MCQ",
        "answer": "A) Granville Austin",
        "explanation": "The correct answer is A) Granville Austin. Granville Austin, an American political scientist and constitutional expert, described Indian federalism as 'a new kind of federation to meet India's peculiar needs'. He extensively studied the Indian Constitution and its federal structure, highlighting its unique features and the challenges it addresses. Austin's work has been influential in understanding and analyzing the dynamics of Indian federalism."
    },
    {
        "questionId": 72,
        "questionType": "MCQ",
        "answer": "B) Punjab",
        "explanation": "The Adi Ambedkar Samaj movement is related to the state of Punjab. It is a social movement inspired by the teachings and principles of Dr. B.R. Ambedkar, a prominent social reformer and the architect of the Indian Constitution. The movement aims to promote social equality, upliftment of marginalized communities, and eradication of caste-based discrimination. It focuses on empowering Dalits and advocating for their rights and social justice. Punjab has been an active center for various social and political movements, including those related to social reform and the rights of marginalized communities."
    },
    {
        "questionId": 73,
        "questionType": "MCQ",
        "answer": "B) 1964",
        "explanation": "The Communist Party of India (Marxist) emerged as a separate political party in the year 1964. Prior to that, it was a faction within the Communist Party of India (CPI). The split occurred due to ideological differences and disagreements over the party's approach towards parliamentary democracy and its alliance with other political parties. The CPI(M) was formed with a focus on Marxist ideology and a more independent political strategy. Since its formation, the CPI(M) has played a significant role in Indian politics, particularly in states like West Bengal, Kerala, and Tripura."
    },
    {
        "questionId": 74,
        "questionType": "MCQ",
        "answer": "A) Rajni Kothari",
        "explanation": "Rajni Kothari, an eminent political scientist and scholar, described the critical and creative role of politics in India as 'the Indian model of development'. He emphasized the significance of politics in shaping India's development trajectory, highlighting the complex dynamics between political processes, social structures, and economic outcomes. Kothari's work focused on understanding the unique features of Indian politics and its impact on the country's development path. His insights and analysis have contributed to the field of political science and our understanding of India's political and developmental landscape."
    },
    {
        "questionId": 75,
        "questionType": "list",
        "answer": "B) (a-iv) (b-iii) (c-ii) (d-i)",
        "explanation": "The correct match between List-I and List-II is (a-iv) (b-iii) (c-ii) (d-i). The Millennium Development event is matched with the year 2011, the National Commission for Women is matched with the year 2006, the Ministry of Women and Child Development is matched with the year 1992, and the National Mission for Empowerment of Women is matched with the year 2010. This combination provides the accurate correspondence between the events and the respective years."
    },
    {
        "questionId": 76,
        "questionType": "MCQ",
        "answer": "D) 1919",
        "explanation": "The Montague-Chelmsford Reforms were introduced in India in the year 1919. These reforms were a significant step towards granting more self-governance to India under British rule. They established a dual system of government, with a partial transfer of power to Indian representatives through the introduction of the provincial legislative councils and the expansion of central legislative councils. The reforms aimed to increase Indian participation in the legislative process and provide limited autonomy in certain areas. They laid the foundation for further constitutional developments in India. "
    },
    {
        "questionId": 77,
        "questionType": "MCQ",
        "answer": "C) Mhow",
        "explanation": "B.R. Ambedkar was born in Mhow, which is now known as Dr. Ambedkar Nagar, in the Indore district of Madhya Pradesh, India. Mhow is a small cantonment town located in central India. It was here that Dr. Ambedkar, who played a significant role in drafting the Constitution of India and advocating for the rights of marginalized communities, spent his early years. Mhow holds historical importance as the birthplace of one of India's most influential social reformers and leaders. "
    },
    {
        "questionId": 78,
        "questionType": "MCQ",
        "answer": "B) A)V. Thakkar",
        "explanation": "A.V. Thakkar, also known as Thakkar Bapa, worked for tribal upliftment in India. He was a prominent Gandhian leader and social worker who dedicated his life to the welfare of tribal communities. Thakkar Bapa believed in Mahatma Gandhi's philosophy of nonviolence and self-reliance. He established several ashrams and institutions to uplift the tribal communities and empower them through education, healthcare, and economic development. Thakkar Bapa's efforts contributed significantly to the upliftment and empowerment of tribal populations in various regions of India. "
    },
    {
        "questionId": 79,
        "questionType": "MCQ",
        "answer": "A) V.D) Savarkar",
        "explanation": "V.D. Savarkar was never associated with the Indian National Congress. He was a prominent leader of the Hindu nationalist movement and a proponent of Hindutva ideology. Savarkar played a significant role in the Indian independence movement, but he had ideological differences with the Indian National Congress and its approach towards achieving independence. Instead, he was associated with organizations such as the Hindu Mahasabha, which advocated for the interests of the Hindu community. Savarkar's political philosophy and vision differed from the Congress's approach of inclusive nationalism. "
    },
    {
        "questionId": 80,
        "questionType": "MCQ",
        "answer": "D) M.R. Jaiyakar",
        "explanation": "M.R. Jaiyakar was not a socialist leader. The other options mentioned, Ram Manohar Lohiya, Jaiprakash Narain, and S.C. Bose, were all notable socialist leaders in India. Ram Manohar Lohiya was a socialist political leader and a proponent of the socialist ideology. Jaiprakash Narain, popularly known as JP, was a prominent socialist leader and played a crucial role in the Indian independence movement as well as the opposition to the emergency imposed in India in the 1970s. S.C. Bose, also known as Netaji, was a nationalist leader and a socialist by ideology. However, M.R. Jaiyakar was not known for his association with socialist principles. "
    },
    {
        "questionId": 81,
        "questionType": "MCQ",
        "answer": "A) Hindu Code Bill",
        "explanation": "Dr. B.R. Ambedkar drafted the Hindu Code Bill as the first Law Minister of India. The Hindu Code Bill was a landmark legislation aimed at reforming and codifying Hindu personal laws related to marriage, divorce, inheritance, and adoption. It sought to modernize and bring gender equality to these aspects of Hindu law. The bill faced significant opposition and debates but eventually paved the way for important social reforms in the country. "
    },
    {
        "questionId": 82,
        "questionType": "MCQ",
        "answer": "A) Basalt",
        "explanation": "Basalt is an igneous rock that has the highest density among the options given. Basalt is formed from the solidification of lava and is characterized by its fine-grained texture. It is composed mainly of minerals such as pyroxene, plagioclase feldspar, and sometimes olivine. The high density of basalt can be attributed to its mineral composition and the compactness of its structure. Basalt is commonly found in volcanic regions and is widely used in construction and as a source of crushed stone. "
    },
    {
        "questionId": 83,
        "questionType": "MCQ",
        "answer": "A) Slate-Sandstone",
        "explanation": "The answer A) Slate-Sandstone is not correctly matched. Slate and sandstone are two different types of rocks with distinct characteristics. Slate is a fine-grained metamorphic rock that forms from the metamorphism of shale or mudstone. It has a layered structure and splits easily into thin sheets. On the other hand, sandstone is a sedimentary rock composed of sand-sized grains held together by a cementing material. It is coarser in texture compared to slate. The correct match for slate would be shale, which is its parent rock. "
    },
    {
        "questionId": 84,
        "questionType": "MCQ",
        "answer": "A) Earth",
        "explanation": "The answer is A) Earth. Earth has the shortest day among the given options. It takes approximately 24 hours for the Earth to complete one full rotation on its axis, which defines a day. This 24-hour period is what we commonly refer to as a day on Earth. In comparison, Mars has a slightly longer day, lasting about 24 hours and 37 minutes, while Mercury and Venus have much longer days due to their slower rotation. "
    },
    {
        "questionId": 85,
        "questionType": "MCQ",
        "answer": "A) Glaciers",
        "explanation": "The answer is A) Glaciers. An outwash plain is a feature formed by the deposition of sediments carried by meltwater from a glacier. When a glacier melts, it releases large amounts of water that flow away from the glacier, carrying sediments with it. These sediments are then deposited in the form of a flat or gently sloping plain known as an outwash plain. The outwash plain is typically composed of sand, gravel, and other debris left behind by the meltwater. This process is commonly associated with glacial activity. "
    },
    {
        "questionId": 86,
        "questionType": "MCQ",
        "answer": "B) Aleutian Islands",
        "explanation": "The answer is B) Aleutian Islands. The Aleutian Islands, located in the northern Pacific Ocean, have the largest number of active volcanoes. This island chain stretches from Alaska towards Russia's Kamchatka Peninsula and is part of the \"Ring of Fire,\" a region known for its intense volcanic and seismic activity. The subduction of the Pacific Plate beneath the North American Plate in this area leads to the formation of numerous volcanoes. The Aleutian Islands are home to over 80% of all active volcanoes in the United States. "
    },
    {
        "questionId": 87,
        "questionType": "MCQ",
        "answer": "A) Davis, W.M.",
        "explanation": "The concept of the Normal Cycle of Erosion was given by A) Davis, W.M. William Morris Davis, an American geographer, is credited with formulating the Normal Cycle of Erosion. According to this concept, landforms undergo a series of sequential stages as they are shaped by erosion processes over time. These stages include youth, maturity, and old age. Davis proposed that landscapes go through a cyclical pattern of erosion, deposition, and uplift, ultimately resulting in a smoother and more rounded landform. His work significantly contributed to the understanding of landform development and the processes of erosion and deposition. "
    },
    {
        "questionId": 88,
        "questionType": "MCQ",
        "answer": "A) A submerged river valley",
        "explanation": "The term \"Ria\" stands for A) A submerged river valley. Rias are coastal features formed when sea levels rise and flood the lower portion of a river valley. As the sea fills the valley, it creates a long, narrow inlet with steep sides. Rias are typically characterized by deep water channels, irregular coastlines, and numerous islands. They are commonly found in regions where rivers flow into the ocean and experience significant tidal influences. Rias are important ecosystems and often support diverse marine life. "
    },
    {
        "questionId": 89,
        "questionType": "MCQ",
        "answer": "D) Wind action",
        "explanation": "The term \"deflation\" is associated with D) Wind action. Deflation refers to the process of wind removing loose surface material such as sand, silt, and dust from the Earth's surface. It occurs in arid and desert regions where there is limited vegetation to anchor the soil. As the wind blows over the surface, it picks up and carries away the loose particles, causing erosion and the formation of various landforms such as sand dunes and desert pavements. Deflation can have significant impacts on the landscape and can contribute to desertification. "
    },
    {
        "questionId": 90,
        "questionType": "MCQ",
        "answer": "B) 6.4 degree Celcius",
        "explanation": "The rate of decrease of temperature in the troposphere is B) 6.4 degrees Celsius. The troposphere is the lowest layer of the Earth's atmosphere, extending from the surface up to an altitude of approximately 12 kilometers (7.5 miles) at the poles and 17 kilometers (11 miles) at the equator. As we move higher in the troposphere, the temperature decreases with increasing altitude at an average rate of 6.4 degrees Celsius per kilometer. This temperature change is known as the lapse rate. "
    },
    {
        "questionId": 91,
        "questionType": "MCQ",
        "answer": "C) White Revolution",
        "explanation": "Operation Flood is associated with C) White Revolution. It was a dairy development program implemented in India in the 1970s. The aim of Operation Flood was to increase milk production and make India self-sufficient in milk and milk products. The program involved the establishment of milk cooperatives, improved cattle breeds, enhanced milk processing and distribution systems, and the empowerment of farmers through collective action. Operation Flood was highly successful in transforming India into the world's largest milk-producing country. "
    },
    {
        "questionId": 92,
        "questionType": "MCQ",
        "answer": "A) 1988",
        "explanation": "The National Forest Policy was launched in A) 1988. The National Forest Policy is a comprehensive policy framework that guides the management and conservation of forests in India. It aims to ensure the sustainable use of forest resources, promote afforestation and reforestation, protect wildlife and biodiversity, and address the needs of local communities dependent on forests. The policy provides guidelines for forest management, including the involvement of local communities, the protection of ecologically sensitive areas, and the promotion of forest-based industries. Its implementation has played a significant role in conservation efforts and sustainable development in India. "
    },
    {
        "questionId": 93,
        "questionType": "MCQ",
        "answer": "B) Haryana",
        "explanation": "The state of Haryana has the highest percentage of irrigated area among the given options. Haryana has made significant progress in agricultural development, and irrigation plays a crucial role in enhancing agricultural productivity. The state has invested in irrigation infrastructure, including canals, reservoirs, and tube wells, to ensure a reliable water supply for agriculture. This has contributed to a higher percentage of cultivated land being irrigated, leading to increased crop production and improved agricultural outcomes. "
    },
    {
        "questionId": 94,
        "questionType": "MCQ",
        "answer": "B) HPCL",
        "explanation": "The oil refinery at Bhatinda is being established by HPCL, which stands for Hindustan Petroleum Corporation Limited. HPCL is a prominent state-owned oil and natural gas company in India. The Bhatinda refinery project aims to enhance the refining capacity and meet the growing demand for petroleum products in the region. The refinery will contribute to the production of various fuels, including petrol, diesel, and aviation turbine fuel, supporting the energy needs of the area. "
    },
    {
        "questionId": 95,
        "questionType": "MCQ",
        "answer": "D) Textile",
        "explanation": "The largest industry in India is the textile industry. The textile industry plays a significant role in the country's economy, employing a large number of people and contributing significantly to the GDP. India is known for its diverse range of textiles, including cotton, silk, wool, and synthetic fibers. The industry encompasses various activities such as spinning, weaving, dyeing, printing, and garment manufacturing. It caters to both domestic and international markets, with India being one of the largest textile exporters in the world. "
    },
    {
        "questionId": 96,
        "questionType": "MCQ",
        "answer": "D) 1908",
        "explanation": "The Tata Iron and Steel Company (TISCO) at Jamshedpur was established in 1908. It was founded by Jamsetji Tata, a prominent industrialist and philanthropist in India. The establishment of TISCO marked a significant milestone in the development of India's steel industry. The company played a crucial role in the industrialization of the country and became one of the largest steel producers in India. "
    },
    {
        "questionId": 97,
        "questionType": "MCQ",
        "answer": "A) 1948",
        "explanation": "The first industrial policy in India was announced in 1948. This policy, known as the Industrial Policy Resolution of 1948, laid the foundation for industrial development in the country. It aimed to promote industrialization, encourage private sector investment, and prioritize the development of key industries such as iron and steel, chemicals, machinery, and textiles. The policy emphasized the role of the state in regulating and guiding industrial growth and promoting the welfare of workers. "
    },
    {
        "questionId": 98,
        "questionType": "MCQ",
        "answer": "B) Jute Textile",
        "explanation": "The town of Rishra is known for the industry of jute textile. Jute is a natural fiber obtained from the plants of the Corchorus genus, and it is primarily used for making various products like bags, ropes, carpets, and textiles. Rishra, located in the Indian state of West Bengal, has a significant presence of jute mills and is known for its jute textile industry. Jute textiles play a crucial role in the economy of the region and contribute to employment generation and economic development. "
    },
    {
        "questionId": 99,
        "questionType": "MCQ",
        "answer": "A) Bauxite",
        "explanation": "Koraput is known for its rich deposits of bauxite. Bauxite is an important mineral used in the production of aluminum. It is a sedimentary rock that is rich in aluminum hydroxide minerals. The presence of bauxite in Koraput makes it a significant region for the mining and extraction of this mineral. Bauxite mining contributes to the local economy and the production of aluminum, which is widely used in various industries. "
    },
    {
        "questionId": 100,
        "questionType": "MCQ",
        "answer": "D) 17",
        "explanation": "The U.N. Agenda 2030 consists of 17 sustainable development goals (SDGs). These goals were adopted by the United Nations in 2015 as a global call to action to end poverty, protect the planet, and ensure prosperity for all. The SDGs cover a wide range of issues, including poverty eradication, gender equality, clean energy, climate action, sustainable cities, and more. Each goal has specific targets to be achieved by 2030. The inclusion of 17 sustainable development goals reflects the comprehensive and integrated approach of the U.N. Agenda 2030 towards achieving a sustainable future. "
    }
]