[
    {
        "questionId": 1,
        "questionType": "MCQ",
        "answer": "C) 59%",
        "explanation": "According to the 2019-20 budget estimates, in Himachal Pradesh, 59% of the total expenditure is allocated for salary, pension, interest payments, and subsidies. This indicates that a significant portion of the budget is dedicated to these areas, reflecting the importance of public sector employees, retirees, debt servicing, and government support for various sectors."
    },
    {
        "questionId": 2,
        "questionType": "MCQ",
        "answer": "B) Gadar Party",
        "explanation": "Mian Jawahar Singh, Sh. Badri Nath, and Sh. Jwala Singh were leaders of the Gadar Party revolutionary movement in Himachal Pradesh. The Gadar Party was a prominent political organization formed by Indian immigrants in the United States and Canada during the early 20th century. It aimed to fight against British colonial rule in India and promote the cause of Indian independence. The Gadar Party played a significant role in mobilizing support and carrying out revolutionary activities in various parts of India, including Himachal Pradesh."
    },
    {
        "questionId": 3,
        "questionType": "MCQ",
        "answer": "A) India and England",
        "explanation": "The first one-day international cricket match was played between India and England at the HPCA Stadium in Dharamshala. This historic match took place on January 27, 2013. The HPCA Stadium, also known as the Himachal Pradesh Cricket Association Stadium, is located in the picturesque hill station of Dharamshala and has hosted numerous international and domestic cricket matches since its inauguration in 2003."
    },
    {
        "questionId": 4,
        "questionType": "MCQ",
        "answer": "D) Chamba",
        "explanation": "Chamba district stands out for its diverse topography and offers contrasting natural beauty, which is likely why G.C. Barnes made the statement emphasizing the sublime and delightful contrasts found there."
    },
    {
        "questionId": 5,
        "questionType": "statements",
        "answer": "B) Only 1 is false",
        "explanation": "The correct answer is B) Only 1 is false. The statement 'Koti state - Founded by descendants of Guler state' is false. Koti state was not founded by the descendants of Guler state. The other statements are true: Balsan state is indeed an offshoot of ancient Sirmaur, Dhami state was founded by the descendants of Prithviraj Chauhan, and Darkoti state's founder ruler was Durga Singh, a scion of the house of Jaipur (Marwar)."
    },
    {
        "questionId": 6,
        "questionType": "MCQ",
        "answer": "A) Swanglas",
        "explanation": "The children 'Mundro' and 'Garu' are known to be from the hypergamous union of the Swanglas tribe. Hypergamy refers to a practice where a person from a lower social group marries someone from a higher social group. In this case, the Swanglas tribe, who are traditionally considered a lower social group, had a hypergamous union resulting in the birth of Mundro and Garu. This cultural and social aspect is significant in understanding the dynamics of tribal communities in Himachal Pradesh."
    },
    {
        "questionId": 7,
        "questionType": "MCQ",
        "answer": "B) Darosh (dub-dub)",
        "explanation": "The Kunchen form of marriage in Sikkim is similar to the Darosh (dub-dub) marriage system in Himachal Pradesh. Both of these marriage systems involve the practice of polyandry, where a woman is married to multiple husbands. In Kunchen marriage, brothers marry the same woman, while in the Darosh (dub-dub) system, a woman is married to a group of brothers. These marriage systems highlight unique cultural practices and traditions in Sikkim and Himachal Pradesh."
    },
    {
        "questionId": 8,
        "questionType": "MCQ",
        "answer": "A) Buddhism",
        "explanation": "The Jad tribe of Himachal Pradesh are followers of Buddhism. Buddhism has a significant presence in certain regions of Himachal Pradesh, including areas inhabited by the Jad tribe. Buddhism originated in ancient India and spread to various parts of the country, including Himachal Pradesh. The Jad tribe, like many other communities in the region, has embraced Buddhism as their religion, and it influences their cultural practices, rituals, and beliefs."
    },
    {
        "questionId": 9,
        "questionType": "statements",
        "answer": "D) 1 and 4",
        "explanation": "The correct answer is D) 1 and 4. Statement 1 is true, as Sultan Mahmud Ghaznavi did attack Nagarkot fort in 1009 A.D. Statement 4 is also true, as Hari Chand ascended the throne of Kangra after Amir Timur's return in 1405 A.D. Statements 2 and 3 are false, as the Nagarkot expedition in 1339 was led by Sultan Muhammad Tughlaq, not personally, and Raja Purab Chand did not recover the Kangra fort in 1348 A.D."
    },
    {
        "questionId": 10,
        "questionType": "statements",
        "answer": "D) None of these",
        "explanation": "The correct answer is D) None of these. None of the statements are true about folk dances, fairs, and festivals of Himachal Pradesh. Statement 1 mentions sword dances called 'Kharait' and 'Ujagjama', which are not famous in Himachal Pradesh. Statement 2 associates the importance of 'Kumbha' with dances called 'Bhunda', 'Shant', and 'Bhoj', which is not the case. Statement 3 states that the 'Minjar' fair starts on the second Sunday of Sawan, which is incorrect. Statement 4 claims that 'Chhamb' is a sacred masked dance performed only by Lamas, which is also untrue. Therefore, none of the statements are true."
    },
    {
        "questionId": 11,
        "questionType": "statements",
        "answer": "A) All of the above",
        "explanation": "The correct answer is A) All of the above. None of the statements mentioned in the question are true. Parangla pass does not lie between Kinnaur and Lahaul. Manirang is not the highest peak of Chamba. Kalichho is not a famous lake in the Chamba district. Chobia pass does not lie between Ladakh and Lahaul. Therefore, all the statements mentioned in the question are false."
    },
    {
        "questionId": 12,
        "questionType": "statements",
        "answer": "C) 1, 2 and 3",
        "explanation": "The true statements from the given options are: 1. Chamba, Kullu and Kinnaur are considered the most susceptible to landslide threats, 2. Una, Bilaspur, Sirmaur, Shimla and Solan are considered as low vulnerable to disaster threats, 3. Hum valley of Una district has hardly any natural drinking water source."
    },
    {
        "questionId": 13,
        "questionType": "statements",
        "answer": "C) 1 and 2",
        "explanation": "The correct answer is C) 1 and 2. Statement 1 is incorrect as the per capita income at current prices for the year 2019-20 witnessed an increase of 6.2 percent. Statement 2 is also incorrect as the contraction in the economy for 2020-21 was expected to be around 7.9 percent as per the revised estimates as of December 2020. However, statement 3 is correct as the economic growth in Himachal Pradesh is still largely influenced by agriculture activities. Statement 4 is not mentioned in the given options. Therefore, the correct answer is C) 1 and 2."
    },
    {
        "questionId": 14,
        "questionType": "statements",
        "answer": "D) None of these",
        "explanation": "The correct answer is D) None of these. None of the statements mentioned in the question are correct about the Social Welfare programs of the Government of Himachal Pradesh. Statement 1 mentions the e-Udyan portal for availing horticulture farming service benefits, which is not accurate. Statement 2 refers to the Vishesh Mahila Utthan Yojna for rehabilitating abused women through vocational training, which is also incorrect. Statement 3 mentions the Medha Protsahan Yojna providing one lakh rupees to meritorious students for coaching, which is not a correct description. Statement 4 talks about the Mukhya Mantri Ek Bigha Scheme for empowering rural women, which is not accurate either. Therefore, none of the statements are correct."
    },
    {
        "questionId": 15,
        "questionType": "statements",
        "answer": "A) All of the above",
        "explanation": "The correct answer is A) All of the above. All the statements mentioned in the question are correct. Himachal Pradesh is indeed the first state to pioneer the Districts Good Governance Index (DGGI) for measuring Governance Performance on seven themes. The idea of DGGI was obtained from the Public Affairs Centre in Bangalore, and Himachal Pradesh was ranked 1st among 12 small states on the Public Affairs Index. The government of Himachal Pradesh has decided to make DGGI a regular exercise of the Department of Economics and Statistics. Hamirpur district was awarded the first prize based on DGGI-2019. Therefore, all the statements are correct."
    },
    {
        "questionId": 16,
        "questionType": "statements",
        "answer": "D) 2 only",
        "explanation": "The correct answer is D) 2 only. Statement 2 is not correct. The Himachal Pradesh State Cooperative Bank Ltd. does not have 217 branches in Himachal Pradesh. The rest of the statements are correct. Statement 1 states that as per the census of 2011, the average population per branch in the state is 3129 people. Statement 3 mentions that Kangra district has the highest number of 423 bank branches. Statement 4 states that the State Bank of India has been given the responsibility of the Lead Bank of two districts, Chamba and Lahaul-Spiti. Therefore, the correct answer is D) 2 only."
    },
    {
        "questionId": 17,
        "questionType": "statements",
        "answer": "A) None of these",
        "explanation": "The correct answer is A) None of these. NABARD consultancy services (NABCONS) was involved in all the assignments mentioned in the statements during the financial year 2020-21. Statement 1 mentions a comprehensive study of the Kisan Credit Card scheme and the Handloom sector, which NABCONS was involved in. Statement 2 refers to the third-party survey of toilets constructed by SJVN, which NABCONS was also involved in. Statement 3 mentions the third-party inspection of the Border Area Development Program, which NABCONS was involved in. Statement 4 states that NABCONS is the Central Technical Support Agency for Deen Dayal Upadhyaya Grameen Kaushal Vikas Yojana (DDU-GKY) in the state. Therefore, none of the statements are correct."
    },
    {
        "questionId": 18,
        "questionType": "statements",
        "answer": "B) 1 and 2",
        "explanation": "The correct answer is B) 1 and 2. Statement 1 is correct as per the 2011 census, Himachal Pradesh is the only state in the country where 89.96% of the population lives in rural areas. Statement 2 is also correct as agriculture/horticulture provides direct employment to about 70% of the total workers in the state. However, statement 3 is incorrect as about 15.72% of the total Gross State Domestic Product (GSDP) does not come from agriculture and its allied sectors. Statement 4 is not mentioned in the given options. Therefore, the correct answer is B) 1 and 2."
    },
    {
        "questionId": 19,
        "questionType": "statements",
        "answer": "B) 2 and 3",
        "explanation": "The correct answer is B) 2 and 3. Statement 2 is incorrect as Bharat Net is an initiative of the Government of India to provide broadband services to the Gram Panchayats, not the Municipalities. Statement 3 is also incorrect as HIMSWAN (Himachal State Wide Area Network) was set up in the state under the state e-governance Plan (SeGP) in 2007, not 2010. Statement 1 is correct, as the state government has indeed taken an initiative towards good governance by setting up the CM Dashboard. Statement 4 is not mentioned in the given options. Therefore, the correct answer is B) 2 and 3."
    },
    {
        "questionId": 20,
        "questionType": "statements",
        "answer": "D) All of these",
        "explanation": "The correct answer is D) All of these. All the statements mentioned in the question are correct about the Himachal Pradesh Town &amp; Country Planning Act-1977. Statement 1 states that the Act has been enforced in 55 planning areas. Statement 2 mentions that the planning area constitutes 1.60% of the total geographical area of the state. Statement 3 states that the Act is enforced in 35 special areas of Himachal Pradesh. Statement 4 mentions that 2.06% of the total geographical area of the state comes under special area. Therefore, all the statements are correct."
    },
    {
        "questionId": 21,
        "questionType": "list",
        "answer": "D) (a-2) (b-4) (c-3) (4-1)",
        "explanation": "The correct answer is D) (a-2) (b-4) (c-3) (4-1). The matching of authors and books is as follows: Herman Goetz is associated with The Early Wooden Temples of Chamba (2), W.G. Archer is associated with Kangra Valley Paintings (4), M.S. Randhawa is associated with Himalayan Art (3), and Joseph Charles French is associated with Kangra Painting (1). Therefore, the correct matching is (a-2) (b-4) (c-3) (4-1)."
    },
    {
        "questionId": 22,
        "questionType": "list",
        "answer": "C) (A-1) (B-3) (C-4) (D-5)",
        "explanation": "The correct matching of the sanctuaries with their respective locations is as follows: a. Bandli sanctuary - 1) Mandi, b. Daranghati sanctuary - 3) Shimla, c. Gamgul Siahbehi sanctuary - 4) Chamba, d. Lippa-Asrang sanctuary - 2) Upper catchment areas of Tirthan, Sainj and Jiva rivers."
    },
    {
        "questionId": 23,
        "questionType": "list",
        "answer": "D) (A-5) (B-1) (C-2) (D-3)",
        "explanation": "The correct answer is D) (A-5) (B-1) (C-2) (D-3). The matching of items from List I and List II is as follows: Zungtee is associated with Satluj (5), A scene of savage grandeur is associated with Tidong (1), Mone is associated with The historical village (2), and Chhepta is associated with Birth Customs (3). Therefore, the correct matching is (A-5) (B-1) (C-2) (D-3)."
    },
    {
        "questionId": 24,
        "questionType": "MCQ",
        "answer": "C) Biological productivity",
        "explanation": "The correct answer is C) Biological productivity. Desertification refers to the process of decline in the biological productivity of an ecosystem, leading to the total loss of productivity. It is often associated with arid, semi-arid, and sub-humid ecosystems, but even in humid tropics, the impact can be significant. Desertification can result in the impoverishment of terrestrial ecosystems and has various consequences such as accelerated erosion, salinization of land, and site quality decline. Deforestation and the alteration of hydrology and soil nutrient losses are major factors contributing to desertification. The ultimate consequences include soil degradation, changes in water availability and quality, and a decline in food, fodder, and fuel-wood yields. Therefore, desertification leads to a decline in biological productivity."
    },
    {
        "questionId": 25,
        "questionType": "MCQ",
        "answer": "C) Biological productivity",
        "explanation": "The correct answer is C) Biological productivity. Desertification refers to the process of decline in the biological productivity of an ecosystem, leading to the total loss of productivity. It is often associated with arid, semi-arid, and sub-humid ecosystems, but even in humid tropics, the impact can be significant. Desertification can result in the impoverishment of terrestrial ecosystems and has various consequences such as accelerated erosion, salinization of land, and site quality decline. Deforestation and the alteration of hydrology and soil nutrient losses are major factors contributing to desertification. The ultimate consequences include soil degradation, changes in water availability and quality, and a decline in food, fodder, and fuel-wood yields. Therefore, desertification leads to a decline in biological productivity."
    },
    {
        "questionId": 26,
        "questionType": "MCQ",
        "answer": "B) Tropical Asia climate",
        "explanation": "The correct answer is B) Tropical Asia climate. The level of erosion is highest in Tropical Asia climate regions. The given information states that Tropical Asia, Africa, and South America have the highest levels of erosion. Desertification, which leads to soil degradation and decline in biological productivity, can result in significant erosion. Therefore, in the context of the given information, the level of erosion is highest in the Tropical Asia climate."
    },
    {
        "questionId": 27,
        "questionType": "MCQ",
        "answer": "D) Hydrology",
        "explanation": "The correct answer is D) Hydrology. Deforestation adversely affects hydrology. The given information states that deforestation leads to adverse alterations in hydrology and related soil nutrient losses. When forests are cleared, the vegetation that helps regulate water flow and retain moisture is removed, leading to changes in the water cycle. Deforestation can result in increased runoff, soil erosion, reduced groundwater recharge, and changes in streamflow patterns. These alterations in hydrology have significant impacts on water availability and quality, which ultimately affect the ecosystem and human well-being. Therefore, deforestation has adverse effects on hydrology."
    },
    {
        "questionId": 28,
        "questionType": "MCQ",
        "answer": "D) Arunachal Pradesh",
        "explanation": "The correct answer is B) Hot desert areas. Desertification is a process that often occurs in arid, semi-arid, and sub-humid ecosystems, which are characterized by hot desert areas. These regions experience high temperatures, limited rainfall, and dry conditions, making them prone to desertification. While desertification can also occur in other ecosystems, such as the humid tropics, the impact is often most dramatic in hot desert areas where the conditions are already unfavorable for sustaining biological productivity. Arunachal Pradesh, mentioned in option D, is a state in northeastern India and does not fall under the category of hot desert areas."
    },
    {
        "questionId": 29,
        "questionType": "MCQ",
        "answer": "A) Mountains",
        "explanation": "The correct answer is A) Mountains. Accelerated erosion chiefly occurs in mountain regions. The rugged terrain, steep slopes, and heavy rainfall in mountainous areas contribute to increased erosion rates. The force of gravity combined with the erosive power of water results in the removal of soil and rock material from the slopes, leading to accelerated erosion. This erosion process can have significant consequences, including the loss of fertile soil, reduced vegetation cover, and increased sedimentation in rivers and streams. It is important to implement effective soil conservation measures in mountainous regions to mitigate the impact of accelerated erosion."
    },
    {
        "questionId": 30,
        "questionType": "MCQ",
        "answer": "C) Mahatma Jyotiba Pule",
        "explanation": "The book 'Gulamgiri' was written by Mahatma Jyotiba Phule. Mahatma Jyotiba Phule was a social reformer and activist who played a significant role in the upliftment of the lower castes and women in India. 'Gulamgiri', also known as 'Slavery', is one of his notable works. The book critiques the caste system, social inequality, and the oppression faced by marginalized communities. It advocates for social justice, equality, and the emancipation of the oppressed. Mahatma Jyotiba Phule's writings and activism continue to inspire and influence social reform movements in India."
    },
    {
        "questionId": 31,
        "questionType": "MCQ",
        "answer": "B) 1904",
        "explanation": "The Indian Universities Act was passed in the year 1904. This act, also known as the 'Indian Universities Act of 1904', was a significant legislative measure that aimed to regulate and improve higher education in British India. It provided for the establishment of universities and defined their powers, functions, and governance structure. The act laid the foundation for the development of a modern and organized system of higher education in India during the colonial period. It played a crucial role in shaping the structure and functioning of universities in the early 20th century."
    },
    {
        "questionId": 32,
        "questionType": "MCQ",
        "answer": "B) Lord Ellenborough",
        "explanation": "The Britishers conquered Sindh during the tenure of Lord Ellenborough. Lord Ellenborough served as the Governor-General of India from 1842 to 1844. It was during his administration that the British East India Company launched a military campaign against the Talpur dynasty and captured the region of Sindh in 1843. The conquest of Sindh by the British marked a significant expansion of their territorial control in the Indian subcontinent. Lord Ellenborough's tenure witnessed several important political and military developments in British India."
    },
    {
        "questionId": 33,
        "questionType": "MCQ",
        "answer": "C) Kuruwa",
        "explanation": "Shifting cultivation in Jharkhand State is known as Kuruwa. Kuruwa is a traditional agricultural practice where farmers clear a patch of land, burn the vegetation, and cultivate crops for a few years until the soil fertility decreases. Then they move to a new plot of land and repeat the process. This practice is also commonly known as slash-and-burn agriculture. It is an age-old practice followed by indigenous communities in Jharkhand and other regions to sustain their livelihoods."
    },
    {
        "questionId": 34,
        "questionType": "MCQ",
        "answer": "A) Kosi – Consequent river",
        "explanation": "The pair that is not correctly matched is A) Kosi - Consequent river. A consequent river is a river that follows the original slope of the land and flows in the same direction as the general slope of the terrain. The Kosi River, however, is an example of an antecedent river. An antecedent river is a river that existed before the upliftment of the land and maintained its course as the land was uplifted. The Narmada River is indeed a rift valley river, the Sutlej River is an antecedent river, and the Ghaggar River is an endoreic river."
    },
    {
        "questionId": 35,
        "questionType": "MCQ",
        "answer": "D) Biafo",
        "explanation": "The glacier located in the Karakoram ranges of the Himalayan region is D) Biafo. The Biafo Glacier is one of the longest glaciers in the Karakoram range, extending over a length of approximately 63 kilometers. It is known for its stunning beauty and challenging trekking routes. The Shafat Glacier is located in the Zanskar Range, the Milam Glacier is in the Kumaon Himalayas, and the Zemu Glacier is in the Eastern Himalayas."
    },
    {
        "questionId": 36,
        "questionType": "MCQ",
        "answer": "C) Cattle herders",
        "explanation": "Kirghiz refers to C) Cattle herders. The Kirghiz are a nomadic ethnic group traditionally engaged in cattle herding. They are known for their pastoral way of life, moving with their herds across the grasslands and mountains in Central Asia. The term 'Kirghiz' is often used to refer to the Kyrgyz people, who are primarily located in Kyrgyzstan, a country in Central Asia. They have a rich cultural heritage and have played a significant role in the history and traditions of the region."
    },
    {
        "questionId": 37,
        "questionType": "MCQ",
        "answer": "A) Europe",
        "explanation": "The Alps mountain chain is related to A) Europe. The Alps are a major mountain range in Europe, stretching across several countries including France, Switzerland, Italy, Austria, and Germany. They are known for their stunning natural beauty, diverse ecosystems, and popular tourist destinations. The Alps have played a significant role in shaping the history, culture, and geography of the European continent. They are renowned for their winter sports resorts, alpine meadows, and iconic peaks, making them an important feature of Europe's landscape."
    },
    {
        "questionId": 38,
        "questionType": "MCQ",
        "answer": "B) Clayey soil",
        "explanation": "The water holding capacity is highest in B) Clayey soil. Clayey soil has smaller particles and a higher proportion of clay minerals, which gives it a higher water holding capacity compared to sandy soil or loamy soil. The fine particles and compact structure of clayey soil allow it to retain more water, making it beneficial for plant growth. This type of soil can hold onto water for longer periods, providing a steady supply of moisture to plants. Its ability to retain water is important for agriculture and ensuring adequate water availability for plant roots."
    },
    {
        "questionId": 39,
        "questionType": "MCQ",
        "answer": "A) Jawaharlal Nehru",
        "explanation": "A) Jawaharlal Nehru was not a member of the Constitutional Draft Committee. The Constitutional Draft Committee, also known as the Drafting Committee, was responsible for drafting the Constitution of India. It was chaired by Dr. B.R. Ambedkar and consisted of several members who played a crucial role in shaping the Constitution. While Jawaharlal Nehru was one of the prominent leaders of the Indian independence movement and the first Prime Minister of India, he was not a member of the Constitutional Draft Committee."
    },
    {
        "questionId": 40,
        "questionType": "MCQ",
        "answer": "A) Advocate General of State",
        "explanation": "A) Advocate General of State can be removed from his office by the Governor. The Advocate General is a constitutional post in each state of India and serves as the chief legal advisor to the state government. The Governor has the authority to appoint and remove the Advocate General. This power is vested in the Governor to ensure the efficient functioning of the state administration and to maintain the integrity of the legal system."
    },
    {
        "questionId": 41,
        "questionType": "MCQ",
        "answer": "D) No time limit",
        "explanation": "D) No time limit. The Governor has no specific time limit to return an ordinary bill to the concerned State Legislative Assembly for reconsideration. Unlike a Money Bill, which must be returned within 14 days, there is no prescribed time frame for the Governor to return an ordinary bill. The Governor can take as much time as deemed necessary for thorough examination and consideration of the bill before deciding whether to give assent or recommend reconsideration."
    },
    {
        "questionId": 42,
        "questionType": "MCQ",
        "answer": "B) Decline in Maternal Mortality Ratio",
        "explanation": "B) Decline in Maternal Mortality Ratio. The sustainable development goal 'Good Health and Well-being' has shown improvement in India due to the decline in maternal mortality ratio. Maternal mortality ratio refers to the number of maternal deaths per 100,000 live births. By reducing maternal mortality, India has made progress in ensuring better health and well-being for women during childbirth. This improvement can be attributed to various factors such as increased access to quality healthcare services, improved maternal healthcare facilities, better antenatal and postnatal care, and awareness programs on maternal health."
    },
    {
        "questionId": 43,
        "questionType": "MCQ",
        "answer": "A) Enhance agricultural productivity by integrated farming",
        "explanation": "A) Enhance agricultural productivity by integrated farming. The National Mission for Sustainable Agriculture has been launched with the objective of enhancing agricultural productivity through integrated farming practices. It aims to promote sustainable and climate-resilient agriculture by adopting conservation techniques, improving soil health, enhancing water use efficiency, and promoting integrated nutrient management. The mission focuses on the adoption of innovative agricultural practices that minimize the use of chemical inputs and promote the conservation of natural resources. By implementing integrated farming approaches, the mission aims to achieve sustainable agricultural development and ensure food security."
    },
    {
        "questionId": 44,
        "questionType": "MCQ",
        "answer": "D) None of these",
        "explanation": "D) None of these. The statement in the question is incorrect. The new four-colour classification scheme for industries based on their pollution potential includes the following categories: 'Red' category for highly polluting industries, 'Orange' category for moderately polluting industries, 'Green' category for non-polluting industries, and 'White' category for industries that are exempted from environmental clearance. Therefore, the correct option is 'D) None of these' because all the options provided in the question are correct."
    },
    {
        "questionId": 45,
        "questionType": "MCQ",
        "answer": "C) 2400 calories per person per day",
        "explanation": "C) 2400 calories per person per day. The minimum calorie requirement in rural areas for measuring poverty is 2400 calories per person per day. This is based on the average energy requirement for an individual engaged in agricultural or manual work. It serves as a benchmark for determining the poverty line and assessing the food security of rural households. The calorie requirement may vary for different regions and population groups based on factors such as age, gender, and activity level."
    },
    {
        "questionId": 46,
        "questionType": "MCQ",
        "answer": "D) An increase in the population in the working-age group",
        "explanation": "D) An increase in the population in the working-age group. The phenomenon of 'demographic dividend' refers to a situation where a country experiences a significant increase in the proportion of its population in the working-age group (typically between 15 to 64 years). This demographic shift can have positive effects on economic growth and development, as a larger working-age population can contribute to increased productivity, innovation, and consumption. It offers an opportunity for accelerated economic development if the country can effectively harness the potential of its working-age population through education, skill development, and job creation."
    },
    {
        "questionId": 47,
        "questionType": "MCQ",
        "answer": "D) Market relevant training to youth",
        "explanation": "D) Market relevant training to youth. SANKALP (Skills Acquisition and Knowledge Awareness for Livelihood Promotion) is a government initiative launched to provide market-relevant training to the youth of India. It aims to enhance the employability and skills of the workforce by providing quality training programs in various sectors. SANKALP focuses on improving the overall skill ecosystem in the country, including strengthening institutional mechanisms, creating industry-relevant curriculum, and promoting entrepreneurship. The program aims to address the skill gaps in different sectors and equip the youth with the necessary skills for employment and entrepreneurship opportunities."
    },
    {
        "questionId": 48,
        "questionType": "MCQ",
        "answer": "B) 3 percent of GDP",
        "explanation": "B) 3 percent of GDP. According to the Fiscal Responsibility and Budget Management (FRBM) Act, India's fiscal deficit should not exceed 3 percent of the Gross Domestic Product (GDP). The FRBM Act was enacted in 2003 with the objective of promoting fiscal discipline and reducing the fiscal deficit. It sets targets for the government to achieve prudent fiscal management and sustainability. The Act aims to ensure fiscal stability, macroeconomic stability, and debt sustainability in the country. The fiscal deficit limit of 3 percent of GDP is an important component of India's fiscal policy framework."
    },
    {
        "questionId": 49,
        "questionType": "MCQ",
        "answer": "B) Slaked lime slowly creates a layer of calcium nitrate on the walls during whitewashing",
        "explanation": "B) Slaked lime slowly creates a layer of calcium nitrate on the walls during whitewashing. This statement is not correct. Slaked lime, also known as calcium hydroxide, is commonly used in whitewashing. When slaked lime is mixed with water, it forms a calcium hydroxide solution, which is applied to surfaces for whitewashing. Calcium nitrate is not involved in this process. It is important to note that calcium nitrate is a different compound and is not typically formed during the whitewashing process. Therefore, the statement is incorrect."
    },
    {
        "questionId": 50,
        "questionType": "MCQ",
        "answer": "C) The mass density of kerosene is less than that of water",
        "explanation": "C) The mass density of kerosene is less than that of water. This statement is correct. Mass density refers to the mass of a substance per unit volume. Kerosene is less dense than water, which means that for an equal volume, kerosene has a lower mass compared to water. This is why kerosene floats on water. The density of kerosene is typically around 0.8 grams per cubic centimeter, while the density of water is 1 gram per cubic centimeter. Therefore, the statement is correct."
    },
    {
        "questionId": 51,
        "questionType": "MCQ",
        "answer": "A) During dental caries, bacteria act on saliva to produce acids",
        "explanation": "A) During dental caries, bacteria act on saliva to produce acids. This statement is not correct. Dental caries, commonly known as tooth decay, is caused by the acid produced by bacteria in the mouth acting on sugars and carbohydrates from food, not on saliva. The bacteria in the mouth metabolize these sugars and produce acids as byproducts, which then erode the tooth enamel, leading to the formation of cavities. Saliva plays a protective role in the oral cavity by neutralizing acids and helping to remineralize the teeth. Therefore, the statement is not correct."
    },
    {
        "questionId": 52,
        "questionType": "MCQ",
        "answer": "C) Breakdown of pyruvate in yeast in the absence of oxygen yields ethanol",
        "explanation": "C) Breakdown of pyruvate in yeast in the absence of oxygen yields ethanol. This statement is correct. In the absence of oxygen, during a process called fermentation, pyruvate molecules are converted into ethanol (alcohol) by yeast and some other microorganisms. This type of fermentation is known as alcoholic fermentation. It is an anaerobic process that occurs in the cytoplasm of cells. The breakdown of pyruvate into ethanol helps regenerate NAD+ molecules, which are required for glycolysis to continue in the absence of oxygen. Therefore, the statement is correct."
    },
    {
        "questionId": 53,
        "questionType": "MCQ",
        "answer": "D) Nandighosha",
        "explanation": "D) Nandighosha. During the recent Rath Yatra, the name of the chariot of Lord Jagannath was Nandighosha. The Rath Yatra is a major festival celebrated in Puri, Odisha, where Lord Jagannath, along with his siblings Balabhadra and Subhadra, is taken in chariots to the Gundicha Temple. Each deity has a specific chariot, and the chariot of Lord Jagannath is called Nandighosha. It is beautifully decorated and pulled by devotees during the procession. The Rath Yatra is an important religious and cultural event in Odisha, attracting thousands of devotees from all over the country."
    },
    {
        "questionId": 54,
        "questionType": "MCQ",
        "answer": "C) Online public access catalogue for Indian medical heritage books",
        "explanation": "C) E-Medha portal is an online public access catalogue for Indian medical heritage books. It provides a platform for accessing digitized information on rare manuscripts, ancient texts, and other valuable resources related to Indian medical heritage. The portal aims to preserve and promote traditional knowledge in the field of medicine and make it accessible to researchers, scholars, and the general public. E-Medha contributes to the documentation, conservation, and dissemination of knowledge about Ayurveda and other traditional medical systems in India."
    },
    {
        "questionId": 55,
        "questionType": "MCQ",
        "answer": "A) The cardholder gets a multipurpose lifetime visa to visit India",
        "explanation": "A) The Overseas Citizens of India (OCI) card scheme grants a multipurpose lifetime visa to the cardholder, allowing them to visit India without the need for a separate visa. The OCI card provides many benefits to individuals of Indian origin who hold foreign citizenship. However, it's important to note that the OCI card does not grant voting rights or the ability to purchase agricultural land in India. Additionally, holding an OCI card does not automatically confer Indian citizenship; separate procedures are required for obtaining Indian citizenship."
    },
    {
        "questionId": 56,
        "questionType": "MCQ",
        "answer": "A) Bangladesh",
        "explanation": "A) The contingent from Bangladesh took part in the Republic Day Parade 2021 in India. The Republic Day Parade is held annually on 26th January to celebrate the adoption of the Indian Constitution. It showcases the cultural diversity and military prowess of India, and also invites participation from foreign countries. In 2021, Bangladesh participated in the parade, highlighting the strong bilateral relations between India and Bangladesh."
    },
    {
        "questionId": 57,
        "questionType": "MCQ",
        "answer": "D) Australia",
        "explanation": "D) India has recently established a 2+2 dialogue with Australia. The 2+2 dialogue is a mechanism that involves the foreign and defense ministers of both countries holding joint meetings to discuss strategic and security issues. This dialogue format allows for enhanced cooperation and coordination between the two countries in areas of mutual interest, such as defense, counterterrorism, maritime security, and regional stability. The establishment of the 2+2 dialogue reflects the growing strategic partnership between India and Australia."
    },
    {
        "questionId": 58,
        "questionType": "MCQ",
        "answer": "A) Mario Draghi",
        "explanation": "A) Mario Draghi was appointed as the new Prime Minister of Italy in February 2021. He is an economist and former president of the European Central Bank. Known for his expertise in economic and financial matters, Draghi was chosen to lead Italy's government and address the economic challenges faced by the country, including the impact of the COVID-19 pandemic. His appointment brought a sense of stability and confidence to Italy's political and economic landscape."
    },
    {
        "questionId": 59,
        "questionType": "statements",
        "answer": "D) 1 and 4",
        "explanation": "D) 1 and 4. India and Pakistan became members of the Shanghai Cooperation Organization (SCO) in 2017. The SCO is a regional intergovernmental organization comprising eight member states, including China, Russia, Kazakhstan, Kyrgyzstan, Tajikistan, Uzbekistan, India, and Pakistan. The inclusion of India and Pakistan expanded the SCO's reach and influence in South Asia and brought new dynamics to the organization. It provided an opportunity for increased cooperation and dialogue among member countries on various political, economic, and security issues."
    },
    {
        "questionId": 60,
        "questionType": "chronology",
        "answer": "B) 3, 1, 4, 2",
        "explanation": "B) 3, 1, 4, 2. The correct chronological order of the Gandhi Peace Prize award winners is as follows: 3. Ekal Abhiyan Trust, awarded in 2017; 1. Yohei Sasakawa, awarded in 2018; 4. Qaboos bin Said Al Said, awarded posthumously in 2019; 2. Sheikh Mujibur Rehman, awarded in 2020. The Gandhi Peace Prize is an annual award given by the Government of India to individuals and institutions for their contributions to social, economic, and political transformation through non-violence and peacebuilding."
    },
    {
        "questionId": 61,
        "questionType": "statements",
        "answer": "C) Statement 1 is correct and Statement 2 is incorrect",
        "explanation": "C) Statement 1 is correct and Statement 2 is incorrect. The Charter Act of 1833 did not have a provision to abolish slavery. In fact, it continued to support and regulate slavery in British colonies. Statement 2 is incorrect because the British annexed the Kingdom of Awadh (not Riyasat of Awadh) in 1856, accusing its ruler of misrule, rather than merging it with their kingdom."
    },
    {
        "questionId": 62,
        "questionType": "statements",
        "answer": "B) Both Statement 1 and Statement 2 are incorrect",
        "explanation": "B) Both Statement 1 and Statement 2 are incorrect. The Young Bengal Movement was actually started by Henry Louis Vivian Derozio, not Sisir Kumar Ghosh. Prarthana Samaj was established in Bombay in 1867, not 1865."
    },
    {
        "questionId": 63,
        "questionType": "statements",
        "answer": "D) Statement 1 is incorrect and Statement 2 is correct",
        "explanation": "D) Statement 1 is incorrect and Statement 2 is correct. Container Corporation of India Limited (CONCOR) is actually under the administrative control of the Ministry of Railways, not the Ministry of Defence. Dedicated Freight Corridor Corporation of India Limited (DFCCIL) is under the administrative control of the Ministry of Railways."
    },
    {
        "questionId": 64,
        "questionType": "statements",
        "answer": "A) Both Statement 1 and Statement 2 are correct",
        "explanation": "A) Both Statement 1 and Statement 2 are correct. Quepem and Canacona are indeed the chief bauxite deposit areas in Goa. Additionally, most of the bauxite deposits in India are associated with laterites and occur generally as sheets."
    },
    {
        "questionId": 65,
        "questionType": "statements",
        "answer": "A) Both Statement 1 and Statement 2 are correct",
        "explanation": "A) Both Statement 1 and Statement 2 are correct. Mahatma Gandhi did give the slogan of 'Do or Die' during the Quit India Movement as a call for the Indian people to strive for freedom. Subhash Chandra Bose did establish the Forward Bloc Party in 1939 as a political organization to oppose British rule in India."
    },
    {
        "questionId": 66,
        "questionType": "statements",
        "answer": "C) Statement 1 is correct and Statement 2 is incorrect",
        "explanation": "C) Statement 1 is correct and Statement 2 is incorrect. S.N. Tagore did establish the Indian Revolutionary Communist Party in 1942 as a communist political party in India. However, it was Jawaharlal Nehru who moved the 'Objective Resolution' in the Constituent Assembly on 13th December 1946, which later served as the basis for the Preamble of the Indian Constitution."
    },
    {
        "questionId": 67,
        "questionType": "statements",
        "answer": "A) Both Statement 1 and Statement 2 are correct",
        "explanation": "A) Both Statement 1 and Statement 2 are correct. Revenue Deficit refers to the excess of revenue expenditure over revenue receipts in a financial year. Effective Revenue Deficit, on the other hand, is the difference between Revenue Deficit and Grants for the creation of Capital Assets. Both statements accurately describe these concepts related to government finances."
    },
    {
        "questionId": 68,
        "questionType": "statements",
        "answer": "B) Both Statement 1 and Statement 2 are incorrect",
        "explanation": "B) Both Statement 1 and Statement 2 are incorrect. The amount of usable energy decreases as it is transferred from one trophic level to another in an ecosystem. This is due to energy loss in the form of heat and metabolic processes. Additionally, the energy within an ecosystem is not constant but instead flows through the ecosystem in a one-way direction, eventually dissipating as heat."
    },
    {
        "questionId": 69,
        "questionType": "statements",
        "answer": "A) Both Statement 1 and Statement 2 are correct",
        "explanation": "A) Both Statement 1 and Statement 2 are correct. The Ruhar Valley in Germany is known for its extensive mining and industrial activities, making it one of the world's greatest mining and industrial regions. Bostan, on the other hand, is an important shipbuilding center in the USA, contributing to the country's maritime industry. Both statements accurately describe these regions and their significance in mining, industrial, and shipbuilding sectors."
    },
    {
        "questionId": 70,
        "questionType": "statements",
        "answer": "C) Statement 1 is correct and Statement 2 is incorrect",
        "explanation": "C) Statement 1 is correct and Statement 2 is incorrect. The Malacca Strait is indeed a shipping channel located between the Indian Ocean and the Pacific Ocean, connecting the Andaman Sea with the South China Sea. However, the Irrawaddy River system is not related to Indonesia. It is actually located in Myanmar (formerly known as Burma) and is one of the country's major river systems. Therefore, only Statement 1 is correct while Statement 2 is incorrect."
    },
    {
        "questionId": 71,
        "questionType": "chronology",
        "answer": "B) 1, 2, 4, 3",
        "explanation": "B) 1, 2, 4, 3. The correct chronological order of the events is as follows: 1. Death of C.R. Das, 2. Simon Commission appointed, 3. Nehru Report, 4. Death of revolutionary Jatin Das. Therefore, option B) 1, 2, 4, 3 is the correct answer."
    },
    {
        "questionId": 72,
        "questionType": "chronology",
        "answer": "A) 1, 2, 3, 4",
        "explanation": "A) 1, 2, 3, 4. The correct chronological order of the later Mughal Badshahs is as follows: 1. Jahandar Shah, 2. Farrukhsiyar, 3. Ahmed Shah, 4. Alamgir II. Therefore, option A) 1, 2, 3, 4 is the correct answer."
    },
    {
        "questionId": 73,
        "questionType": "chronology",
        "answer": "B) 2, 1, 3, 4",
        "explanation": "B) 2, 1, 3, 4. The correct order of the rivers from East to West direction is as follows: 1. Teesta river, 2. Kosi river, 3. Gandak river, 4. Sharda river. Therefore, option B) 2, 1, 3, 4 is the correct answer."
    },
    {
        "questionId": 74,
        "questionType": "chronology",
        "answer": "B) 1, 2, 3, 4",
        "explanation": "B) 1, 2, 3, 4. The correct order of the countries from North to South is as follows: 1. Norway, 2. Denmark, 3. Austria, 4. Spain. Therefore, option B) 1, 2, 3, 4 is the correct answer."
    },
    {
        "questionId": 75,
        "questionType": "chronology",
        "answer": "D) 2, 3, 4, 1",
        "explanation": "D) 2, 3, 4, 1. The correct order from South to North is as follows: 1. Gulf of Mexico, 2. Hudson Bay, 3. Baffin Bay, 4. Arctic Ocean. Therefore, option D) 2, 3, 4, 1 is the correct answer."
    },
    {
        "questionId": 76,
        "questionType": "chronology",
        "answer": "B) 3, 2, 4, 1",
        "explanation": "B) 3, 2, 4, 1. The correct chronological order with the dates of their start is as follows: 1. Champaran Satyagrah (1917), 2. Khera Peasants Movement (1918), 3. Mopla Peasants Movement (1921), 4. Bardoli Peasants Movement (1928). Therefore, option B) 3, 2, 4, 1 is the correct answer."
    },
    {
        "questionId": 77,
        "questionType": "chronology",
        "answer": "C) 3, 2, 4,1",
        "explanation": "C) 3, 2, 4, 1. The correct sequence of steps in relation to self-help groups is as follows: 1. Identifying the area and forming a group of women with common interests, 2. Arranging regular meetings with groups, 3. Deciding on the amount for contribution and pooling the money, 4. Lending, repayment and maintaining accounts and records. Therefore, option C) 3, 2, 4, 1 is the correct answer."
    },
    {
        "questionId": 78,
        "questionType": "chronology",
        "answer": "C) 3, 1, 4, 2",
        "explanation": "C) 3, 1, 4, 2. The correct chronological order of the four Indo-US defence agreements based on the year of signing is as follows: 1. General Security of Military Information Agreement (GSOMIA), 2. Logistics Exchange Memorandum of Association (LEMOA), 3. Communications Compatibility and Security Agreement (COMCASA), 4. Basic Exchange and Cooperation Agreement (BECA). Therefore, option C) 3, 1, 4, 2 is the correct answer."
    },
    {
        "questionId": 79,
        "questionType": "statements",
        "answer": "A) 1 and 2",
        "explanation": "A) 1 and 2. The correct statements are: Statement 1 - In 1865, High Courts were established at Calcutta, Madras, and Bombay. Statement 2 - In 1791, Jonathan Duncan started a Sanskrit College at Varanasi. Therefore, option A) 1 and 2 is the correct answer."
    },
    {
        "questionId": 80,
        "questionType": "statements",
        "answer": "A) 3 and 4",
        "explanation": "A) 3 and 4. The correct statements are: Statement 3 - Tipu Sultan planted a 'Tree of Liberty' at Srirangapatnam. Statement 4 - Tipu Sultan was a member of a 'Jacobin Club'. Therefore, option A) 3 and 4 is the correct answer."
    },
    {
        "questionId": 81,
        "questionType": "statements",
        "answer": "B) 1 and 3",
        "explanation": "B) 1 and 3. The correct statements are: Statement 1 - Jute is used for making decorative items. Statement 3 - Cotton requires a clear sky during the flowering stage. Therefore, option B) 1 and 3 is the correct answer."
    },
    {
        "questionId": 82,
        "questionType": "statements",
        "answer": "A) 1 and 2",
        "explanation": "A) 1 and 2. The correct statements are: Statement 1 - Dholavira. Statement 2 - Rakhigarhi. Therefore, option A) 1 and 2 is the correct answer."
    },
    {
        "questionId": 83,
        "questionType": "statements",
        "answer": "A) 2 and 4",
        "explanation": "A) 2 and 4. The correct statements are: Statement 2 - Croats are inhabitants of Croatia. Statement 4 - People of New Zealand are known as Kiwis. Therefore, option A) 2 and 4 is the correct answer."
    },
    {
        "questionId": 84,
        "questionType": "statements",
        "answer": "D) 1 and 4",
        "explanation": "D) 1 and 4. The correct statements are: Statement 1 - Miami Beach is a centre for many world beauty contests. Statement 4 - Istanbul is formerly known as Constantinople. Therefore, option D) 1 and 4 is the correct answer."
    },
    {
        "questionId": 85,
        "questionType": "statements",
        "answer": "A) 1 and 2",
        "explanation": "A) 1 and 2. The correct statements are: Statement 1 - Part IX has been created after the passing of the 73rd constitutional amendment. Statement 2 - Part IXA has been created with the passing of the 74th constitutional amendment. Therefore, option A) 1 and 2 is the correct answer."
    },
    {
        "questionId": 86,
        "questionType": "statements",
        "answer": "C) 2 and 3",
        "explanation": "C) 2 and 3. The correct statements are: Statement 2 - Justice Ranjan Gogoi joined Rajya Sabha after retirement from the Supreme Court. Statement 3 - Justice P.N. Bhagwati introduced Public Interest Litigation (PIL). Therefore, option C) 2 and 3 is the correct answer."
    },
    {
        "questionId": 87,
        "questionType": "statements",
        "answer": "C) 1 and 3",
        "explanation": "C) 1 and 3. The correct statements are: Statement 1 - 'Ease of Living Index' is released by the Ministry of Housing and Urban Affairs. Statement 3 - The Citizen Participation survey is an important part of the Index assessment. Therefore, option C) 1 and 3 is the correct answer."
    },
    {
        "questionId": 88,
        "questionType": "statements",
        "answer": "D) 1 and 4",
        "explanation": "D) 1 and 4. The correct statements are: Statement 1 - 'Jaivik Kheti Portal' is an initiative of the Ministry of Agriculture, Department of Agriculture along with the Ministry of Science Technology and Climate change. Statement 4 - This portal provides price discovery mechanisms to help farmers. Therefore, option D) 1 and 4 is the correct answer."
    },
    {
        "questionId": 89,
        "questionType": "statements",
        "answer": "B) 3 and 4",
        "explanation": "B) 3 and 4. The correct statements are: Statement 3 - Blood plasma does not contain haemoglobin. Statement 4 - Only individuals who have recovered from a coronavirus infection and have developed antibodies can donate blood plasma to help other affected individuals. Therefore, option B) 3 and 4 is the correct answer."
    },
    {
        "questionId": 90,
        "questionType": "list",
        "answer": "B) (A-4) (B-3) (C-1) (D-2)",
        "explanation": "B) (A-4) (B-3) (C-1) (D-2). The correct matching of events with their corresponding years is as follows: a. Delhi Darbar - 1877, b. Second Anglo-Afghan war - 1878, c. Kuka Movement starts - 1872, d. Queen Victoria declared 'Kaiser-i-Hind' - 1876. Therefore, option B) (A-4) (B-3) (C-1) (D-2) is the correct answer."
    },
    {
        "questionId": 91,
        "questionType": "list",
        "answer": "B) (A-2) (B-3) (C-4) (D-1)",
        "explanation": "B) (A-2) (B-3) (C-4) (D-1). The correct matching of the types of climate with their corresponding regions is as follows: a. Tropical savannah - Most of the peninsular plateaus, b. Hot desert - Western Rajasthan, c. Polar type - Jammu and Kashmir, d. Monsoon with dry summer - Coromandel coast of Tamil Nadu. Therefore, option B) (A-2) (B-3) (C-4) (D-1) is the correct answer."
    },
    {
        "questionId": 92,
        "questionType": "list",
        "answer": "B) (A-4) (B-3) (C-1) (D-2)",
        "explanation": "B) (A-4) (B-3) (C-1) (D-2). The correct matching of the amendments with their corresponding issues is as follows: A. First Amendment - Ninth Schedule, B. Forty-fourth amendment - Right to Property, C. Eighty-sixth amendment - Right to Education, D. One hundred and third amendment - Reservation for EWS. Therefore, option B) (A-4) (B-3) (C-1) (D-2) is the correct answer."
    },
    {
        "questionId": 93,
        "questionType": "list",
        "answer": "C) (A-3) (B-4) (C-2) (D-1)",
        "explanation": "C) (A-3) (B-4) (C-2) (D-1). The correct matching of the Constitution articles with their corresponding area of reservations is as follows: A. Article 15 (4) and 16 (4) - Economically Weaker Sections (EWS), B. Article 15 (6) and 16 (6) - Other Backward Classes (OBCs), C. Article 243 D - Panchayati Raj Institutions, D. Article 330 - Lok Sabha Seats. Therefore, option C) (A-3) (B-4) (C-2) (D-1) is the correct answer."
    },
    {
        "questionId": 94,
        "questionType": "list",
        "answer": "C) (A-1) (B-2) (C-3) (D-4)",
        "explanation": "C) (A-1) (B-2) (C-3) (D-4). The correct matching of the terms in List-I with their corresponding values in List-II is as follows: A. Net Tax Revenue - 6%, B. Non-Tax Revenue - 22.3%, C. Gross Tax Revenue - 8.4%, D. Non-debt Capital Receipts - (-2.5%). Therefore, option C) (A-1) (B-2) (C-3) (D-4) is the correct answer."
    },
    {
        "questionId": 95,
        "questionType": "list",
        "answer": "A) (A-4) (B-3) (C-1) (D-2)",
        "explanation": "A) (A-4) (B-3) (C-1) (D-2). The correct matching of the terms in List-I with their corresponding values in List-II is as follows: A. Litmus - Lichen, B. Nitrogen - Anti microbial agent, C. Calcium Hydroxyapatite - Tooth enamel, D. Hydrogen Peroxide - Chips sealed in packet. Therefore, option A) (A-4) (B-3) (C-1) (D-2) is the correct answer."
    },
    {
        "questionId": 96,
        "questionType": "list",
        "answer": "D) (A-3) (B-1) (C-4) (D-2)",
        "explanation": "D) (A-3) (B-1) (C-4) (D-2). The correct matching of the terms in List-I with their corresponding values in List-II is as follows: A. S.I. unit of power of a lens - Diopter, B. S.I. unit of electric potential difference - Volt, C. Potential difference between two points - W/Q, D. S.I. unit of electric charge - Coulomb. Therefore, option D) (A-3) (B-1) (C-4) (D-2) is the correct answer."
    },
    {
        "questionId": 97,
        "questionType": "list",
        "answer": "D) (A-2) (B-3) (C-1) (D-4)",
        "explanation": "D) (A-2) (B-3) (C-1) (D-4). The correct matching of the terms in List-I with their corresponding values in List-II is as follows: A. Peristaltic movement - Alimentary canal, B. Gastric glands - Inner lining of stomach, C. Amylase - Saliva, D. Bile juice - Liver. Therefore, option D) (A-2) (B-3) (C-1) (D-4) is the correct answer."
    },
    {
        "questionId": 98,
        "questionType": "list",
        "answer": "B) (A-2) (B-3) (C-1) (D-4)",
        "explanation": "B) (A-2) (B-3) (C-1) (D-4). The correct matching of the terms in List-I with their corresponding values in List-II is as follows: A. Gregor Mendel - Origin of organic molecules on earth, B. Harold C. Urey - University of Vienna Charles Darwin, C. Charles Darwin - Role of earthworms in soil fertility, D. Charles Darwin - Periodic table. Therefore, option B) (A-2) (B-3) (C-1) (D-4) is the correct answer."
    },
    {
        "questionId": 99,
        "questionType": "list",
        "answer": "A) (A-3) (B-1) (C-4) (D-2)",
        "explanation": "A) (A-3) (B-1) (C-4) (D-2). The correct matching of the terms in List-I with their corresponding values in List-II is as follows: A. B.C.Roy Trophy - Football, B. Ezra Cup - Polo, C. Murugappa Gold Cup - Hockey, D. Nehru Trophy - Boat Race. Therefore, option A) (A-3) (B-1) (C-4) (D-2) is the correct answer."
    },
    {
        "questionId": 100,
        "questionType": "list",
        "answer": "C) (A-4) (B-1) (C-2) (D-3)",
        "explanation": "C) (A-4) (B-1) (C-2) (D-3). The correct matching of the persons in List-I with their corresponding areas in List-II is as follows: A. Jennifer Doudna - Chemistry, B. Robert B. Wilson - Economics, C. Andrea M. Ghez - Physics, D. Louise Gluck - Literature. Therefore, option C) (A-4) (B-1) (C-2) (D-3) is the correct answer."
    }
]